[
    {
        "Level1": "ศาล",
        "Level2": ["สำนักงานศาลปกครอง", "สำนักงานศาลยุติธรรม", "สำนักงานศาลรัฐธรรมนูญ"]
    },
    {
        "Level1":"กระทรวงคมนาคม",
        "Level2":["บริษัท วิทยุการบินแห่งประเทศไทย จำกัด", "บริษัท ท่าอากาศยานไทย จำกัด (มหาชน)", "องค์การขนส่งมวลชนกรุงเทพ", "สำนักงานการบินพลเรือนแห่งประเทศไทย", "สถาบันการบินพลเรือน", "การทางพิเศษแห่งประเทศไทย", "สำนักงานรัฐมนตรี", "สำนักงานปลัดกระทรวงคมนาคม", "กรมเจ้าท่า", "กรมการขนส่งทางบก", "กรมท่าอากาศยาน", "กรมทางหลวง", "กรมทางหลวงชนบท", "สำนักงานนโยบายและแผนการขนส่งและจราจร", "การรถไฟฟ้าขนส่งมวลชนแห่งประเทศไทย", "การท่าเรือแห่งประเทศไทย", "การรถไฟแห่งประเทศไทย", "บริษัท รถไฟฟ้า ร.ฟ.ท. จำกัด", "บริษัท โรงแรมท่าอากาศยานสุวรรณภูมิ จำกัด", "บริษัท การบินไทย จำกัด (มหาชน)", "บริษัท ไทย-อะมาดิอุส เซาท์อีสต์ เอเชีย จำกัด", "บริษัท ไทยสมายล์แอร์เวย์ จำกัด", "บริษัท ขนส่ง จำกัด"]
    },
    {
        "Level1":"หน่วยงานอิสระ",
        "Level2":["สำนักงานอัยการสูงสุด", "สำนักงานคณะกรรมการการเลือกตั้ง", "สำนักงานคณะกรรมการปฏิรูปกฎหมาย", "สำนักงานคณะกรรมการป้องกันและปราบปรามการทุจริตแห่งชาติ", "สำนักงานคณะกรรมการกิจการกระจายเสียง กิจการโทรทัศน์และกิจการโทรคมนาคมแห่งชาติ (สำนักงาน กสทช.)", "สำนักงานสภาที่ปรึกษาเศรษฐกิจและสังคมแห่งชาติ", "สำนักงานคณะกรรมการสิทธิมนุษยชนแห่งชาติ", "สำนักงานการตรวจเงินแผ่นดิน", "สำนักงานผู้ตรวจการแผ่นดิน"]
    },


    {
        "Level1":"กระทรวงวิทยาศาสตร์และเทคโนโลยี",
        "Level2":"สำนักงานรัฐมนตรี",
        "Level3":["สำนักงานรัฐมนตรี"]
    },
    {
        "Level1":"กระทรวงสาธารณสุข",
        "Level2":"กรมสนับสนุนบริการสุขภาพ",
        "Level3":["สำนักบริหาร", "กลุ่มอำนวยการ", "กลุ่มเทคโนโลยีสารสนเทศ", "กลุ่มบริหารทรัพยากรบุคคล", "กลุ่มแผนงาน", "สำนักสถานพยาบาลและการประกอบโรคศิลปะ", "กองแบบแผน", "กองวิศวกรรมการแพทย์", "กองสนับสนุนสุขภาพภาคประชาชน", "กองสุขศึกษา", "กองสุขภาพระหว่างประเทศ", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มกฎหมาย", "กลุ่มงานคุ้มครองจริยธรรม", "สำนักงานสนับสนุนบริการสุขภาพ เขต 1 จังหวัดเชียงใหม่", "สำนักงานสนับสนุนบริการสุขภาพ เขต 2 จังหวัดพิษณุโลก", "สำนักงานสนับสนุนบริการสุขภาพ เขต 3 จังหวัดนครสวรรค์", "สำนักงานสนับสนุนบริการสุขภาพ เขต 4 จังหวัดนนทบุรี", "สำนักงานสนับสนุนบริการสุขภาพ เขต 5 จังหวัดราชบุรี", "สำนักงานสนับสนุนบริการสุขภาพ เขต 6 จังหวัดชลบุรี", "สำนักงานสนับสนุนบริการสุขภาพ เขต 7 จังหวัดขอนแก่น", "สำนักงานสนับสนุนบริการสุขภาพ เขต 8 จังหวัดอุดรธานี", "สำนักงานสนับสนุนบริการสุขภาพ เขต 9 จังหวัดนครราชสีมา", "สำนักงานสนับสนุนบริการสุขภาพ เขต 10 จังหวัดอุบลราชธานี", "สำนักงานสนับสนุนบริการสุขภาพ เขต 11 จังหวัดสุราษฎร์ธานี", "สำนักงานสนับสนุนบริการสุขภาพ เขต 12 จังหวัดสงขลา", "กองสถานประกอบการเพื่อสุขภาพ", "สถาบันพัฒนานวัตกรรมด้านระบบบริการสุขภาพ ภาคเหนือ จังหวัดนครสวรรค์", "สถาบันพัฒนานวัตกรรมด้านระบบบริการสุขภาพ ภาคตะวันออกเฉียงเหนือ จังหวัดอุดรธานี", "สถาบันพัฒนานวัตกรรมด้านระบบบริการสุขภาพ ภาคกลาง จังหวัดชลบุรี", "สถาบันพัฒนานวัตกรรมด้านระบบบริการสุขภาพ ภาคใต้ จังหวัดนครศรีธรรมราช", "สถาบันพัฒนานวัตกรรมด้านระบบบริการสุขภาพ ชายแดนภาคใต้ จังหวัดยะลา"]
    }
]