[{
    "level1": "ศาล",
    "level2": ["สำนักงานศาลปกครอง", "สำนักงานศาลยุติธรรม", "สำนักงานศาลรัฐธรรมนูญ"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": ["บริษัท วิทยุการบินแห่งประเทศไทย จำกัด", "บริษัท ท่าอากาศยานไทย จำกัด (มหาชน)", "องค์การขนส่งมวลชนกรุงเทพ", "สำนักงานการบินพลเรือนแห่งประเทศไทย", "สถาบันการบินพลเรือน", "การทางพิเศษแห่งประเทศไทย", "สำนักงานรัฐมนตรี", "สำนักงานปลัดกระทรวงคมนาคม", "กรมเจ้าท่า", "กรมการขนส่งทางบก", "กรมท่าอากาศยาน", "กรมทางหลวง", "กรมทางหลวงชนบท", "สำนักงานนโยบายและแผนการขนส่งและจราจร", "การรถไฟฟ้าขนส่งมวลชนแห่งประเทศไทย", "การท่าเรือแห่งประเทศไทย", "การรถไฟแห่งประเทศไทย", "บริษัท รถไฟฟ้า ร.ฟ.ท. จำกัด", "บริษัท โรงแรมท่าอากาศยานสุวรรณภูมิ จำกัด", "บริษัท การบินไทย จำกัด (มหาชน)", "บริษัท ไทย-อะมาดิอุส เซาท์อีสต์ เอเชีย จำกัด", "บริษัท ไทยสมายล์แอร์เวย์ จำกัด", "บริษัท ขนส่ง จำกัด"]
}, {
    "level1": "หน่วยงานอิสระ",
    "level2": ["สำนักงานอัยการสูงสุด", "สำนักงานคณะกรรมการการเลือกตั้ง", "สำนักงานคณะกรรมการปฏิรูปกฎหมาย", "สำนักงานคณะกรรมการป้องกันและปราบปรามการทุจริตแห่งชาติ", "สำนักงานคณะกรรมการกิจการกระจายเสียง กิจการโทรทัศน์และกิจการโทรคมนาคมแห่งชาติ (สำนักงาน กสทช.)", "สำนักงานสภาที่ปรึกษาเศรษฐกิจและสังคมแห่งชาติ", "สำนักงานคณะกรรมการสิทธิมนุษยชนแห่งชาติ", "สำนักงานการตรวจเงินแผ่นดิน", "สำนักงานผู้ตรวจการแผ่นดิน"]
}, {
    "level1": "หน่วยงานขึ้นตรงนายกรัฐมนตรี",
    "level2": ["สำนักงานป้องกันและปราบปรามการฟอกเงิน", "สำนักงานพระพุทธศาสนาแห่งชาติ", "สำนักงานคณะกรรมการป้องกันและปราบปรามการทุจริตในภาครัฐ (ป.ป.ท.)", "สำนักงานตำรวจแห่งชาติ", "สำนักงานคณะกรรมการพิเศษเพื่อประสานงานโครงการอันเนื่องมาจากพระราชดำริ (สำนักงาน กปร.)", "สำนักงานราชบัณฑิตยสภา", "ศูนย์อำนวยการบริหารจังหวัดชายแดนภาคใต้ (ศอ.บต.)"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": ["สำนักงานพัฒนาการวิจัยการเกษตร (องค์การมหาชน)", "องค์การส่งเสริมกิจการโคนมแห่งประเทศไทย", "องค์การสะพานปลา", "สถาบันวิจัยและพัฒนาพื้นที่สูง (องค์การมหาชน)", "สำนักงานปลัดกระทรวงเกษตรและสหกรณ์", "กรมชลประทาน", "กรมตรวจบัญชีสหกรณ์", "กรมประมง", "กรมปศุสัตว์", "กรมพัฒนาที่ดิน", "กรมวิชาการเกษตร", "กรมส่งเสริมการเกษตร", "กรมส่งเสริมสหกรณ์", "สำนักงานปฏิรูปที่ดินเพื่อเกษตรกรรม", "สำนักงานมาตรฐานสินค้าเกษตรและอาหารแห่งชาติ", "กรมการข้าว", "กรมหม่อนไหม", "กรมฝนหลวงและการบินเกษตร", "สำนักงานเศรษฐกิจการเกษตร", "องค์การตลาดเพื่อเกษตรกร", "การยางแห่งประเทศไทย", "สำนักงานพิพิธภัณฑ์เกษตรเฉลิมพระเกียรติพระบาทสมเด็จพระเจ้าอยู่หัว (องค์การมหาชน)"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": ["มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา", "สถาบันวิทยาลัยชุมชน", "มหาวิทยาลัยราชภัฏบุรีรัมย์", "มหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา", "มหาวิทยาลัยบูรพา", "มหาวิทยาลัยราชภัฏเชียงใหม่", "มหาวิทยาลัยเชียงใหม่", "มหาวิทยาลัยราชภัฏชัยภูมิ", "มหาวิทยาลัยราชภัฏเชียงราย", "มหาวิทยาลัยราชภัฏจันทรเกษม", "จุฬาลงกรณ์มหาวิทยาลัย", "มหาวิทยาลัยราชภัฏธนบุรี", "สถาบันระหว่างประเทศเพื่อการค้าและการพัฒนา", "มหาวิทยาลัยขอนแก่น", "สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง", "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ", "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี", "มหาวิทยาลัยราชภัฏกำแพงเพชร", "มหาวิทยาลัยราชภัฏกาญจนบุรี", "มหาวิทยาลัยกาฬสินธุ์", "มหาวิทยาลัยเกษตรศาสตร์", "มหาวิทยาลัยราชภัฏลำปาง", "มหาวิทยาลัยราชภัฏเลย", "มหาวิทยาลัยมหามกุฏราชวิทยาลัย (มมร)", "มหาวิทยาลัยราชภัฏหมู่บ้านจอมบึง", "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย", "มหาวิทยาลัยแม่ฟ้าหลวง", "มหาวิทยาลัยแม่โจ้", "สำนักงานรัฐมนตรี", "สำนักงานปลัดกระทรวงศึกษาธิการ", "สำนักงานเลขาธิการสภาการศึกษา", "สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน", "สำนักงานคณะกรรมการการอุดมศึกษา (สกอ.)", "สำนักงานคณะกรรมการการอาชีวศึกษา", "สำนักงานเลขาธิการคุรุสภา", "สำนักงานลูกเสือแห่งชาติ", "สถาบันส่งเสริมการสอนวิทยาศาสตร์และเทคโนโลยี", "กองทุนสงเคราะห์ กระทรวงศึกษาธิการ", "มหาวิทยาลัยมหาสารคาม", "มหาวิทยาลัยมหิดล", "โรงเรียนมหิดลวิทยานุสรณ์", "สถาบันบัณฑิตพัฒนบริหารศาสตร์", "สถาบันทดสอบทางการศึกษาแห่งชาติ", "มหาวิทยาลัยราชภัฎนครปฐม", "มหาวิทยาลัยราชภัฏนครราชสีมา", "มหาวิทยาลัยราชภัฏนครสวรรค์", "มหาวิทยาลัยราชภัฏนครศรีธรรมราช", "มหาวิทยาลัยนเรศวร", "มหาวิทยาลัยราชภัฏเพชรบุรี", "มหาวิทยาลัยราชภัฏเพชรบูรณ์", "สถาบันดนตรีกัลยาณิวัฒนา", "สถาบันเทคโนโลยีปทุมวัน", "มหาวิทยาลัยราชภัฏภูเก็ต", "มหาวิทยาลัยราชภัฏพระนคร", "มหาวิทยาลัยนราธิวาสราชนครินทร์", "มหาวิทยาลัยราชภัฏพิบูลสงคราม", "มหาวิทยาลัยสงขลานครินทร์", "มหาวิทยาลัยราชภัฏร้อยเอ็ด", "มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน", "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา", "มหาวิทยาลัยเทคโนโลยีราชมงคลพระนคร", "มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์", "มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย", "มหาวิทยาลัยเทคโนโลยีราชมงคลธัญบุรี", "มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก", "มหาวิทยาลัยราชภัฏราชนครินทร์", "มหาวิทยาลัยรามคำแหง", "มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ", "มหาวิทยาลัยสวนดุสิต", "มหาวิทยาลัยราชภัฏสงขลา", "มหาวิทยาลัยราชภัฏสกลนคร", "มหาวิทยาลัยราชภัฏสุรินทร์", "มหาวิทยาลัยราชภัฏสุราษฎร์ธานี", "มหาวิทยาลัยราชภัฏศรีสะเกษ", "มหาวิทยาลัยราชภัฏสวนสุนันทา", "มหาวิทยาลัยสุโขทัยธรรมาธิราช", "มหาวิทยาลัยศิลปากร", "มหาวิทยาลัยเทคโนโลยีสุรนารี", "มหาวิทยาลัยศรีนครินทรวิโรฒ", "มหาวิทยาลัยราชภัฏเทพสตรี", "มหาวิทยาลัยทักษิณ", "มหาวิทยาลัยธรรมศาสตร์", "มหาวิทยาลัยราชภัฏอุบลราชธานี", "มหาวิทยาลัยอุบลราชธานี", "มหาวิทยาลัยราชภัฏอุดรธานี", "มหาวิทยาลัยพะเยา", "มหาวิทยาลัยราชภัฏอุตรดิตถ์", "มหาวิทยาลัยเทคโนโลยีราชมงคลกรุงเทพ", "มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์", "มหาวิทยาลัยราชภัฏยะลา"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": ["ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร", "บริษัท ธนารักษ์พัฒนาสินทรัพย์ จำกัด", "ธนาคารเพื่อการส่งออกและนำเข้าแห่งประเทศไทย", "ธนาคารอาคารสงเคราะห์", "สำนักงานสลากกินแบ่งรัฐบาล", "ธนาคารออมสิน", "บริษัทบริหารสินทรัพย์ ธนาคารอิสลามแห่งประเทศไทย จำกัด", "ธนาคารอิสลามแห่งประเทศไทย", "ธนาคารกรุงไทย จำกัด (มหาชน)", "องค์การสุรา กรมสรรพสามิต", "บริษัท อสมท จำกัด (มหาชน)", "สำนักงานรัฐมนตรี กระทรวงการคลัง", "สำนักงานปลัดกระทรวงการคลัง", "กรมธนารักษ์", "กรมบัญชีกลาง", "กรมศุลกากร", "กรมสรรพสามิต", "กรมสรรพากร", "สำนักงานคณะกรรมการนโยบายรัฐวิสาหกิจ", "สำนักงานบริหารหนี้สาธารณะ", "สำนักงานเศรษฐกิจการคลัง", "กองทุนการออมแห่งชาติ", "สำนักงานความร่วมมือพัฒนาเศรษฐกิจกับประเทศเพื่อนบ้าน", "สำนักงานคณะกรรมการกำกับและส่งเสริมการประกอบธุรกิจประกันภัย (คปภ.)", "โรงงานไพ่ กรมสรรพสามิต", "บริษัท สหโรงแรมไทยและท่องเที่ยว จำกัด", "บรรษัทตลาดรองสินเชื่อที่อยู่อาศัย", "ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อมแห่งประเทศไทย", "บรรษัทประกันสินเชื่ออุตสาหกรรมขนาดย่อม", "โรงงานยาสูบ"]
}, {
    "level1": "กระทรวงกลาโหม",
    "level2": ["บริษัท อู่กรุงเทพ จำกัด", "สถาบันเทคโนโลยีป้องกันประเทศ", "สำนักงานปลัดกระทรวงกลาโหม", "กองบัญชาการกองทัพไทย", "กองทัพบก", "กองทัพเรือ", "กองทัพอากาศ", "กองทัพไทย"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": ["สำนักงบประมาณ", "สำนักงานคณะกรรมการส่งเสริมการลงทุน", "องค์การบริหารการพัฒนาการพื้นที่พิเศษเพื่อการท่องเที่ยวอย่างยังยืน", "สำนักงานพัฒนารัฐบาลดิจิทัล", "สำนักงานคณะกรรมการพัฒนาการเศรษฐกิจและสังคมแห่งชาติ", "กองอำนวยการรักษาความมั่นคงภายในราชอาณาจักร (กอ.รมน.)", "สำนักงานคณะกรรมการกฤษฎีกา", "สถาบันบริหารจัดการธนาคารที่ดิน", "สำนักข่าวกรองแห่งชาติ", "สำนักงานคณะกรรมการวิจัยแห่งชาติ", "สำนักงานสภาความมั่นคงแห่งชาติ", "สำนักงาน ก.พ.", "สำนักงานบริหารและพัฒนาองค์ความรู้", "สำนักงานรับรองมาตรฐานและประเมินคุณภาพการศึกษา", "สำนักงานคณะกรรมการพัฒนาระบบราชการ", "สำนักงานปลัดสำนักนายกรัฐมนตรี", "กรมประชาสัมพันธ์", "สำนักงานคณะกรรมการคุ้มครองผู้บริโภค", "สำนักงานส่งเสริมวิสาหกิจขนาดกลางและขนาดย่อม", "สำนักงานพัฒนาพิงคนคร", "สำนักงานส่งเสริมการจัดประชุมและนิทรรศการ", "สำนักงานเลขาธิการนายกรัฐมนตรี", "สถาบันคุณวุฒิวิชาชีพ"]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": ["โรงพยาบาลบ้านแพ้ว", "องค์การเภสัชกรรม", "สถาบันรับรองคุณภาพสถานพยาบาล", "สำนักงานปลัดกระทรวงสาธารณสุข", "กรมการแพทย์", "กรมควบคุมโรค", "กรมการแพทย์แผนไทยและการแพทย์ทางเลือก", "กรมวิทยาศาสตร์การแพทย์", "กรมสนับสนุนบริการสุขภาพ", "กรมสุขภาพจิต", "กรมอนามัย", "สำนักงานคณะกรรมการอาหารและยา", "สำนักงานหลักประกันสุขภาพแห่งชาติ (nhso)", "สถาบันวัคซีนแห่งชาติ"]
}, {
    "level1": "กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม",
    "level2": ["บริษัท กสท โทรคมนาคม จำกัด (มหาชน)", "สำนักงานพัฒนาธุรกรรมทางอิเล็กทรอนิกส์ (องค์การมหาชน)", "กองบังคับการปราบปรามการกระทำความผิดเกี่ยวกับอาชญากรรมทางเทคโนโลยี", "สำนักงานส่งเสริมเศรษฐกิจดิจิทัล", "สำนักงานปลัดกระทรวงดิจิทัลเพื่อเศรษฐิจและสังคม", "กรมอุตุนิยมวิทยา", "สำนักงานคณะกรรมการดิจิทัลเพื่อเศรษฐกิจและสังคมแห่งชาติ", "สำนักงานสถิติแห่งชาติ", "บริษัท ไปรษณีย์ไทย จำกัด", "บริษัท ทีโอที จำกัด (มหาชน)"]
}, {
    "level1": "กระทรวงพลังงาน",
    "level2": ["สถาบันบริหารกองทุนพลังงาน", "การไฟฟ้าฝ่ายผลิตแห่งประเทศไทย", "สำนักงานปลัดกระทรวงพลังงาน", "กรมเชื้อเพลิงธรรมชาติ", "กรมธุรกิจพลังงาน", "กรมพัฒนาพลังงานทดแทนและอนุรักษ์พลังงาน", "สำนักงานนโยบายและแผนพลังงาน", "คณะกรรมการกำกับกิจการพลังงาน", "บริษัท ปตท. จำกัด (มหาชน)"]
}, {
    "level1": "กระทรวงวัฒนธรรรม",
    "level2": ["หอภาพยนตร์ (องค์การมหาชน)", "สำนักงานรัฐมนตรี", "สำนักงานปลัดกระทรวงวัฒนธรรม", "กรมการศาสนา", "กรมศิลปากร", "กรมส่งเสริมวัฒนธรรม", "สำนักงานศิลปวัฒนธรรมร่วมสมัย", "สถาบันบัณฑิตพัฒนศิลป์", "ศูนย์คุณธรรรม (องค์การมหาชน)", "ศูนย์มานุษยวิทยาสิรินธร (องค์การมหาชน)"]
}, {
    "level1": "กระทรวงพาณิชย์",
    "level2": ["สถาบันวิจัยและพัฒนาอัญมณีและเครื่องประดับแห่งชาติ (องค์การมหาชน)", "สำนักงานปลัดกระทรวงพาณิชย์", "กรมการค้าต่างประเทศ", "กรมการค้าภายใน", "กรมเจรจาการค้าระหว่างประเทศ", "กรมทรัพย์สินทางปัญญา", "กรมพัฒนาธุรกิจการค้า", "กรมส่งเสริมการค้าระหว่างประเทศ", "สำนักงานนโยบายและยุทธศาสตร์การค้า", "องค์การคลังสินค้า", "ศูนย์ส่งเสริมศิลปาชีพระหว่างประเทศ (องค์การมหาชน)"]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": ["การนิคมอุตสาหกรรมแห่งประเทศไทย", "สำนักงานปลัดกระทรวงอุตสาหกรรม(ราชการบริหารส่วนภูมิภาค)", "สำนักงานรัฐมนตรี", "สถาบันเพิ่มผลผลิตแห่งชาติ", "สำนักงานปลัดกระทรวงอุตสาหกรรม (ราชการบริหารส่วนกลาง)", "สถาบันไทย -  เยอรมัน", "กรมโรงงานอุตสาหกรรม", "สถาบันอาหาร", "กรมส่งเสริมอุตสาหกรรม", "สถาบันพัฒนาอุตสาหกรรมสิ่งทอ", "กรมอุตสาหกรรมพื้นฐานและการเหมืองแร่", "สถาบันรับรองมาตรฐานไอเอสโอ", "สำนักงานคณะกรรมการอ้อยและน้ำตาลทราย", "สถาบันยานยนต์", "สำนักงานมาตรฐานผลิตภัณฑ์อุตสาหกรรม", "สถาบันไฟฟ้าและอิเล็กทรอนิกส์", "สำนักงานเศรษฐกิจอุตสาหกรรม", "สถาบันเหล็กและเหล็กกล้าแห่งประเทศไทย", "สถาบันพัฒนาวิสาหกิจขนาดกลางและขนาดย่อม", "สถาบันพลาสติก", "สถาบันการก่อสร้างแห่งประเทศไทย"]
}, {
    "level1": "กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์",
    "level2": ["สำนักงานปลัดกระทรวงฯ", "สำนักงานรัฐมนตรี", "กรมกิจการเด็กและเยาวชน", "กรมกิจการผู้สูงอายุ", "กรมกิจการสตรีและสถาบันครอบครัว", "กรมพัฒนาสังคมและสวัสดิการ", "กรมส่งเสริมและพัฒนาคุณภาพชีวิตคนพิการ", "การเคหะแห่งชาติ", "สำนักงานธนานุเคราะห์", "สถาบันพัฒนาองค์กรชุมชน"]
}, {
    "level1": "กระทรวงการต่างประเทศ",
    "level2": ["สำนักปลัดกระทรวงการต่างประเทศ"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": ["องค์การบริหารจัดการก๊าซเรือนกระจก", "สำนักงานปลัดกระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม", "สำนักงานพัฒนาเศรษฐกิจจากฐานชีวภาพ", "กรมควบคุมมลพิษ", "กรมทรัพยากรทางทะเลและชายฝั่ง", "กรมทรัพยากรธรณี", "กรมทรัพยากรน้ำ", "กรมทรัพยากรน้ำบาดาล", "กรมส่งเสริมคุณภาพสิ่งแวดล้อม", "กรมอุทยานแห่งชาติ สัตว์ป่า และพันธุ์พืช", "สำนักงานนโยบายและแผนทรัพยากรธรรมชาติและสิ่งแวดล้อม", "องค์การสวนสัตว์", "องค์การสวนพฤกษศาสตร์", "องค์การจัดการน้ำเสีย", "องค์การอุตสาหกรรมป่าไม้", "กรมป่าไม้"]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": ["กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร", "ขอนแก่น", "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท", "ชัยภูมิ", "ชุมพร", "เชียงราย", "เชียงใหม่", "ตรัง", "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม", "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์", "นนทบุรี", "นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์", "ปราจีนบุรี", "ปัตตานี", "พะเยา", "พระนครศรีอยุธยา", "พังงา", "พัทลุง", "พิจิตร", "พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์", "แพร่", "ภูเก็ต", "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน", "ยโสธร", "ยะลา", "ร้อยเอ็ด", "ระนอง", "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย", "ศรีสะเกษ", "สกลนคร", "สงขลา", "สตูล", "สมุทรปราการ", "สมุทรสงคราม", "สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี", "สุโขทัย", "สุพรรณบุรี", "สุราษฎร์ธานี", "สุรินทร์", "หนองคาย", "หนองบัวลำภู", "อ่างทอง", "อำนาจเจริญ", "อุดรธานี", "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี", "ภาคกลางตอนบน", "ภาคกลางปริมณฑล", "ภาคกลางตอนล่าง 1", "ภาคกลางตอนล่าง 2", "ภาคใต้ฝั่งอ่าวไทย", "ภาคใต้ฝั่งอันดามัน", "ภาคใต้ชายแดน", "ภาคตะวันออก 1", "ภาคตะวันออก 2", "ภาคตะวันออกเฉียงเหนือตอนบน 1", "ภาคตะวันออกเฉียงเหนือตอนบน 2", "ภาคตะวันออกเฉียงเหนือตอนกลาง", "ภาคตะวันออกเฉียงเหนือตอนล่าง 1", "ภาคตะวันออกเฉียงเหนือตอนล่าง 2", "ภาคเหนือตอนบน 1", "ภาคเหนือตอนบน 2", "ภาคเหนือตอนล่าง 1", "ภาคเหนือตอนล่าง 2"]
}, {
    "level1": "กระทรวงมหาดไทย",
    "level2": ["สำนักงานปลัดกระทรวงมหาดไทย", "กรมการปกครอง", "กรมการพัฒนาชุมชน", "กรมที่ดิน", "กรมป้องกันและบรรเทาสาธารณภัย", "กรมโยธาธิการและผังเมือง", "กรมส่งเสริมการปกครองท้องถิ่น", "องค์การตลาด", "การไฟฟ้านครหลวง", "การไฟฟ้าส่วนภูมิภาค", "การประปานครหลวง", "การประปาส่วนภูมิภาค"]
}, {
    "level1": "กระทรวงยุติธรรม",
    "level2": ["สำนักงานรัฐมนตรี", "สำนักงานปลัดกระทรวงยุติธรรม", "กรมคุมประพฤติ", "กรมคุ้มครองสิทธิและเสรีภาพ", "กรมบังคับคดี", "กรมพินิจและคุ้มครองเด็กและเยาวชน", "กรมราชทัณฑ์", "กรมสอบสวนคดีพิเศษ", "สำนักงานกิจการยุติธรรม", "สถาบันนิติวิทยาศาสตร์", "สำนักงานคณะกรรมการป้องกันและปราบปรามยาเสพติด"]
}, {
    "level1": "กระทรวงแรงงาน",
    "level2": ["สำนักงานปลัดกระทรวงแรงงาน", "กรมการจัดหางาน", "กรมพัฒนาฝีมือแรงงาน", "กรมสวัสดิการและคุ้มครองแรงงาน", "สำนักงานประกันสังคม", "สถาบันส่งเสริมความปลอดภัย อาชีวอนามัย และสภาพแวดล้อมในการทำงาน (องค์การมหาชน)"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": ["สำนักงานรัฐมนตรี (สร.)", "สำนักงานปลัดกระทรวง (สป.วท.)", "กรมวิทยาศาสตร์บริการ (วศ.)", "สำนักงานปรมาณูเพื่อสันติ (ปส.)", "สถาบันมาตรวิทยาแห่งชาติ (มว.)", "สถาบันวิจัยวิทยาศาสตร์และเทคโนโลยีแห่งประเทศไทย (วว.)", "สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน) (สทอภ.)", "สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ (พว.)", "องค์การพิพิธภัณฑ์วิทยาศาสตร์แห่งชาติ (อพ.)", "สถาบันเทคโนโลยีนิวเคลียร์แห่งชาติ (องค์การมหาชน) (สทน.)", "สำนักงานคณะกรรมการนโยบายวิทยาศาสตร์ เทคโนโลยีและนวัตกรรมแห่งชาติ (สวทน.)", "สถาบันสารสนเทศทรัพยากรน้ำและการเกษตร (องค์การมหาชน) (สสนก)", "สถาบันวิจัยดาราศาสตร์แห่งชาติ (องค์การมหาชน) (สดร.)", "สำนักงานนวัตกรรมแห่งชาติ (องค์การมหาชน) (สนช.)", "ศูนย์ความเป็นเลิศด้านชีววิทยาศาสตร์ (องค์การมหาชน) (ศลช.)", "สถาบันวิจัยแสงซินโครตรอน (องค์การมหาชน) (สซ.)"]
}, {
    "level1": "กระทรวงการท่องเที่ยวและกีฬา",
    "level2": ["กองบัญชาการตำรวจท่องเที่ยว", "สำนักงานปลัดกระทรวงการท่องเที่ยวและกีฬา", "กรมพลศึกษา", "กรมการท่องเที่ยว", "สถาบันการพลศึกษา", "การกีฬาแห่งประเทศไทย", "การท่องเที่ยวแห่งประเทศไทย (ททท.)"]
}, {
    "level1": "หน่วยงานอื่นๆ",
    "level2": ["สำนักงานคณะกรรมการการแข่งขันทางการค้า"]
}, {
    "level1": "หน่วยงานของรัฐสภา",
    "level2": ["สำนักงานเลขาธิการสภาผู้แทนราษฎร", "สำนักงานเลขาธิการวุฒิสภา"]
}, {
    "level1": "สำนักงานตำรวจแห่งชาติ",
    "level2": ["โรงพิมพ์ตำรวจ สำนักงานตำรวจแห่งชาติ"]
}]