[{
    "level1": "ศาล",
    "level2": "สำนักงานศาลปกครอง",
    "level3": ["สำนักประธานศาลปกครองสูงสุด", "สำนักงานศาลปกครองสูงสุด", "สำนักอธิบดีศาลปกครองกลาง", "สำนักงานศาลปกครองกลาง", "สำนักงานศาลปกครองขอนแก่น", "สำนักงานศาลปกครองเชียงใหม่", "สำนักงานศาลปกครองนครราชสีมา", "สำนักงานศาลปกครองนครศรีธรรมราช", "สำนักงานศาลปกครองพิษณุโลก", "สำนักงานศาลปกครองระยอง", "สำนักงานศาลปกครองสงขลา", "สำนักงานศาลปกครองอุดรธานี", "สำนักงานศาลปกครองอุบลราชธานี", "สำนักบังคับคดีปกครอง", "สำนักวิจัยและวิชาการ", "สำนักหอสมุดกฎหมายมหาชน", "สำนักประชาสัมพันธ์", "สำนักการต่างประเทศ", "สำนักงานศาลปกครอง (สศป.)", "สำนักบริหารยุทธศาสตร์", "สำนักบริหารทรัพยากรมนุษย์", "สำนักวิทยาการสารสนเทศ", "สำนักบริหารการเงินและต้นทุน", "สำนักบริหารทรัพย์สิน", "สำนักบริหารกลาง", "สำนักตรวจสอบภายใน", "สำนักกฎหมาย", "วิทยาลัยตุลาการและข้าราชการฝ่ายศาลปกครอง", "วิทยาลัยการยุติธรรมทางปกครอง", "กลุ่มช่วยอำนวยการเลขาธิการ", "สำนักงานศาลปกครองเพชรบุรี", "สำนักงานศาลปกครองนครสวรรค์"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "บริษัท วิทยุการบินแห่งประเทศไทย จำกัด",
    "level3": [""]
}, {
    "level1": "หน่วยงานอิสระ",
    "level2": "สำนักงานอัยการสูงสุด",
    "level3": ["สำนักงานนโยบาย ยุทธศาสตร์ และงบประมาณ"]
}, {
    "level1": "หน่วยงานขึ้นตรงนายกรัฐมนตรี",
    "level2": "สำนักงานป้องกันและปราบปรามการฟอกเงิน",
    "level3": ["สำนักงานเลขานุการกรม", "กองกฎหมาย", "กองกำกับและตรวจสอบ", "กองข่าวกรองทางการเงิน", "กองคดี 1", "กองคดี 2", "กองคดี 3", "กองความร่วมมือระหว่างประเทศ", "กองนโยบายและยุทธศาสตร์", "กองบริหารจัดการทรัพย์สิน", "ศูนย์เทคโนโลยีสารสนเทศ", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กองสื่อสารองค์กร", "กองคดี 4"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "บริษัท ท่าอากาศยานไทย จำกัด (มหาชน)",
    "level3": ["สำนักงานใหญ่", "ฝ่ายกลยุทธ์องค์กร", "สำนักงานบริหารโครงการก่อสร้างท่าอากาศยานสุวรรณภูมิ", "ฝ่ายแผนพัฒนาท่าอากาศยาน", "ท่าอากาศยานสุวรรณภูมิ", "ท่าอากาศยานดอนเมือง", "ท่าอากาศยานภูเก็ต", "ท่าอากาศยานเชียงใหม่", "ท่าอากาศยานหาดใหญ่", "ท่าอากาศยานแม่ฟ้าหลวง เชียงราย"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "สำนักงานพัฒนาการวิจัยการเกษตร (องค์การมหาชน)",
    "level3": ["สำนักสนับสนุนงานวิจัย", "สำนักพัฒนาบุคลากรวิจัย", "สำนักส่งเสริมการใช้ประโยชน์", "สำนักเทคโนโลยีสารสนเทศ", "สำนักบริหาร", "", "กลุ่มงานผู้อำนวยการสำนักงาน", "สำนักนโยบายและแผน"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา",
    "level3": ["กองนโยบายและแผน"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร",
    "level3": ["ฝ่ายบริหารการเงิน", "ฝ่ายกลยุทธ์การตลาดผลิตภัณฑ์", "ฝ่ายการธนาคารและธุรกิจต่างประเทศ", "ฝ่ายกฎหมาย", "ฝ่ายกิจการสาขาภาคกลาง", "ฝ่ายเงินฝาก", "ฝ่ายการตลาดดิจิตอล", "ฝ่ายกิจการสาขาภาคตะวันตก", "ฝ่ายกิจการสาขาภาคใต้ตอนบน", "ฝ่ายกิจการสาขาภาคใต้ตอนล่าง", "ฝ่ายตรวจสอบ", "ฝ่ายกิจการสาขาภาคตะวันออก", "ฝ่ายทรัพยากรมนุษย์", "ฝ่ายปฏิบัติการเทคโนโลยีสารสนเทศ", "ฝ่ายกิจการสาขาภาคเหนือตอนบน", "ฝ่ายนโยบายและกลยุทธ์", "ฝ่ายกิจการนโยบายรัฐ", "ฝ่ายกิจการสาขาภาคเหนือตอนล่าง", "ฝ่ายการบัญชี", "ฝ่ายบริหารกลาง", "ฝ่ายบริหารความเสี่ยง", "ฝ่ายพัฒนาลูกค้าและชนบท", "ฝ่ายสินเชื่อ", "ฝ่ายอำนวยการ", "ฝ่ายกิจการสาขาภาคตะวันออก เฉียงเหนือตอนบน", "ฝ่ายกิจการสาขาภาคตะวันออก เฉียงเหนือตอนล่าง", "ศูนย์บ่มเพาะและพัฒนานวัตกรรม SMEs เกษตร (เทียบเท่าสำนัก)", "ศูนย์พัฒนาธุรกิจสินเชื่อและ SME เกษตร (เทียบเท่าฝ่าย)", "ศูนย์วิจัยและพัฒนา", "สำนักกลยุทธ์เทคโนโลยีดิจิทัล", "สำนักกิจการนครหลวง", "สำนักเงินฝากเพื่อสงเคราะห์ชีวิต", "สำนักตรวจสอบเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมธรรมาภิบาลและกำกับการปฏิบัติตามกฎเกณฑ์", "สำนักบริหารกิจการสาขาภาค", "สำนักบริหารข้อมูลเพื่อความเป็นเลิศทางธุรกิจ", "สำนักบริหารจัดการหนี้สินนอกระบบ", "สำนักจัดการและป้องกันการกระทำทุจริต", "สำนักแผนงานเทคโนโลยีสารสนเทศ", "สำนักพิธีการสินเชื่อและหลักประกัน", "สำนักวิเคราะห์และกลั่นกรองสินเชื่อ", "สำนักสอบทานสินเชื่อ", "สำนักสื่อสารการตลาดและประชาสัมพันธ์"]
}, {
    "level1": "กระทรวงกลาโหม",
    "level2": "บริษัท อู่กรุงเทพ จำกัด",
    "level3": [""]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงบประมาณ",
    "level3": ["สำนักงานผู้อำนวยการ", "กองกฏหมายและระเบียบ", "กองจัดทำงบประมาณเขตพื้นที่ 1", "กองจัดทำงบประมาณเขตพื้นที่ 2", "กองจัดทำงบประมาณเขตพื้นที่ 3", "กองจัดทำงบประมาณเขตพื้นที่ 4", "กองจัดทำงบประมาณเขตพื้นที่ 5", "กองจัดทำงบประมาณเขตพื้นที่ 6", "กองจัดทำงบประมาณเขตพื้นที่ 7", "กองจัดทำงบประมาณเขตพื้นที่ 8", "กองจัดทำงบประมาณเขตพื้นที่ 9", "กองจัดทำงบประมาณเขตพื้นที่ 10", "กองจัดทำงบประมาณเขตพื้นที่ 11", "กองจัดทำงบประมาณด้านการบริหาร", "กองจัดทำงบประมาณด้านความมั่นคง 1", "กองจัดทำงบประมาณด้านความมั่นคง 2", "กองจัดทำงบประมาณด้านเศรษฐกิจ 1", "กองจัดทำงบประมาณด้านเศรษฐกิจ 2", "กองจัดทำงบประมาณด้านเศรษฐกิจ 3", "กองจัดทำงบประมาณด้านเศรษฐกิจ 4", "กองจัดทำงบประมาณด้านประกันสังคม 1", "กองจัดทำงบประมาณด้านประกันสังคม 2", "กองจัดทำงบประมาณด้านประกันสังคม 3", "กองจัดทำงบประมาณด้านประกันสังคม 4", "กองจัดทำงบประมาณเพื่อการบูรณาการงบประมาณเขตพื้นที่การบูรณการงบประมาณในการบริหารราชการในต่างประเทศ", "กองจัดทำงบประมาณเขตพื้นที่ 12", "กองจัดทำงบประมาณเขตพื้นที่ 13", "กองจัดทำงบประมาณเขตพื้นที่ 14", "กองจัดทำงบประมาณเขตพื้นที่ 15", "กองจัดทำงบประมาณเขตพื้นที่ 16", "กองจัดทำงบประมาณเขตพื้นที่ 17", "กองจัดทำงบประมาณเขตพื้นที่ 18", "กองจัดทำงบประมาณองค์การบริหารรูปแบบพิเศษและรัฐวิสาหกิจ", "กองนโยบสยงบประมาณ", "กองประเมิน 1", "กองประเมิน 2", "กองพัฒนาระบบงบประมาณและการจัดการ", "กองมาตราฐานงบประมาณ 1", "กองมาตราฐานงบประมาณ 2", "กองยุทธศาสตร์การงบประมาณ", "ศูนย์เทคโนโลยีสารสนเทศ", "สถาบันพัฒนาบุคลากรด้านการงบประมาณ", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์ปฏิบัติการต่อต้านการทุจริต"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สถาบันวิทยาลัยชุมชน",
    "level3": ["กองบริหารทรัพยากรบุคคล", "กองแผนงานและงบประมาณ", "กองมาตรฐานการศึกษาและวิจัย", "กองส่งเสริมกิจการวิทยาลัยชุมชน", "กลุ่มตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "องค์การขนส่งมวลชนกรุงเทพ",
    "level3": [""]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานคณะกรรมการส่งเสริมการลงทุน",
    "level3": ["กองยุทธศาสตร์และแผนงาน"]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": "โรงพยาบาลบ้านแพ้ว",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏบุรีรัมย์",
    "level3": ["สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักงานวิเทศสัมพันธ์และพัฒนาบุคลากร", "สำนักงานอธิการบดี", "กองกลาง   กองประชุมและพิธีการ   กองบริหารงานบุคคล   งานสภามหาวิทยาลัย", "บัณฑิตวิทยาลัย", "กองนโยบายและแผน", "คณะเทคโนโลยีอุตสาหกรรม", "กองพัฒนานักศึกษา", "กองคลังและทรัพย์สิน และกองการพัสดุ", "กองอาคารและสถานที่และบริการ", "สำนักงานมาตรฐานประกันคุณภาพการศึกษาและตรวจสอบภายใน", "คณะครุศาสตร์", "ศูนย์ศึกษาการพัฒนาครู", "โรงเรียนอนุบาลสาธิต", "คณะเทคโนโลยีการเกษตร", "คณะมนุษยศาสตร์และสังคมศาสตร์", "ศูนย์ภาษา", "คณะวิทยาการจัดการ", "ศูนย์ฝึกประสบการณ์วิชาชีพธุรกิจ (โรงแรมพนมพิมาน)", "คณะวิทยาศาสตร์", "ศูนย์วิทยาศาสตร์และวิทยาศาสตร์ประยุกต์", "สถาบันวิจัยและพัฒนา", "ศูนย์บริการอุดมศึกษาปะคำ", "ศูนย์บริการอุดมศึกษาหนองขวาง", "สำนักงานบริการทางวิชาการ", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักศิลปะและวัฒนธรรม"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา",
    "level3": ["สำนักงานอธิการบดี", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักศิลปะและวัฒนธรรม", "สถาบันวิจัยและพัฒนา", "คณะครุศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะวิทยาการจัดการ", "โรงเรียนสาธิตมหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา", "สำนักคอมพิวเตอร์", "สำนักกิจการนิสิตนักศึกษา", "สำนักวิเทศสัมพันธ์และเครือข่ายอาเซียน", "บัณฑิตวิทยาลัย", "ศูนย์การศึกษาอู่ทองทวารวดี", "หน่วยตรวจสอบภายใน", "สำนักประชาสัมพันธ์และสารสนเทศ", "วิทยาลัยการดนตรี", "สำนักงานสภามหาวิทยาลัย", "กองนโยบายและแผน", "กองคลัง", "กองกลาง", "กองบริหารงานบุคคล", "กองอาคารสถานที่และสิ่งแวดล้อม"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยบูรพา",
    "level3": ["มหาวิทยาลัย", "สำนักงานสภามหาวิทยาลัย", "สำนักงานอธิการบดี", "คณะการจัดการและการท่องเที่ยว", "คณะการแพทย์แผนไทยอภัยภูเบศร", "คณะดนตรีและการแสดง", "คณะพยาบาลศาสตร์", "คณะแพทยศาสตร์", "คณะเภสัชศาสตร์", "คณะภูมิสารสนเทศศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะรัฐศาสตร์และนิติศาสตร์", "คณะโลจิสติกส์", "คณะวิทยาการสารสนเทศ", "คณะวิทยาศาสตร์", "คณะวิทยาศาสตร์การกีฬา", "คณะวิศวกรรมศาสตร์", "คณะศิลปกรรมศาสตร์", "คณะศึกษาศาสตร์", "คณะสาธารณสุขศาสตร์", "คณะสหเวชศาสตร์", "วิทยาลัยการบริหารรัฐกิจ", "วิทยาลัยนานาชาติ", "วิทยาลัยพาณิชยศาสตร์", "วิทยาลัยการวิจัยและวิทยาการปัญญา", "สถาบันภาษา", "สถาบันวิทยาศาสตร์ทางทะเล", "สำนักคอมพิวเตอร์", "สำนักบริการวิชาการ", "สำนักหอสมุด", "สำนักพัฒนานวัตกรรม", "คณะเทคโนโลยีทางทะเล", "คณะวิทยาศาสตร์และศิลปศาสตร์", "คณะอัญมณี", "คณะเทคโนโลยีการเกษตร", "คณะวิทยาศาสตร์และสังคมศาสตร์", "โครงการจัดตั้งคณะพาณิชยศาสตร์และบริหารธุรกิจ", "บัณฑิตวิทยาลัย"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "สำนักงานการบินพลเรือนแห่งประเทศไทย",
    "level3": ["กลุ่มตรวจสอบภายใน", "กลุ่มนิรภัยการบิน", "กลุ่มประกันคุณภาพ", "กลุ่มเวชศาสตร์การบิน", "กลุ่มอำนวยการคณะกรรมการกำกับ", "ฝ่ายกฎหมาย", "ฝ่ายการต่างประเทศ", "ฝ่ายกำกับกิจการการบินพลเรือน", "ฝ่ายมาตรฐานผู้ประจำหน้าที่", "ฝ่ายเทคโนโลยีสารสนเทศและการสื่อสาร", "ฝ่ายบริการข่าวสารการบิน", "ฝ่ายบริหารกลาง", "ฝ่ายมาตรฐานการขนส่งสินค้าอันตราย", "ฝ่ายมาตรฐานการรักษาความปลอดภัยและการอำนวยความสะดวกในการบินพลเรือน", "ฝ่ายมาตรฐานบริการการเดินอากาศ", "ฝ่ายมาตรฐานปฏิบัติการบิน", "ฝ่ายมาตรฐานสนามบิน", "ฝ่ายส่งเสริมอุตสาหกรรมการบิน", "ฝ่ายสมควรเดินอากาศและวิศวกรรมการบิน", "กลุ่มจัดสรรเวลาการบิน"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "สถาบันการบินพลเรือน",
    "level3": [""]
}, {
    "level1": "กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม",
    "level2": "บริษัท กสท โทรคมนาคม จำกัด (มหาชน)",
    "level3": ["สำนักตรวจสอบภายใน", "ศูนย์มาตรฐานความปลอดภัย อาชีวอนามัย  และสภาพแวดล้อมในการทำงาน", "ฝ่ายคณะกรรมการบริษัท", "ฝ่ายกรรมการผู้จัดการใหญ่", "ฝ่ายพัสดุ", "ฝ่ายโยธาและขนส่ง", "ฝ่ายบริหารสินทรัพย์", "ฝ่ายกฎหมาย", "ฝ่ายคดี", "ฝ่ายวางแผนกลยุทธ์องค์กร", "ฝ่ายรัฐกิจสัมพันธ์", "ฝ่ายบริหารความเสี่ยงและควบคุมภายใน", "ฝ่ายพัฒนาและประเมินผลองค์กร", "ฝ่ายกลยุทธ์เทคโนโลยีสารสนเทศ", "ฝ่ายเทคโนโลยีสารสนเทศเพื่อบริหารองค์กร", "ฝ่ายเทคโนโลยีสารสนเทศเพื่อสนับสนุนธุรกิจ", "ฝ่ายวางแผนการเงินและงบประมาณ", "ฝ่ายบริหารการเงิน", "ฝ่ายบัญชีการเงิน", "ฝ่ายบัญชีบริหาร", "ฝ่ายบัญชีลูกหนี้เจ้าหนี้", "ฝ่ายบริหารทรัพยากรบุคคล", "ฝ่ายสวัสดิการและบริหารแรงงานสัมพันธ์", "ฝ่ายพัฒนาทรัพยากรบุคคล", "ฝ่ายบริหารสัญญาโครงข่ายไร้สาย", "ฝ่ายวิศวกรรมสื่อสารไร้สาย", "ฝ่ายปฏิบัติการและบำรุงรักษาสื่อสารไร้สาย", "ฝ่ายขายและตลาดสื่อสารไร้สาย", "ฝ่ายพัฒนาธุรกิจสื่อสารไร้สาย", "ฝ่ายขายส่งบริการสื่อสารไร้สาย", "ฝ่ายพัฒนาธุรกิจโครงข่ายไร้สาย", "ฝ่ายประชาสัมพันธ์และสื่อสารองค์กร", "ฝ่ายบริหารลูกค้า", "ฝ่ายบริหารและติดตามคุณภาพบริการ", "ฝ่ายบริหารประสบการณ์และความสัมพันธ์ลูกค้า", "ฝ่ายลูกค้าหน่วยงานภาครัฐ", "ฝ่ายลูกค้ารายย่อยกรุงเทพฯ และปริมณฑล", "ฝ่ายลูกค้าเอกชน", "ฝ่ายลูกค้าผู้ประกอบการ", "ฝ่ายผลิตภัณฑ์โทรศัพท์", "ฝ่ายผลิตภัณฑ์บรอดแบนด์", "ฝ่ายผลิตภัณฑ์สื่อสารข้อมูล", "ฝ่ายผลิตภัณฑ์ธุรกิจอิเล็กทรอนิกส์", "ฝ่ายผลิตภัณฑ์สื่อสารดาวเทียม", "ฝ่ายวิจัยและพัฒนา", "ฝ่ายวางแผนและวิศวกรรม", "ฝ่ายปฏิบัติการโทรศัพท์", "ฝ่ายปฏิบัติการสื่อสารข้อมูล", "ฝ่ายผลิตภัณฑ์ความปลอดภัยเทคโนโลยีสารสนเทศ", "ฝ่ายเทคโนโลยีศูนย์ข้อมูล", "ฝ่ายธุรกิจระหว่างประเทศ", "ฝ่ายโครงข่ายระหว่างประเทศ", "ฝ่ายควบคุมโครงข่าย", "ฝ่ายโครงข่ายภายในประเทศ", "สำนักงานบริการลูกค้า กสท เขตเหนือ", "สำนักงานบริการลูกค้า กสท เขตตะวันตก", "สำนักงานบริการลูกค้า กสท เขตใต้", "สำนักงานบริการลูกค้า กสท  เขตตะวันออกเฉียงเหนือ", "สำนักงานบริการลูกค้า กสท เขตกลาง", "สำนักงานบริการลูกค้า กสท เขตตะวันออก"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏเชียงใหม่",
    "level3": ["คณะครุศาสตร์", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะเทคโนโลยีการเกษตร", "วิทยาลัยแม่ฮ่องสอน", "วิทยาลัยนานาชาติ", "บัณฑิตวิทยาลัย", "วิทยาลัยพัฒนาเศรษฐกิจและเทคโนโลยีชุมชนแห่งเอเชีย", "สำนักงานอธิการบดี"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยเชียงใหม่",
    "level3": ["สำนักงานสภามหาวิทยาลัย", "สำนักงานตรวจสอบภายใน", "สำนักงานขับเคลื่อนยุทธศาสตร์ มหาวิทยาลัยเชียงใหม่", "สำนักงานมหาวิทยาลัย", "ศูนย์นักศึกษาเก่าสัมพันธ์", "กองกลาง", "ศูนย์บริหารงานวิจัย", "สำนักงานบริหารและจัดการทรัพย์สิน", "สำนักงานหอพักนักศึกษา", "สภาพนักงานมหาวิทยาลัยเชียงใหม่", "คณะกรรมการส่งเสริมมหาวิทยาลัยเชียงใหม่", "โครงการอุทยานการศึกษาและบริการวิชาการ มช.", "ศูนย์ประสานงานวิชาการ", "ศูนย์พัฒนาคุณภาพองค์กร", "ศูนย์บริหารจัดการเมืองอัจฉริยะมหาวิทยาลัยเชียงใหม่", "กองกฏหมาย", "กองคลัง", "กองบริหารงานบุคคล", "กองแผนงาน", "กองพัฒนานักศึกษา", "กองวิเทศสัมพันธ์", "กองอาคารสถานที่และสาธารณูปการ", "ศูนย์การศึกษามหาวิทยาลัยเชียงใหม่ หริภุญไชย จังหวัดลำพูน", "คณะมนุษยศาสตร์", "คณะการสื่อสารมวลชน", "คณะรัฐศาสตร์และรัฐประศาสนศาสตร์", "คณะวิจิตรศิลป์", "คณะวิทยาศาสตร์", "คณะวิศวกรรมศาสตร์", "คณะศึกษาศาสตร์", "คณะเศรษฐศาสตร์", "คณะสถาปัตยกรรมศาสตร์", "คณะสังคมศาสตร์", "คณะสัตวแพทยศาสตร์", "คณะอุตสาหกรรมเกษตร", "คณะเกษตรศาสตร์", "วิทยาลัยศิลปะ สื่อ และเทคโนโลยี", "วิทยาลัยนานาชาตินวัตกรรมดิจิทัล", "บัณฑิตวิทยาลัย", "สถาบันวิจัยวิทยาศาสตร์และเทคโนโลยี", "สถาบันวิจัยวิทยาศาสตร์สุขภาพ", "สถาบันวิจัยสังคม", "สถาบันวิจัยและพัฒนาพลังงานนครพิงค์", "สถาบันพิภพวิทยา", "คณะทันตแพทยศาสตร์", "สถาบันภาษา", "อุทยานวิทยาศาสตร์และเทคโนโลยี", "ศูนย์วิจัยข้าวล้านนา", "ศูนย์สัตว์ทดลอง", "ศูนย์นวัตกรรมอาหารและบรรจุภัณฑ์", "คณะสาธารณสุขศาสตร์", "วิทยาลัยการศึกษาและการจัดการทางทะเล", "สถาบันวิศวกรรมชีวการแพทย์", "สถาบันนโยบายสาธารณะ", "คณะเทคนิคการแพทย์", "คณะนิติศาสตร์", "คณะบริหารธุรกิจ", "คณะพยาบาลศาสตร์", "คณะแพทยศาสตร์", "คณะเภสัชศาสตร์", "สำนักทะเบียนและประมวลผล", "สำนักบริการเทคโนโลยีสารสนเทศ", "สำนักบริการวิชาการ", "สำนักพัฒนาคุณภาพการศึกษา", "สำนักส่งเสริมศิลปวัฒนธรรม", "สำนักหอสมุด", "ศูนย์ความเป็นเลิศด้านฟิสิกส์", "ศูนย์นวัตกรรมเทคโนโลยีหลังการเก็บเกี่ยว"]
}, {
    "level1": "ศาล",
    "level2": "สำนักงานศาลยุติธรรม",
    "level3": ["สำนักงานศาลยุติธรรม"]
}, {
    "level1": "ศาล",
    "level2": "สำนักงานศาลรัฐธรรมนูญ",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏชัยภูมิ",
    "level3": ["สำนักงานอธิการบดี", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "กองกลาง", "สถาบันวิจัยและพัฒนา", "กองนโยบายและแผน", "กองบริการการศึกษา", "กองกิจการนักศึกษาและกิจการพิเศษ", "คณะศิลปศาสตร์และวิทยาศาสตร์", "คณะพยาบาลศาสตร์", "คณะครุศาสตร์", "คณะบริหารธุรกิจ", "คณะรัฐศาสตร์"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏเชียงราย",
    "level3": ["สำนักงานอธิการบดี", "คณะครุศาสตร์", "คณะเทคโนโลยีอุตสาหกรรม", "คณะมนุษยศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์และเทคโนโลยี", "วิทยาลัยการแพทย์พื้นบ้านและการแพทย์ทางเลือก", "สถาบันวิจัยและพัฒนา", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักศิลปะและวัฒนธรรม", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักวิชาสังคมศาสตร์", "วิทยาลัยนานาชาติ", "สำนักวิชาบัญชี", "สำนักวิชาการท่องเที่ยว", "สำนักวิชาคอมพิวเตอร์และเทคโนโลยีสารสนเทศ", "สำนักวิชาวิทยาศาสตร์สุขภาพ", "สำนักวิชาบริหารรัฐกิจ", "สำนักวิชานิติศาสตร์", "บัณฑิตวิทยาลัย", "สำนักนวัตกรรมและบริการสังคม", "โรงเรียนสาธิต", "สถาบันความหลากหลายทางชีวภาพและสิ่งแวดล้อมเพื่อพัฒนาท้องถิ่นและอาเซียน", "สำนักประชาสัมพันธ์และสื่อสารองค์กร", "สถาบันภาษาและวัฒนธรรมนานาชาติ", "สำนักบริหารและจัดการทรัพย์สิน", "ศูนย์บริการวิศวกรรมโยธา", "สถาบันพัฒนาเศรษฐกิจ พลังงานและสิ่งแวดล้อม"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏจันทรเกษม",
    "level3": ["สำนักประกันคุณภาพการศึกษา", "สำนักงานหมวดวิชาศึกษาทั่วไป", "สำนักงานตรวจสอบภายใน", "ศูนย์ส่งเสริมสุขภาพและสระว่ายน้ำ", "โรงพยาบาลสัตว์", "ศูนย์ฝึกประสบการณ์วิชาชีพ (จันทรเกษมปาร์ค)", "สำนักงานอธิการบดี", "กองกลาง", "กองคลัง", "กองนโยบายและแผน", "กองบริหารงานบุคคล", "กองพัฒนานักศึกษา", "สำนักงานสภามหาวิทยาลัย", "คณะเกษตรและชีวภาพ", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์", "คณะศึกษาศาสตร์", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักศิลปะและวัฒนธรรม", "สำนักส่งเสริมวิชาการและงานทะเบียน", "บัณฑิตวิทยาลัย", "วิทยาลัยการแพทย์ทางเลือก", "ศูนย์การศึกษามหาวิทยาลัยราชภัฏจันทรเกษม - ชัยนาท"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "จุฬาลงกรณ์มหาวิทยาลัย",
    "level3": ["จุฬาลงกรณ์มหาวิทยาลัย", "คณะนิเทศศาสตร์", "สำนักงานสภามหาวิทยาลัย", "คณะพยาบาลศาสตร์", "สำนักตรวจสอบ", "คณะพาณิชยศาสตร์และการบัญชี", "คณะแพทยศาสตร์", "คณะเภสัชศาสตร์", "คณะรัฐศาสตร์", "คณะวิทยาศาสตร์", "คณะวิศวกรรมศาสตร์", "คณะศิลปกรรมศาสตร์", "คณะเศรษฐศาสตร์", "คณะสถาปัตยกรรมศาสตร์", "สำนักบริหารเทคโนโลยีสารสนเทศ (สบท.)", "สำนักบริหารวิชาการ (สบว.)", "คณะสหเวชศาสตร์", "ศูนย์การศึกษาทั่วไป (ศศท.)", "ศูนย์จุฬาฯ-ชนบท (ศจช.)", "ศูนย์นวัตกรรมการเรียนรู้ (ศนว.)", "ศูนย์บริหารกลาง (ศหก.)", "ศูนย์กฎหมายและนิติการ (ศกน.)", "ศูนย์สื่อสารองค์กร (ศสอ.)", "ศูนย์การจัดการทรัพยากรของมหาวิทยาลัย (ศจท.)", "ศูนย์บริหารความเสี่ยง (ศคส.)", "ศูนย์พัฒนกิจและนิสิตเก่าสัมพันธ์ (ศพน.)", "ศูนย์วิเคราะห์รายได้และปฏิบัติการลงทุน (ศวล.)", "สำนักบริหารวิจัย (สบจ.)", "คณะสัตวแพทยศาสตร์", "ศูนย์ความปลอดภัย อาชีวอนามัยและสิ่งแวดล้อม (ศปอส.)", "สำนักบริหารกิจการนิสิต (สบน.)", "คณะอักษรศาสตร์", "ศูนย์เครื่องมือวิจัยวิทยาศาสตร์และเทคโนโลยี จุฬาลงกรณ์", "ศูนย์สัตว์ทดลอง จุฬาลงกรณ์มหาวิทยาลัย (ศสท.)", "สถาบันภาษาไทยสิรินธรแห่งจุฬาลงกรณ์มหาวิทยาลัย (สทส.)", "ศูนย์วิทยาศาสตร์ฮาลาล จุฬาลงกรณ์มหาวิทยาลัย (ศวฮ.)", "ศูนย์เครือข่ายการเรียนรู้เพื่อภูมิภาค จุฬาลงกรณ์มหาวิทยาลัย (ศคภ.)", "ศูนย์วิจัยไพรเมทแห่งชาติ (ศวพ.)", "สำนักยุทธศาสตร์และการขับเคลื่อน (สยข.)", "สำนักบริหารแผนและการงบประมาณ (สบผ.)", "สำนักบริหารศิลปวัฒนธรรม (สบศ.)", "คณะวิทยาศาสตร์การกีฬา", "ศูนย์ยุโรปศึกษาแห่งจุฬาลงกรณ์มหาวิทยาลัย", "สำนักบริหารวิรัชกิจและเครือข่ายนานาชาติ (สบร.)", "บัณฑิตวิทยาลัย", "ศูนย์พุทธศาสน์ศึกษา", "สถาบันขงจื่อแห่งจุฬาลงกรณ์มหาวิทยาลัย", "ศูนย์รัสเซียศึกษา", "ศูนย์อินเดียศึกษา", "ศูนย์อาเซียนศึกษา", "วิทยาลัยประชากรศาสตร์", "ศูนย์บริการสุขภาพแห่งจุฬาลงกรณ์มหาวิทยาลัย", "สำนักบริหารการเงิน การบัญชี และการพัสดุ (สบง.)", "วิทยาลัยปิโตรเลียมและปิโตรเคมี", "สถานีวิทยุแห่งจุฬาลงกรณ์มหาวิทยาลัย", "ศูนย์บริการวิชาการแห่งจุฬาลงกรณ์มหาวิทยาลัย", "ศูนย์ทดสอบทางวิชาการแห่งจุฬาลงกรณ์มหาวิทยาลัย", "สำนักบริหารทรัพยากรมนุษย์ (สบม.)", "สถาบันภาษา", "สำนักบริหารระบบกายภาพ (สบภ.)", "สถาบันการขนส่ง", "สถาบันวิจัยเทคโนโลยีชีวภาพและวิศวกรรมพันธุศาสตร์", "สำนักวิชาทรัพยากรการเกษตร", "สถาบันวิจัยทรัพยากรทางน้ำ", "สถาบันวิจัยพลังงาน", "สถาบันวิจัยโลหะและวัสดุ", "สถาบันไทยศึกษา", "สถาบันวิจัยสภาวะแวดล้อม", "สถาบันวิจัยสังคม", "สถาบันเอเชียศึกษา", "วิทยาลัยวิทยาศาสตร์สาธารณสุข", "สำนักงานการทะเบียน", "สถาบันบัณฑิตบริหารธุรกิจศศินทร์แห่งจุฬาลงกรณ์มหาวิทยาลัย", "สำนักงานวิทยทรัพยากร", "คณะครุศาสตร์", "คณะจิตวิทยา", "คณะทันตแพทยศาสตร์", "คณะนิติศาสตร์", "ศูนย์กลางนวัตกรรมแห่งจุฬาลงกรณ์มหาวิทยาลัย"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "บริษัท ธนารักษ์พัฒนาสินทรัพย์ จำกัด",
    "level3": [""]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "องค์การบริหารการพัฒนาการพื้นที่พิเศษเพื่อการท่องเที่ยวอย่างยังยืน",
    "level3": [""]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานพัฒนารัฐบาลดิจิทัล",
    "level3": [""]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "องค์การส่งเสริมกิจการโคนมแห่งประเทศไทย",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏธนบุรี",
    "level3": ["สำนักงานอธิการบดี", "คณะครุศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะวิทยาการจัดการ", "สถาบันวิจัยและพัฒนา", "สำนักส่งเสริมวิชาการและงานทะเบียน", "กองพัฒนานักศึกษา", "กองนโยบายและแผน", "มหาวิทยาลัยราชภัฏธนบุรี", "สำนักศิลปะและวัฒนธรรม", "ศูนย์คอมพิวเตอร์", "โครงการบัณฑิตศึกษา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "งานวิเทศสัมพันธ์", "ศูนย์ภาษา", "มหาวิทยาลัยราชภัฏธนบุรี สมุทรปราการ", "งานประชาสัมพันธ์", "โรงเรียนสาธิตมหาวิทยาลัยราชภัฏธนบุรี สมุทรปราการ", "กองกลาง", "กลุ่มตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงกลาโหม",
    "level2": "สถาบันเทคโนโลยีป้องกันประเทศ",
    "level3": [""]
}, {
    "level1": "หน่วยงานอิสระ",
    "level2": "สำนักงานคณะกรรมการการเลือกตั้ง",
    "level3": ["สำนักบริหารทั่วไป", "สำนักการคลัง", "สำนักนโยบายและยุทธศาสตร์", "สำนักบริหารทรัพยากรบุคคล", "สำนักเทคโนโลยีสารสนเทศ", "สำนักสืบสวนสอบสวนและวินิจฉัย 1", "สำนักสืบสวนสอบสวนและวินิจฉัย 2", "สำนักสืบสวนสอบสวนและวินิจฉัย 3", "สำนักสืบสวนสอบสวนและวินิจฉัย 4", "สำนักสืบสวนสอบสวนและวินิจฉัย 5", "สำนักสนับสนุนงานสืบสวนสอบสวน", "สำนักบริหารการเลือกตั้งและการออกเสียงประชามติ 1", "สำนักบริหารการเลือกตั้งและการออกเสียงประชามติ 2", "สำนักสนับสนุนการเลือกตั้งและการออกเสียงประชามติ", "สำนักกิจการพรรคการเมือง", "สำนักบริหารการสนับสนุนโดยรัฐ", "สำนักพัฒนาเครือข่ายการเลือกตั้ง", "สำนักส่งเสริมความเป็นพลเมือง", "สำนักกฎหมายและคดี", "สำนักการประชุม", "สำนักประชาสัมพันธ์", "สำนักกิจการคณะกรรมการการเลือกตั้ง", "สำนักผู้ตรวจการ", "สำนักผู้ตรวจสอบภายใน", "สำนักวินิจฉัยและคดี", "สำนักพัฒนาบุคลากร", "สำนักวิจัยและวิชาการ"]
}, {
    "level1": "กระทรวงพลังงาน",
    "level2": "สถาบันบริหารกองทุนพลังงาน",
    "level3": [""]
}, {
    "level1": "กระทรวงพลังงาน",
    "level2": "การไฟฟ้าฝ่ายผลิตแห่งประเทศไทย",
    "level3": [""]
}, {
    "level1": "กระทรวงพลังงาน",
    "level2": "สำนักงานปลัดกระทรวงพลังงาน",
    "level3": ["สำนักรัฐมนตรี", "สำนักบริหารกลาง", "สำนักนโยบายและยุทธศาสตร์", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักส่งเสริมการมีส่วนร่วมของประชาชน", "สำนักความร่วมมือระหว่างประเทศ", "กองตรวจและประเมิน", "กลุ่มพัฒนาระบบบริหาร", "ตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงพลังงาน",
    "level2": "กรมเชื้อเพลิงธรรมชาติ",
    "level3": ["สำนักบริหารกลาง", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "กองแผนงานเชื้อเพลิงธรรมชาติ", "ศูนย์สารสนเทศข้อมูลเชื้อเพลิงธรรมชาติ", "สำนักจัดการเชื้อเพลิงธรรมชาติ", "สำนักเทคโนโลยีการประกอบกิจการปิโตรเลียม", "สำนักบริหารกิจการปิโตรเลียมระหว่างประเทศ", "สำนักบริหารสัมปทานปิโตรเลียม", "กองความปลอดภัยและสิ่งแวดล้อมเชื้อเพลิงธรรมชาติ"]
}, {
    "level1": "กระทรวงพลังงาน",
    "level2": "กรมธุรกิจพลังงาน",
    "level3": ["สำนักบริหารกลาง", "กองแผนงาน", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สถาบันพัฒนาเทคนิคพลังงาน", "สำนักความปลอดภัยธุรกิจก๊าซธรรมชาติ", "สำนักความปลอดภัยธุรกิจก๊าซปิโตรเลียมเหลว", "สำนักความปลอดภัยธุรกิจน้ำมัน", "สำนักคุณภาพน้ำมันเชื้อเพลิง", "สำนักบริการธุรกิจและการสำรองน้ำมันเชื้อเพลิง"]
}, {
    "level1": "กระทรวงพลังงาน",
    "level2": "กรมพัฒนาพลังงานทดแทนและอนุรักษ์พลังงาน",
    "level3": ["สำนักบริหารกลาง", "กองแผนงาน", "ศูนย์สารสนเทศข้อมูลพลังงานทดแทนและอนุรักษ์พลังงาน", "สำนักกำกับและอนุรักษ์พลังงาน", "สำนักถ่ายทอดและเผยแพร่เทคโนโลยี", "สำนักพัฒนาเชื้อเพลิงชีวภาพ", "สำนักพัฒนาทรัพยากรบุคคลด้านพลังงาน", "สำนักพัฒนาพลังงานทดแทน", "สำนักพัฒนาพลังงานแสงอาทิตย์", "สำนักวิจัยค้นคว้าพลังงาน", "สำนักส่งเสริมการอนุรักษ์พลังงาน"]
}, {
    "level1": "กระทรวงพลังงาน",
    "level2": "สำนักงานนโยบายและแผนพลังงาน",
    "level3": ["สำนักบริหารกลาง", "กองนโยบายและแผนพลังงาน", "ศูนย์พยากรณ์และสารสนเทศพลังงาน", "สำนักนโยบายปิโตรเลียมและปิโตรเคมี", "สำนักนโยบายไฟฟ้า", "สำนักนโยบายอนุรักษ์พลังงานและพลังงานทดแทน"]
}, {
    "level1": "กระทรวงพลังงาน",
    "level2": "คณะกรรมการกำกับกิจการพลังงาน",
    "level3": [""]
}, {
    "level1": "กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม",
    "level2": "สำนักงานพัฒนาธุรกรรมทางอิเล็กทรอนิกส์ (องค์การมหาชน)",
    "level3": ["สำนักผู้อำนวยการ", "สำนักบริหารกลาง", "สำนักยุทธศาสตร์", "สำนักกฏหมาย", "สำนักมาตรฐาน", "สำนักความมั่นคงปลอดภัย", "สำนักสารสนเทศ", "สำนักตรวจสอบภายใน", "สำนักพัฒนาองค์กร", "สำนักบริการโครงสร้างพื้นฐานสารสนเทศ", "สำนักพาณิชย์อิเล็กทรอนิกส์", "สำนักสื่อสารองค์กร", "สำนักพัฒนาดิจิทัลเพื่อธุรกิจ"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "การทางพิเศษแห่งประเทศไทย",
    "level3": ["สำนักผู้ว่าการ", "สำนักตรวจสอบภายใน", "ฝ่ายบริหารทั่วไป", "ฝ่ายการเงินและบัญชี", "ฝ่ายนโยบายและแผน", "ฝ่ายสารสนเทศ", "ฝ่ายก่อสร้างทางพิเศษ", "ฝ่ายบำรุงรักษา", "ฝ่ายกรรมสิทธิ์ที่ดิน", "ฝ่ายกฎหมาย", "ฝ่ายควบคุมการจราจร", "ฝ่ายจัดเก็บค่าผ่านทาง", "กองวางแผนปฏิบัติการ", "กองบริหารความเสี่ยงและควบคุมภายใน", "กองวิจัยและพัฒนา"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "ธนาคารเพื่อการส่งออกและนำเข้าแห่งประเทศไทย",
    "level3": [""]
}, {
    "level1": "กระทรวงวัฒนธรรรม",
    "level2": "หอภาพยนตร์ (องค์การมหาชน)",
    "level3": ["หอภาพยนตร์ (องค์การมหาชน)"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "องค์การสะพานปลา",
    "level3": ["", "สำนักงานอำนวยการ", "ฝ่ายตรวจสอบภายใน", "ฝ่ายยุทธศาสตร์การพัฒนา", "สำนักงานยุทธศาสตร์และแผนงาน", "สำนักงานติดตามและประเมินผล", "สำนักงานวิศวกรรมและสิ่งแวดล้อม", "สำนักงานส่งเสริมการประมง", "ฝ่ายบริหารและพัฒนาองค์กร", "สำนักงานบริหารทรัพยากรบุคคล", "สำนักงานกฎหมาย", "สำนักงานเทคโนโลยีสารสนเทศ", "ฝ่ายบัญชีการเงิน", "สำนักงานบัญชี", "สำนักงานการเงิน", "สำนักงานบริหารหนี้", "สำนักงานบริหารการพัสดุ", "ฝ่ายธุรกิจ 1", "สำนักงานสินเชื่อและธุรกิจการประมง", "สำนักงานพัฒนาธุรกิจทั่วไป", "ฝ่ายธุรกิจ 2", "สำนักงานซื้อขายสินค้าสัตว์น้ำและผลิตภัณฑ์ประมง", "สำนักงานรวบรวมและกระจายสินค้าสัตว์น้ำ", "ฝ่ายสะพานปลาและท่าเทียบเรือประมง 1", "สำนักงานสะพานปลาและท่าเทียบเรือประมง", "สำนักงานสะพานปลากรุงเทพ", "สำนักงานสะพานปลาสมุทรปราการ", "สำนักงานสะพานปลาสมุทรสาคร", "สำนักงานสะพานปลานครศรีธรรมราช", "สำนักงานท่าเทียบเรือประมงชุมพรและหลังสวน", "สำนักงานท่าเทียบเรือประมงสุราษฎร์ธานี", "สำนักงานท่าเทียบเรือประมงหัวหินและปราณบุรี", "สำนักงานท่าเทียบเรือประมงตราดและอ่างศิลา", "ฝ่ายสะพานปลาและท่าเทียบเรือประมง 2", "ศูนย์ปฏิบัติการตรวจสอบย้อนกลับสัตว์น้ำ", "สำนักงานท่าเทียบเรือประมงปัตตานี", "สำนักงานท่าเทียบเรือประมงภูเก็ต", "สำนักงานท่าเทียบเรือประมงสงขลา", "สำนักงานท่าเทียบเรือประมงระนอง", "สำนักงานท่าเทียบเรือประมงสตูล", "สำนักงานท่าเทียบเรือประมงนราธิวาส"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "ธนาคารอาคารสงเคราะห์",
    "level3": [""]
}, {
    "level1": "กระทรวงพาณิชย์",
    "level2": "สถาบันวิจัยและพัฒนาอัญมณีและเครื่องประดับแห่งชาติ (องค์การมหาชน)",
    "level3": ["สำนักผู้บริหาร", "ฝ่ายตรวจสอบอัญมณี", "ฝ่ายตรวจสอบโลหะมีค่า", "ฝ่ายวิจัยและพัฒนาอัญมณีและโลหะมีค่า", "ฝ่ายฝึกอบรม", "ฝ่ายวิชาการและพัฒนาข้อมูล", "ฝ่ายพัฒนาธุรกิจ", "ฝ่ายนโยบายและแผน", "ฝ่ายบริหาร", "ฝ่ายเทคโนโลยีสารสนเทศ"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "สำนักงานสลากกินแบ่งรัฐบาล",
    "level3": [""]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": "องค์การเภสัชกรรม",
    "level3": [""]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "ธนาคารออมสิน",
    "level3": [""]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": "สถาบันรับรองคุณภาพสถานพยาบาล",
    "level3": [""]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานคณะกรรมการพัฒนาการเศรษฐกิจและสังคมแห่งชาติ",
    "level3": ["กลุ่มงานพัฒนาบุคลากร", "สำนักงานเลขาธิการ", "สำนักบัญชีประชาชาติ", "สำนักประเมินผลและเผยแพร่การพัฒนา", "สำนักพัฒนาขีดความสามารถในการแข่งขันทางเศรษฐกิจ", "สำนักพัฒนาข้อมูลและตัวชี้วัดภาวะสังคม", "สำนักพัฒนาเศรษฐกิจและสังคมภาคกลาง", "สำนักพัฒนาเศรษฐกิจและสังคมภาคตะวันออกเฉียงเหนือ", "สำนักพัฒนาเศรษฐกิจสังคมภาคใต้", "สำนักพัฒนาเศรษฐกิจและสังคมภาคเหนือ", "สำนักยุทธศาสตร์ด้านนโยบายสาธารณะ", "สำนักยุทธศาสตร์และการวางแผนพัฒนาทางสังคม", "สำนักยุทธศาสตร์และการวางแผนพัฒนาพื้นที่", "สำนักยุทธศาสตร์และการวางแผนเศรษฐกิจมหภาค", "สำนักวางแผนการเกษตร ทรัพยากรธรรมชาติ และสิ่งแวดล้อม", "สำนักวิเคราะห์โครงการลงทุนภาครัฐ", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "ศูนยปฏิบัติการต่อต้านทุจริต", "กองยุทธศาสตร์การพัฒนาโลจิสติกส์", "กองยุทธศาสตร์และการปฏิรูปประเทศ", "สำนักยุทธศาสตร์และประสานความร่วมมือระหว่างประเทศ"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "สถาบันวิจัยและพัฒนาพื้นที่สูง (องค์การมหาชน)",
    "level3": ["สำนักอำนวยการ", "สำนักยุทธศาสตร์และแผน", "สำนักวิจัย", "สำนักพัฒนา", "อุทยานหลวงราชพฤกษ์", "หน่วยตรวจสอบภายใน", ""]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "บริษัทบริหารสินทรัพย์ ธนาคารอิสลามแห่งประเทศไทย จำกัด",
    "level3": [""]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "ธนาคารอิสลามแห่งประเทศไทย",
    "level3": [""]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "การนิคมอุตสาหกรรมแห่งประเทศไทย",
    "level3": ["ฝ่ายตรวจสอบภายใน", "กองตรวจสอบ 1", "กองตรวจสอบ 2", "ศูนย์ปฏิบัติการ กนอ.", "กองกำกับการปฏิบัติการ", "กองสนับสนุนการปฏิบัติการ", "ฝ่ายบริหาร", "กองกลาง", "กองการประชุม", "กองพัสดุ", "ฝ่ายทรัพยากรบุคคล", "กองบริหารทรัพยากรบุคคล", "กองพัฒนาทรัพยากรบุคคล", "ฝ่ายกฎหมาย", "กองกฎหมายและระเบียบ", "กองนิติกรรมและกรรมสิทธิ์ที่ดิน", "กองคดี", "ฝ่ายการเงินและบัญชี", "กองการเงิน", "กองบัญชีการเงิน", "กองบัญชีบริหารและงบประมาณ", "ฝ่ายยุทธศาสตร์", "กองนโยบายและแผน", "กองบริหารความเสี่ยงและควบคุมภายใน", "กองนวัตกรรมและพัฒนาองค์กร", "ฝ่ายพัฒนา", "กองพัฒนาธุรกิจ", "กองวิศวกรรม", "กองอนุญาตผู้ร่วมดำเนินงานและกำกับดูแลโครงการนิคมอุตสาหกรรม", "ฝ่ายสิ่งแวดล้อม", "กองสิ่งแวดล้อมและพลังงาน", "กองความปลอดภัยและอาชีวอนามัย", "ฝ่ายชุมชนสัมพันธ์", "กองพัฒนาชุมชนสัมพันธ์", "กองบริหารงานชุมชนสัมพันธ์", "ฝ่ายบริการผู้ประกอบกิจการ", "กองอนุญาตผู้ประกอบกิจการ", "กองอนุญาตก่อสร้าง", "กองสิทธิประโยชน์", "ฝ่ายการตลาด", "กองการตลาดและลูกค้าสัมพันธ์", "กองประชาสัมพันธ์", "ฝ่ายเทคโนโลยีสารสนเทศ", "กองพัฒนาระบบงานสารสนเทศ", "กองปฏิบัติการเทคโนโลยีสารสนเทศ", "ฝ่ายอำนวยการปฏิบัติการ 1", "สำนักงานนิคมอุตสาหกรรมสินสาคร", "กองอำนวยการปฏิบัติการ 1", "สำนักงานนิคมอุตสาหกรรมมหาราชนคร", "สำนักงานนิคมอุตสาหกรรมราชบุรี", "สำนักงานนิคมอุตสาหกรรมบางชัน", "สำนักงานนิคมอุตสาหกรรมพิจิตร", "สำนักงานนิคมอุตสาหกรรมแก่งคอย", "สำนักงานนิคมอุตสาหกรรมหนองแค", "สำนักงานนิคมอุตสาหกรรมอัญธานี", "สำนักงานนิคมอุตสาหกรรมบ้านหว้า", "สำนักงานนิคมอุตสาหกรรมบางปะอิน", "สำนักงานนิคมอุตสาหกรรมสหรัตนนคร", "สำนักงานนิคมอุตสาหกรรมลาดกระบัง", "สำนักงานนิคมอุตสาหกรรมสมุทรสาคร", "สำนักงานนิคมอุตสาหกรรมภาคเหนือ", "สำนักงานนิคมอุตสาหกรรมภาคใต้", "ฝ่ายอำนวยการปฏิบัติการ 2", "สำนักงานนิคมอุตสาหกรรมปิ่นทอง 4", "กองอำนวยการปฏิบัติการ 2", "สำนักงานนิคมอุตสาหกรรมปิ่นทอง 5", "สำนักงานนิคมอุตสาหกรรมเหมราชชลบุรี", "สำนักงานนิคมอุตสาหกรรมเหมราชชลบุรี 2", "สำนักงานนิคมอุตสาหกรรมเหมราชอีสเทิร์นซีบอร์ด", "สำนักงานนิคมอุตสาหกรรมเหมราชอีสเทิร์นซีบอร์ด 2", "สำนักงานนิคมอุตสาหกรรมอมตะซิตี้", "สำนักงานนิคมอุตสาหกรรมไฮเทค กบินทร", "สำนักงานนิคมอุตสาหกรรมบางพลี", "สำนักงานนิคมอุตสาหกรรมเอเชีย (สุวรรณภูมิ)", "สำนักงานนิคมอุตสาหกรรมเวลโกรว์", "สำนักงานนิคมอุตสาหกรรมเกตเวย์ ซิตี้", "สำนักงานนิคมอุตสาหกรรม ทีเอฟดี", "สำนักงานนิคมอุตสาหกรรมปิ่นทอง", "สำนักงานนิคมอุตสาหกรรมปิ่นทอง (แหลมฉบัง)", "สำนักงานนิคมอุตสาหกรรมปิ่นทอง 3", "สำนักงานนิคมอุตสาหกรรมบางปู", "สำนักงานนิคมอุตสาหกรรมแหลมฉบัง", "สำนักงานนิคมอุตสาหกรรมอมตะนคร", "สำนักงานนิคมอุตสาหกรรมอีสเทิร์นซีบอร์ด (ระยอง)", "ฝ่ายอำนวยการปฏิบัติการ 3", "กองอำนวยการปฏิบัติการ 3", "กองพัฒนาท่าเรือ", "สำนักงานนิคมอุตสาหกรรมมาบตาพุด", "สำนักงานนิคมอุตสาหกรรมร่วมดำเนินงานกลุ่มมาบตาพุด", "สำนักงานนิคมอุตสาหกรรมเหมราชตะวันออก (มาบตาพุด)", "สำนักงานนิคมอุตสาหกรรมผาแดง", "สำนักงานนิคมอุตสาหกรรมเอเซีย", "สำนักงานนิคมอุตสาหกรรมอาร์ ไอ แอล", "สำนักงานท่าเรืออุตสาหกรรมมาบตาพุด", "สำนักงานโครงการพิเศษ", "ฝ่ายพัฒนาเมืองอุตสาหกรรมเชิงนิเวศ", "กองพัฒนาเมืองอุตสาหกรรมเชิงนิเวศ", "กองบริหารเมืองอุตสาหกรรมเชิงนิเวศ"]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สำนักงานปลัดกระทรวงอุตสาหกรรม(ราชการบริหารส่วนภูมิภาค)",
    "level3": ["สำนักงานอุตสาหกรรมจังหวัดกระบี่", "สำนักงานอุตสาหกรรมจังหวัดกาญจนบุรี", "สำนักงานอุตสาหกรรมจังหวัดกาฬสินธุ์", "สำนักงานอุตสาหกรรมจังหวัดกำแพงเพชร", "สำนักงานอุตสาหกรรมจังหวัดขอนแก่น", "สำนักงานอุตสาหกรรมจังหวัดจันทบุรี", "สำนักงานอุตสาหกรรมจังหวัดฉะเชิงเทรา", "สำนักงานอุตสาหกรรมจังหวัดชลบุรี", "สำนักงานอุตสาหกรรมจังหวัดชัยนาท", "สำนักงานอุตสาหกรรมจังหวัดชัยภูมิ", "สำนักงานอุตสาหกรรมจังหวัดชุมพร", "สำนักงานอุตสาหกรรมจังหวัดเชียงราย", "สำนักงานอุตสาหกรรมจังหวัดเชียงใหม่", "สำนักงานอุตสาหกรรมจังหวัดตรัง", "สำนักงานอุตสาหกรรมจังหวัดตราด", "สำนักงานอุตสาหกรรมจังหวัดตาก", "สำนักงานอุตสาหกรรมจังหวัดนครนายก", "สำนักงานอุตสาหกรรมจังหวัดนครปฐม", "สำนักงานอุตสาหกรรมจังหวัดนครพนม", "สำนักงานอุตสาหกรรมจังหวัดนครราชสีมา", "สำนักงานอุตสาหกรรมจังหวัดนครศรีธรรมราช", "สำนักงานอุตสาหกรรมจังหวัดนครสวรรค์", "สำนักงานอุตสาหกรรมจังหวัดนนทบุรี", "สำนักงานอุตสาหกรรมจังหวัดนราธิวาส", "สำนักงานอุตสาหกรรมจังหวัดน่าน", "สำนักงานอุตสาหกรรมจังหวัดบึงกาฬ", "สำนักงานอุตสาหกรรมจังหวัดบุรีรัมย์", "สำนักงานอุตสาหกรรมจังหวัดปทุมธานี", "สำนักงานอุตสาหกรรมจังหวัดประจวบคีขันธ์", "สำนักงานอุตสาหกรรมจังหวัดปราจีนบุรี", "สำนักงานอุตสาหกรรมจังหวัดปัตตานี", "สำนักงานอุตสาหกรรมจังหวัดพะเยา", "สำนักงานอุตสาหกรรมจังหวัดพระนครศรีอยุธยา", "สำนักงานอุตสาหกรรมจังหวัดพังงา", "สำนักงานอุตสาหกรรมจังหวัดพัทลุง", "สำนักงานอุตสาหกรรมจังหวัดพิจิตร", "สำนักงานอุตสาหกรรมจังหวัดพิษณุโลก", "สำนักงานอุตสาหกรรมจังหวัดเพชรบุรี", "สำนักงานอุตสาหกรรมจังหวัดเพชรบูรณ์", "สำนักงานอุตสาหกรรมจังหวัดแพร่", "สำนักงานอุตสาหกรรมจังหวัดภูเก็ต", "สำนักงานอุตสาหกรรมจังหวัดมหาสารคาม", "สำนักงานอุตสาหกรรมจังหวัดมุกดาหาร", "สำนักงานอุตสาหกรรมจังหวัดแม่ฮ่องสอน", "สำนักงานอุตสาหกรรมจังหวัดยโสธร", "สำนักงานอุตสาหกรรมจังหวัดยะลา", "สำนักงานอุตสาหกรรมจังหวัดร้อยเอ็ด", "สำนักงานอุตสาหกรรมจังหวัดระนอง", "สำนักงานอุตสาหกรรมจังหวัดระยอง", "สำนักงานอุตสาหกรรมจังหวัดราชบุรี", "สำนักงานอุตสาหกรรมจังหวัดลพบุรี", "สำนักงานอุตสาหกรรมจังหวัดลำปาง", "สำนักงานอุตสาหกรรมจังหวัดลำพูน", "สำนักงานอุตสาหกรรมจังหวัดเลย", "สำนักงานอุตสาหกรรมจังหวัดศรีสะเกษ", "สำนักงานอุตสาหกรรมจังหวัดสกลนคร", "สำนักงานอุตสาหกรรมจังหวัดสงขลา", "สำนักงานอุตสาหกรรมจังหวัดสตูล", "สำนักงานอุตสาหกรรมจังหวัดสมุทรปราการ", "สำนักงานอุตสาหกรรมจังหวัดสมุทรสงคราม", "สำนักงานอุตสาหกรรมจังหวัดสมุทรสาคร", "สำนักงานอุตสาหกรรมจังหวัดสระแก้ว", "สำนักงานอุตสาหกรรมจังหวัดสระบุรี", "สำนักงานอุตสาหกรรมจังหวัดสิงห์บุรี", "สำนักงานอุตสาหกรรมจังหวัดสุโขทัย", "สำนักงานอุตสาหกรรมจังหวัดสุพรรณบุรี", "สำนักงานอุตสาหกรรมจังหวัดสุราษฎร์ธานี", "สำนักงานอุตสาหกรรมจังหวัดสุรินทร์", "สำนักงานอุตสาหกรรมจังหวัดหนองคาย", "สำนักงานอุตสาหกรรมจังหวัดหนองบัวลำภู", "สำนักงานอุตสาหกรรมจังหวัดอ่างทอง", "สำนักงานอุตสาหกรรมจังหวัดอำนาจเจริญ", "สำนักงานอุตสาหกรรมจังหวัดอุดรธานี", "สำนักงานอุตสาหกรรมจังหวัดอุตรดิตถ์", "สำนักงานอุตสาหกรรมจังหวัดอุทัยธานี", "สำนักงานอุตสาหกรรมจังหวัดอุบลราชธานี"]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สำนักงานรัฐมนตรี",
    "level3": [""]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สถาบันเพิ่มผลผลิตแห่งชาติ",
    "level3": [""]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สำนักงานปลัดกระทรวงอุตสาหกรรม (ราชการบริหารส่วนกลาง)",
    "level3": ["กองกลาง", "กองกฎหมาย", "กองตรวจราชการ", "กองยุทธศาสตร์และแผนงาน", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักงานที่ปรึกษาด้านอุตสาหกรรมในต่างประเทศ ณ กรุงโตเกียว ประเทศญี่ปุ่น", "สำนักงานที่ปรึกษาด้านอุตสาหกรรมในต่างประเทศ ณ กรุงเวียนนา สาธารณรัฐออสเตรีย", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์ปฏิบัติการต่อต้านการทุจริตกระทรวงอุตสาหกรรม", "กองบริหารทรัพยากรบุคคล"]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สถาบันไทย -  เยอรมัน",
    "level3": [""]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "กรมโรงงานอุตสาหกรรม",
    "level3": ["สำนักงานเลขานุการกรม", "กองกฎหมาย", "กองบริการงานอนุญาตโรงงาน 1", "กองบริการงานอนุญาตโรงงาน 2", "กองบริหารจัดการกากอุตสาหกรรม", "กองบริหารจัดการวัตถุอันตราย", "กองพัฒนาระบบมาตรฐานงานกำกับโรงงาน", "กองพัฒนาอุตสาหกรรมเชิงนิเวศ", "กองยุทธศาสตร์และแผนงาน", "กองวิจัยและเตือนภัยมลพิษโรงงาน", "กองส่งเสริมเทคโนโลยีการผลิตและพื้นที่อุตสาหกรรม", "กองส่งเสริมเทคโนโลยีความปลอดภัยโรงงาน", "กองส่งเสริมเทคโนโลยีสิ่งแวดล้อมโรงงาน", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักงานทะเบียนเครื่องจักรกลาง", "กลุ่มตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สถาบันอาหาร",
    "level3": [""]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "กรมส่งเสริมอุตสาหกรรม",
    "level3": ["สำนักงานเลขานุการกรม", "กองพัฒนาขีดความสามารถธุรกิจอุตสาหกรรม", "กองพัฒนาดิจิทัลอุตสาหกรรม", "กองพัฒนานวัตกรรมและเทคโนโลยีอุตสาหกรรม", "กองพัฒนาอุตสาหกรรมชุมชน", "กองพัฒนาอุตสาหกรรมสร้างสรรค์", "กองยุทธศาสตร์และแผนงาน", "กองโลจิสติกส์", "กรมส่งเสริมผู้ประกอบการและธุรกิจใหม่", "ศูนย์เทคโนโลยีสารสนเทคและการสือสาร", "ศูนย์ส่งเสริมอุตสาหกรรมภาคที่ 1", "ศูนย์ส่งเสริมอุตสาหกรรมภาคที่ 2", "ศูนย์ส่งเสริมอุตสาหกรรมภาคที่ 3", "ศูนย์ส่งเสริมอุตสาหกรรมภาคที่ 4", "ศูนย์ส่งเสริมอุตสาหกรรมภาคที่ 5", "ศูนย์ส่งเสริมอุตสาหกรรมภาคที่ 6", "ศูนย์ส่งเสริมอุตสาหกรรมภาคที่ 7", "ศูนย์ส่งเสริมอุตสาหกรรมภาคที่ 8", "ศูนย์ส่งเสริมอุตสาหกรรมภาคที่ 9", "ศูนย์ส่งเสริมอุตสาหกรรมภาคที่ 10", "ศูนย์ส่งเสริมอุตสาหกรรมภาคที่ 11"]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สถาบันพัฒนาอุตสาหกรรมสิ่งทอ",
    "level3": [""]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "กรมอุตสาหกรรมพื้นฐานและการเหมืองแร่",
    "level3": ["สำนักงานเลขานุการกรม", "กองกฎหมาย", "กองนวัตกรรมวัตถุดิบและอุตสาหกรรมต่อเนื่อง", "กองบริการงานอนุญาต", "กองบริหารจัดการวัตถุดิบอุตสาหกรรม", "กองบริหารสิ่งแวดล้อม", "กองยุทธศาสตร์และแผนงาน", "กองวิศวกรรมบริการ", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักงานอุตสาหกรรมพื้นฐานและการเหมืองแร่ เขต 1", "สำนักงานอุตสาหกรรมพื้นฐานและการเหมืองแร่ เขต 2", "สำนักงานอุตสาหกรรมพื้นฐานและการเหมืองแร่ เขต 3", "กลุ่มตรวจสอบภายใน", "สำนักงานอุตสาหกรรมพื้นฐานและการเหมืองแร่ เขต 4", "สำนักงานอุตสาหกรรมพื้นฐานและการเหมืองแร่ เขต 5", "สำนักงานอุตสาหกรรมพื้นฐานและการเหมืองแร่ เขต 6", "สำนักงานอุตสาหกรรมพื้นฐานและการเหมืองแร่ เขต 7"]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สถาบันรับรองมาตรฐานไอเอสโอ",
    "level3": [""]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สำนักงานคณะกรรมการอ้อยและน้ำตาลทราย",
    "level3": ["กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "สำนักงานเลขานุการกรม", "กองยุทธศาสตร์และแผนงาน", "กองอุตสาหกรรมอ้อย น้ำตาลทราย และอุตสาหกรรมต่อเนื่อง", "ศูนย์ส่งเสริมอุตสาหกรรมอ้อยและน้ำตาลทราย ภาคที่ 1", "ศูนย์ส่งเสริมอุตสาหกรรมอ้อยและน้ำตาลทราย ภาคที่ 2", "ศูนย์ส่งเสริมอุตสาหกรรมอ้อยและน้ำตาลทราย ภาคที่ 3", "ศูนย์ส่งเสริมอุตสาหกรรมอ้อยและน้ำตาลทราย ภาคที่ 4"]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สถาบันยานยนต์",
    "level3": [""]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สำนักงานมาตรฐานผลิตภัณฑ์อุตสาหกรรม",
    "level3": ["สำนักงานเลขานุการกรม", "กองกฎหมาย", "กองกำกับองค์กรด้านการมาตรฐาน", "กองกำหนดมาตรฐาน", "กองควบคุมมาตรฐาน", "กองตรวจการมาตรฐาน 1", "กองตรวจการมาตรฐาน 2", "กองตรวจการมาตรฐาน 3", "กองบริหารมาตรฐานผลิตภัณฑ์ชุมชน", "กองบริหารมาตรฐานระหว่างประเทศ", "กองยุทธศาสตร์และแผนงาน", "กองส่งเสริมและพัฒนาด้านการมาตรฐาน", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักงานคณะกรรมการการมาตรฐานแห่งชาติ", "กลุ่มตรวจสอบภายใน", "กลุ่มที่ปรึกษา"]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สถาบันไฟฟ้าและอิเล็กทรอนิกส์",
    "level3": [""]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สำนักงานเศรษฐกิจอุตสาหกรรม",
    "level3": ["สำนักเลขานุการกรม", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กองนโยบายอุตสาหกรรมมหาภาค", "กองนโยบายอุตสาหกรรมรายสาขา 1", "กองนโยบายอุตสาหกรรมรายสาขา 2", "กองวิจัยเศรษฐกิจอุตสาหกรรม", "กองเศรษฐกิจอุตสาหกรรมระหว่างประเทศ", "กองสารสนเทศและดัชนีเศรษฐกิจอุตสาหกรรม"]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สถาบันเหล็กและเหล็กกล้าแห่งประเทศไทย",
    "level3": [""]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สถาบันพัฒนาวิสาหกิจขนาดกลางและขนาดย่อม",
    "level3": [""]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สถาบันพลาสติก",
    "level3": [""]
}, {
    "level1": "กระทรวงอุตสาหกรรม",
    "level2": "สถาบันการก่อสร้างแห่งประเทศไทย",
    "level3": [""]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "กองอำนวยการรักษาความมั่นคงภายในราชอาณาจักร (กอ.รมน.)",
    "level3": ["กองอำนวยการรักษาความมั่นคงภายในราชอาณาจักร (กอ.รมน.)", "สำนักงานบริหารบุคคล (สบค.กอ.รมน.)", "สำนักงานการข่าว (สขว.กอ.รมน.)", "สำนักนโยบายและยุทธศาสตร์ความมั่นคง (สนย.กอ.รมน.)", "สำนักงานบริหารทั่วไป (สบป.กอ.รมน.)", "สำนักกิจการมวลชนและสารสนเทศ (สมท.กอ.รมน.)", "สำนักงบประมาณและการเงิน (สงป.กอ.รมน.)", "ศูนย์ติดตามสถานการณ์ (ศตส.กอ.รมน.)", "กลุ่มพัฒนาระบบบริหาร (กพร. กอ.รมน.)", "กลุ่มตรวจสอบภายใน (กตน.กอ.รมน.)", "ศูนย์ประสานการปฏิบัติที่ 1 (ศปป. 1 กอ.รมน.)", "ศูนย์ประสานการปฏิบัติที่ 2 (ศปป. 2 กอ.รมน.)", "ศูนย์ประสานการปฏิบัติที่ 3 (ศปป. 3 กอ.รมน.)", "ศูนย์ประสานการปฏิบัติที่ 4 (ศปป. 4 กอ.รมน.)", "ศูนย์ประสานการปฏิบัติที่ 5 (ศปป. 5 กอ.รมน.)"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สถาบันระหว่างประเทศเพื่อการค้าและการพัฒนา",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยขอนแก่น",
    "level3": ["บัณฑิตวิทยาลัย", "สำนักงานอธิการบดี", "คณะสาธารณสุขศาสตร์", "สำนักหอสมุด", "คณะทันตแพทยศาสตร์", "กองยุทธศาสตร์", "คณะเภสัชศาสตร์", "คณะเทคโนโลยี", "สำนักเทคโนโลยีสารสนเทศ", "คณะสัตวแพทยศาสตร์", "คณะสถาปัตยกรรมศาสตร์", "สำนักบริการวิชาการ", "คณะวิทยาศาสตร์", "คณะบริหารธุรกิจและการบัญชี", "สำนักบริหารและพัฒนาวิชาการ", "คณะศิลปกรรมศาสตร์", "วิทยาลัยบัณฑิตศึกษาการจัดการ", "สำนักงานวิทยาเขตหนองคาย", "วิทยาลัยการปกครองท้องถิ่น", "คณะนิติศาสตร์", "คณะเกษตรศาสตร์", "สำนักงานสภามหาวิทยาลัย", "คณะวิทยาศาสตร์ประยุกต์และวิศวกรรมศาสตร์ วิทยาเขตหนองคาย", "คณะสังคมศาสตร์บูรณาการ วิทยาเขตหนองคาย", "คณะบริหารธุรกิจ วิทยาเขตหนองคาย", "คณะศิลปศาสตร์ วิทยาเขตหนองคาย", "คณะวิศวกรรมศาสตร์", "คณะเศรษฐศาสตร์", "วิทยาลัยนานาชาติ", "คณะศึกษาศาสตร์", "คณะพยาบาลศาสตร์", "คณะแพทยศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะเทคนิคการแพทย์"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง",
    "level3": ["สำนักงานบริหารยุทธศาสตร์ สำนักงานอธิการบดี", "คณะวิศวกรรมศาสตร์", "คณะสถาปัตยกรรมศาสตร์", "คณะครุศาสตร์อุตสาหกรรม", "คณะเทคโนโลยีการเกษตร", "สำนักบริการคอมพิวเตอร์", "คณะวิทยาศาสตร์", "สำนักหอสมุดกลาง", "สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง", "วิทยาเขตชุมพรเขตรอุดมศักดิ์", "คณะเทคโนโลยีสารสนเทศ", "สำนักทะเบียนและประมวลผล", "คณะอุตสาหกรรมเกษตร", "สำนักบริหารงานวิจัยและนวัตกรรมพระจอมเกล้าลาดกระบัง", "สำนักวิชาศึกษาทั่วไป", "วิทยาลัยนานาชาติ", "วิทยาลัยนาโนเทคโนโลยีพระจอมเกล้าลาดกระบัง", "วิทยาลัยนวัตกรรมการผลิตขั้นสูง", "คณะการบริหารและจัดการ", "วิทยาลัยวิจัยนวัตกรรมทางการศึกษา", "วิทยาลัยอุตสาหกรรมการบินนานาชาติ", "คณะแพทยศาสตร์", "คณะศิลปศาสตร์", "วิทยาลัยสังคีต"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ",
    "level3": ["กองแผนงาน"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี",
    "level3": ["สำนักงานอธิการบดี", "คณะวิศวกรรมศาสตร์", "คณะพลังงานสิ่งแวดล้อมและวัสดุ", "คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี", "คณะวิทยาศาสตร์", "สำนักหอสมุด", "สำนักคอมพิวเตอร์", "สถาบันพัฒนาและฝึกอบรมโรงงานต้นแบบ", "คณะเทคโนโลยีสารสนเทศ", "สำนักวิจัยและบริการวิทยาศาสตร์และเทคโนโลยี", "คณะสถาปัตยกรรมศาสตร์และการออกแบบ", "สำนักอุทยานวิทยาศาสตร์และอุตสาหกรรม", "คณะทรัพยากรชีวภาพและเทคโนโลยี", "คณะศิลปศาสตร์", "บัณฑิตวิทยาลัยการจัดการและนวัตกรรม", "สถาบันวิทยาการหุ่นยนต์ภาคสนาม", "สถาบันการเรียนรู้", "สำนักบริหารอาคารและสถานที่", "สถาบันนโยบายวิทยาศาสตร์ เทคโนโลยีและนวัตกรรม"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏกำแพงเพชร",
    "level3": ["มหาวิทยาลัยราชภัฏกำแพงเพชร", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "คณะครุศาสตร์", "สำนักศิลปะและวัฒนธรรม", "สำนักประกันคุณภาพการศึกษา", "สำนักบริการวิชาการและจัดหารายได้", "สำนักงานอธิการบดี", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะเทคโนโลยีอุตสาหกรรม", "บัณฑิตวิทยาลัย", "มหาวิทยาลัยราชภัฏกำแพงเพชร แม่สอด", "สถาบันวิจัยและพัฒนา", "สำนักส่งเสริมวิชาการและงานทะเบียน"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานคณะกรรมการกฤษฎีกา",
    "level3": ["สำนักงานเลขาธิการ"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏกาญจนบุรี",
    "level3": ["มหาวิทยาลัยราชภัฏกาญจนบุรี", "สำนักส่งเสริมวิชาการและงานทะเบียน", "คณะครุศาสตร์", "สำนักศิลปะและวัฒนธรรม", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะวิทยาการจัดการ", "คณะเทคโนโลยีอุตสาหกรรม", "สำนักงานอธิการบดี (กองนโยบายและแผน)", "สถาบันวิจัยและพัฒนา"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยกาฬสินธุ์",
    "level3": ["สำนักงานอธิการบดี", "คณะสาธารณสุขศาสตร์", "คณะเทคโนโลยีสังคม", "คณะเทคโนโลยีอุตสาหกรรมเกษตร", "คณะศิลปศาสตร์และวิทยาศาสตร์", "คณะรัฐศาสตร์และนิติศาสตร์", "คณะอุตสาหกรรมสร้างสรรค์", "คณะบริหารธุรกิจ", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะครุศาสตร์"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "ธนาคารกรุงไทย จำกัด (มหาชน)",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยเกษตรศาสตร์",
    "level3": ["สำนักงานอธิการบดี", "คณะเกษตร", "คณะบริหารธุรกิจ", "คณะประมง", "คณะมนุษยศาสตร์", "คณะวนศาสตร์", "คณะวิทยาศาสตร์", "คณะวิศวกรรมศาสตร์", "คณะศึกษาศาสตร์", "คณะเศรษฐศาสตร์", "คณะสถาปัตยกรรมศาสตร์", "คณะสังคมศาสตร์", "คณะสัตวแพทยศาสตร์", "คณะอุตสาหกรรมเกษตร", "บัณฑิตวิทยาลัย", "คณะสิ่งแวดล้อม", "ศูนย์นานาชาติสิรินธร เพื่อการวิจัยพัฒนาและถ่ายทอดเทคโนโลยี", "สถาบันค้นคว้าและพัฒนาผลิตผลทางการเกษตรและอุตสาหกรรมเกษตร", "สถาบันค้นคว้าและพัฒนาผลิตภัณฑ์อาหาร", "สถาบันวิจัยและพัฒนาแห่งมหาวิทยาลัยเกษตรศาสตร์", "สำนักทะเบียนและประมวลผล", "สำนักบริการคอมพิวเตอร์", "สำนักส่งเสริมและฝึกอบรม", "สำนักหอสมุด", "คณะเทคนิคการสัตวแพทย์", "สถาบันวิทยาการขั้นสูงแห่งมหาวิทยาลัยเกษตรศาสตร์", "สำนักงานสภามหาวิทยาลัยเกษตรศาสตร์", "โครงการจัตตั้งวิทยาเขตสุพรรบุรี", "สำนักงานวิทยาเขตกำแพงแสน", "คณะเกษตร กำแพงแสน", "คณะวิศวกรรมศาสตร์กำแพงแสน", "คณะศิลปศาสตร์และวิทยาศาสตร์", "คณะศึกษาศาสตร์และพัฒนศาสตร์", "คณะสัตวแพทยศาสตร์ กำแพงแสน", "ศูนย์เทคโนโลยีชีวภาพเกษตร", "สำนักส่งเสริมและฝึกอบรม กำแพงแสน", "สำนักหอสมุด กำแพงแสน", "คณะวิทยาศาสตร์การกีฬา", "สำนักงานวิทยาเขตศรีราชา", "คณะวิทยาศาสตร์ ศรีราชา", "คณะวิทยาการจัดการ", "คณะวิศวกรรมศาสตร์ ศรีราชา", "คณะเศรษฐศาสตร์ ศรีราชา", "คณะพาณิชยนาวีนานาชาติ", "สำนักงานวิทยาเขตเฉลิมพระเกียรติ จังหวัดสกลนคร", "คณะทรัพยากรธรรมชาติและอุตสาหกรรมเกษตร", "คณะวิทยาศาสตร์และวิศวกรรมศาสตร์", "คณะศิลปศาสตร์และวิทยาการจัดการ", "คณะสาธารณสุขศาสตร์"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สถาบันบริหารจัดการธนาคารที่ดิน",
    "level3": [""]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "องค์การสุรา กรมสรรพสามิต",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏลำปาง",
    "level3": ["สำนักงานอธิการบดี", "คณะครุศาสตร์", "คณะวิทยาศาสตร์", "คณะวิทยาการจัดการ", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะเทคโนโลยีอุตสาหกรรม", "คณะเทคโนโลยีการเกษตร", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักศิลปะและวัฒนธรรม"]
}, {
    "level1": "หน่วยงานอิสระ",
    "level2": "สำนักงานคณะกรรมการปฏิรูปกฎหมาย",
    "level3": ["สำนักเลขาธิการ", "สำนักอำนวยการ", "สำนักบริหารการประชุมและข้อมูล", "สำนักส่งเสริมการมีส่วนร่วมและพัฒนาเครือข่าย", "สำนักสนับสนุนการวิจัย", "กลุ่มงานกฎหมาย", "ผู้ตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏเลย",
    "level3": ["คณะครุศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะวิทยาการจัดการ", "คณะเทคโนโลยีอุตสาหกรรม", "สำนักงานอธิการบดี", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สถาบันวิจัยและพัฒนา", "กองนโยบายและแผน", "สำนักศิลปะและวัฒนธรรม", "ศูนย์การศึกษามหาวิทยาลัยราชภัฏเลย จังหวัดขอนแก่น"]
}, {
    "level1": "กระทรวงวัฒนธรรรม",
    "level2": "สำนักงานรัฐมนตรี",
    "level3": ["กลุ่มบริหารงานทั่วไป", "กลุ่มงานประสานการเมือง", "กลุ่มงานสนับสนุนวิชาการ"]
}, {
    "level1": "กระทรวงวัฒนธรรรม",
    "level2": "สำนักงานปลัดกระทรวงวัฒนธรรม",
    "level3": ["กลุ่มตรวจสอบภายในระดับกระทรวง", "กลุ่มพัฒนาระบบบริหาร", "กองกลาง", "สำนักนโยบายและยุทธศาสตร์", "สำนักตรวจและประเมินผล", "สำนักความสัมพันธ์ระหว่างประเทศ", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักเฝ้าระวังทางวัฒนธรรม", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "กองกฎหมาย", "กลุ่ม ป.ย.ป. ในกระทรวงวัฒนธรรม", "กลุ่มโฆษกและการข่าวกระทรวงวัฒนธรรม", "ศูนย์ประสานการปฏิบัติงานพิธี"]
}, {
    "level1": "กระทรวงวัฒนธรรรม",
    "level2": "กรมการศาสนา",
    "level3": ["สำนักเลขานุการกรม", "กองศาสนูปถัมภ์", "สำนักพัฒนาคุณธรรมจริยธรรม", "สำนักงานขับเคลื่อนแผนแม่บทส่งเสริมคุณธรรมแห่งชาติ", "กลุ่มตรวจสอบภายในระดับกรม", "กลุ่มพัฒนาระบบบริหาร", "สำนักงานส่งเสริมชุมชนคุณธรรม"]
}, {
    "level1": "กระทรวงวัฒนธรรรม",
    "level2": "กรมศิลปากร",
    "level3": ["สำนักบริหารกลาง", "กองโบราณคดี", "กองโบราณคดีใต้น้ำ", "ศูนย์เทคโนโลยีสารสนเทศมรดกศิลปวัฒนธรรรม", "สำนักการสังคีต", "สำนักช่างสิบหมู่", "สำนักพิพิธภัณฑสถานแห่งชาติ", "สำนักวรรณกรรมและประวัติศาสตร์", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "สำนักศิลปากรที่ 1 ราชบุรี", "สำนักศิลปากรที่ 2 สุพรรณบุรี", "สำนักศิลปากรที่ 3 พระนครศรีอยุธยา", "สำนักศิลปากรที่ 4 ลพบุรี", "สำนักศิลปากรที่ 5 ปราจีนบุรี", "สำนักศิลปากรที่ 6 สุโขทัย", "สำนักศิลปากรที่ 7 เชียงใหม่", "สำนักศิลปากรที่ 8 ขอนแก่น", "สำนักศิลปากรที่ 9 อุบลราชธานี", "สำนักศิลปากรที่ 10 นครราชสีมา", "สำนักศิลปากรที่ 11 สงขลา", "สำนักศิลปากรที่ 12 นครศรีธรรมราช", "สำนักสถาปัตยกรรม", "สำนักจดหมายเหตุแห่งชาติ", "สำนักหอสมุดแห่งชาติ"]
}, {
    "level1": "กระทรวงวัฒนธรรรม",
    "level2": "กรมส่งเสริมวัฒนธรรม",
    "level3": ["ส่วนกลาง", "กลุ่มงานที่รายงานตรง", "สำนักงานเลขานุการกรม", "กองกองทุนส่งเสริมงานวัฒนธรรม", "กองกิจการเครือข่ายทางวัฒนธรรม", "สถาบันวัฒนธรรมศึกษา", "ศูนย์วัฒนธรรมแห่งประเทศไทย", "หออัครศิลปิน", "สำนักพิจารณาภาพยนต์และวีดิทัศน์"]
}, {
    "level1": "กระทรวงวัฒนธรรรม",
    "level2": "สำนักงานศิลปวัฒนธรรมร่วมสมัย",
    "level3": ["สำนักงานเลขานุการกรม", "ศูนย์เครือข่ายสัมพันธ์และแหล่งทุน", "ศูนย์หอศิลป์", "สถาบันศิลปวัฒนธรรมร่วมสมัย", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร"]
}, {
    "level1": "กระทรวงวัฒนธรรรม",
    "level2": "สถาบันบัณฑิตพัฒนศิลป์",
    "level3": ["สำนักงานอธิการบดีสถาบันบัณฑิตพัฒนศิลป์", "คณะศิลปวิจิตร", "คณะศิลปนาฏดุริยางค์", "คณะศิลปศึกษา", "วิทยาลัยนาฏศิลป", "วิทยาลัยนาฏศิลปเชียงใหม่", "วิทยาลัยนาฏศิลปนครศรีธรรมราช", "วิทยาลัยนาฏศิลปอ่างทอง", "วิทยาลัยนาฏศิลปร้อยเอ็ด", "วิทยาลัยนาฏศิลปสุโขทัย", "วิทยาลัยนาฏศิลปกาฬสินธุ์", "วิทยาลัยนาฏศิลปลพบุรี", "วิทยาลัยนาฏศิลปจันทบุรี", "วิทยาลัยนาฏศิลปพัทลุง", "วิทยาลัยนาฏศิลปสุพรรณบุรี", "วิทยาลัยนาฏศิลปนครราชสีมา", "วิทยาลัยช่างศิลป", "วิทยาลัยช่างศิลปสุพรรณบุรี", "วิทยัลช่างศิลปนครศรีธรรมราช"]
}, {
    "level1": "กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์",
    "level2": "สำนักงานปลัดกระทรวงฯ",
    "level3": ["สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดกระบี่", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดกาญจนบุรี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดกาฬสินธุ์", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดกำแพงเพชร", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดขอนแก่น", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดจันทุรี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดฉะเชิงเทรา", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดชลบุรี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดชัยนาท", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดชัยภูมิ", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดชุมพร", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดเชียงราย", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดเชียงใหม่", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดตรัง", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดตราด", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดตาก", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดนครนายก", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดนครปฐม", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดนครพนม", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดนครราชสีมา", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดนครศรีธรรมราช", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดนครสวรรค์", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดนนทบุรี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดนราธิวาส", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดน่าน", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดบึงกาฬ", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดบุรีรัมย์", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดปทุมธานี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดประจวบคีรีขันธ์", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดปราจีนบุรี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดปัตตานี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดพระนครศรีอยุธยา", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดพังงา", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดพัทลุง", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดพิจิตร", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดพิษณุโลก", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดเพชรบุรี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดเพชรบูรณ์", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดแพร่", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดพะเยา", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดภูเก็ต", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดมหาสารคาม", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดมุกดาหาร", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดแม่ฮ่องสอน", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดยะลา", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดสุโขทัย", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดสุพรรณบุรี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดสุราษฎร์ธานี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดสุรินทร์", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดหนองคาย", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดหนองบัวลำภู", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดอ่างทอง", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดอุดรธานี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดอุทัยธานี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดอุตรดิตถ์", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดอุบลราชธานี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดอำนาจเจริญ", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดยโสธร", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์ร้จังหวัดร้อยเอ็ด", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดระนอง", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์รจังหวัดะยอง", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดราชบุรี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดลพบุรี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดลำปาง", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดลำพูน", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดเลย", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดศรีสะเกษ", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดสกลนคร", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดสงขลา", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดสตูล", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดสมุทรปราการ", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดสมุทรสงคราม", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดสมุทรสาคร", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดสระแก้ว", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดสระบุรี", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์จังหวัดสิงห์บุรี", "กองกลาง", "กองกฎหมาย", "กองการต่างประเทศ", "กองตรวจราชการ", "กองต่อต้านการค้ามนุษย์", "กองเผยแพร่และประชาสัมพันธ์", "กองมาตรฐานการพัฒนาสังคมและความมั่นคงของมนุษย์", "กองยุทธศาสตร์และแผนงาน", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สถาบันพระประชาบดี", "สำนักงานส่งเสริมและสนับสนุนวิชาการ 1", "สำนักงานส่งเสริมและสนับสนุนวิชาการ 2", "สำนักงานส่งเสริมและสนับสนุนวิชาการ 3", "สำนักงานส่งเสริมและสนับสนุนวิชาการ 4", "สำนักงานส่งเสริมและสนับสนุนวิชาการ 5", "สำนักงานส่งเสริมและสนับสนุนวิชาการ 6", "สำนักงานส่งเสริมและสนับสนุนวิชาการ 7", "สำนักงานส่งเสริมและสนับสนุนวิชาการ 8", "สำนักงานส่งเสริมและสนับสนุนวิชาการ 9", "สำนักงานส่งเสริมและสนับสนุนวิชาการ 10", "สำนักงานส่งเสริมและสนับสนุนวิชาการ 11", "สำนักงานส่งเสริมและสนับสนุนวิชาการ 12", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "สำนักงานพัฒนาสังคมและความมั่นคงของมนุษย์", "ศูนย์ส่งเสริมและประสานการพัฒนาสังคมสำหรับคนไทยในต่างประเทศ"]
}, {
    "level1": "กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์",
    "level2": "สำนักงานรัฐมนตรี",
    "level3": [""]
}, {
    "level1": "กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์",
    "level2": "กรมกิจการเด็กและเยาวชน",
    "level3": ["สำนักงานเลขานุการกรม", "กองยุทธศาสตร์และแผนงาน", "กองคุ้มครองเด็กและเยาวชน", "กองส่งเสริมการพัฒนาและสวัสดิการเด็ก เยาวชน", "ศูนย์อำนวยการรับเด็กเป็นบุตรบุญธรรม", "กลุ่มพัฒนาระบบริหาร", "กลุ่มตรวจสอบภายใน", "ศูนย์ปฏิบัติการโครงการเงินอุดหนุนเพื่อการเลี้ยงดูเด็กแรกเกิด"]
}, {
    "level1": "กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์",
    "level2": "กรมกิจการผู้สูงอายุ",
    "level3": ["สำนักงานเลขานุการกรม", "กองยุทธศาสตร์และแผนงาน", "กองส่งเสริมศักยภาพผู้สูงอายุ", "กองส่งเสริมสวัสดิการและคุ้มครองสิทธิผู้สูงอายุ", "กองบริหารกองทุนผู้สูงอายุ", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์",
    "level2": "กรมกิจการสตรีและสถาบันครอบครัว",
    "level3": ["สำนักงานเลขานุการกรม", "กองคุ้มครองและพัฒนาอาชีพ", "กองยุทธศาสตร์และแผนงาน", "กองส่งเสริมความเสมอภาคระหว่างเพศ", "กองส่งเสริมสถาบันครอบครัว", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์ปฏิบัติการกรมกิจการสตรีและสถาบันครอบครัว", "ศูนย์เรียนรู้การพัฒนาสตรีและครอบครัวจังหวัดเชียงราย", "ศูนย์เรียนรู้การพัฒนาสตรีและครอบครัวเฉลิมพระเกียรติ ๗๒ พรรษา บรมราชินีนาถ จังหวัดลำพูน", "ศูนย์เรียนรู้การพัฒนาสตรีและครอบครัวเฉลิมพระเกียรติสมเด็จพระเทพฯ 36 พรรษา จังหวัดชลบุรี", "ศูนย์เรียนรู้การพัฒนาสตรีและครอบครัวภาคกลาง จังหวัดนนทบุรี", "ศูนย์เรียนรู้การพัฒนาสตรีและครอบครัวภาคตะวันออก เฉียงเหนือ จังหวัดศรีสะเกษ", "ศูนย์เรียนรู้การพัฒนาสตรีและครอบครัวภาคใต้ จังหวัดสงขลา", "ศูนย์เรียนรู้การพัฒนาสตรีและครอบครัวภาคเหนือ งหวัดลำปาง", "ศูนย์เรียนรู้การพัฒนาสตรีและครอบครัวรัตนาภา จังหวัดขอนแก่น", "ศูนย์อำนวยการแก้ไขปัญหาการค้ามนุษย์ด้านสตรีและเด็ก (ศสด.)"]
}, {
    "level1": "กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์",
    "level2": "กรมพัฒนาสังคมและสวัสดิการ",
    "level3": ["กลุ่มผู้เชี่ยวชาญ", "สำนักงานเลขานุการกรม", "กองคุ้มครองสวัสดิภาพและเสริมสร้างคุณภาพชีวิต", "กองพัฒนาสังคมกลุ่มเป้าหมายพิเศษ", "กองยุทธศาสตร์และแผนงาน", "สำนักงานคระกรรมการส่งเสริมการจัดสวัสดิการสังคมแห่งชาติ", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กองกิจการอาสาสมัครและประชาสังคม", "กองหนึ่งใจ... เดียวกัน ในทูลกระหม่อมหญิงอุบลรัตนราชกัญญาสิริวัฒนาพรรณวดี"]
}, {
    "level1": "กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์",
    "level2": "กรมส่งเสริมและพัฒนาคุณภาพชีวิตคนพิการ",
    "level3": ["สำนักงานเลขานุการกรม", "กองกองทุนและส่งเสริมความเสมอภาคคนพิการ", "กองยุทธศาสตร์และแผนงาน", "กองส่งเสริมสิทธิและสวัสดิการคนพิการ", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กองคุ้มครองสวัสดิภาพและพัฒนาคนพิการ"]
}, {
    "level1": "กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์",
    "level2": "การเคหะแห่งชาติ",
    "level3": ["ฝ่ายตรวจสอบภายใน", "ฝ่ายนโยบายและแผน", "ฝ่ายวิชาการพัฒนาที่อยู่อาศัย", "ฝ่ายเทคโนโลยีสารสนเทศ", "ฝ่ายบริหารการเงินและการลงทุน", "ฝ่ายการบัญชี", "ฝ่ายทรัพยากรบุคคล", "ฝ่ายพัสดุและบริการโครงการก่อสร้าง", "ฝ่ายบริหารงานชุมชน 1", "ฝ่ายบริหารงานชุมชน 2", "ฝ่ายบริหารงานชุมชน 3", "ฝ่ายบริหารงานชุมชน 4", "ฝ่ายการตลาดและขาย", "สำนักผู้ว่าการ", "คณะผู้ตรวจการ", "ฝ่ายบริหารสินเชื่อและหนี้", "ฝ่ายพัฒนาโครงการ 1", "ฝ่ายพัฒนาโครงการ 2", "ฝ่ายพัฒนาโครงการ 3", "ฝ่ายบริหารสินทรัพย์", "ฝ่ายปรับปรุงและบำรุงรักษาชุมชน", "ฝ่ายบริหารความเสี่ยงองค์กร", "ฝ่ายกฎหมาย", "ฝ่ายสื่อสารองค์กรและกิจกรรมเพื่อสังคม", "สำนักบริหารชุมชนดินแดง", "ศูนย์ประเมินผลกระทบสิ่งแวดล้อมและวิศวกรรมสำรวจ", "ศูนย์พัฒนาคุณภาพชีวิตและมาตรฐานการบริหารชุมชน"]
}, {
    "level1": "กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์",
    "level2": "สำนักงานธนานุเคราะห์",
    "level3": ["กลุ่มงานตรวจสอบภายใน", "กลุ่มงานผู้เชี่ยวชาญด้านธุรกิจการรับจำนำ (ผู้ตรวจการ)", "ฝ่ายบริหารทั่วไป (งานสารบรรณ งานบริหารทรัพยากรบุคคล งานพัฒนาทรัพยากรบุคคล งานนิติการ)", "ฝ่ายคลังและพัสดุ (งานบัญชีและงบประมาณ งานการเงิน งานพัสดุและยานพาหนะ งานโยธาและอาคารสถานที่ งานประมูลทรัพย์)", "ฝ่ายนโยบายและแผน (งานวิเคราะห์นโยบายและแผน งานติดตามประเมินผล งานข้อมูลและสารสนเทศ", "สำนักงานเลขานุการคณะกรรมการอำนวยการ สนง. ธนานุเคราะห์"]
}, {
    "level1": "กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์",
    "level2": "สถาบันพัฒนาองค์กรชุมชน",
    "level3": ["สำนักบริหารงานกลาง", "สำนักการเงินและบัญชี", "สำนักนโยบายและแผน", "สำนักทรัพยากรบุคคล", "สำนักอำนวยการกลาง", "สำนักตรวจสอบ", "สำนักบ้านมั่นคง", "สำนักงานยุทธศาสตร์และเชื่อมโยงขบวนชุมชน", "สำนักเชื่อมโยงขบวนองค์กรชุมชนและประชาสังคม", "สำนักเลขานุการสภาองค์กรชุมชน", "สำนักพัฒนาเศรษฐกิจและสัมมาชีพชุมชน", "สำนักสื่อสารจัดการความรู้และนวัตกรรมชุมชน", "สำนักบริหารกองทุนและสินเชื่อ", "สำนักงานภาคเหนือ", "สำนักงานภาคตะวันออกเฉียงเหนือ", "สำนักงานภาคใต้", "สำนักงานภาคกรุงเทพฯ ปริมณฑล และตะวันออก", "สำนักงานภาคกลางและตะวันตก", "สำนักเทคโนโลยีสารสนเทศ"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยมหามกุฏราชวิทยาลัย (มมร)",
    "level3": ["สำนักงานอธิการบดี", "กองแผนงาน", "มหาปชาบดีเถรีวิทยาลัย", "วิทยาเขตมหาวชิราลงกรณราชวิทยาลัย", "วิทยาเขตสิรินธรราชวิทยาลัย", "วิทยาเขตอีสาน", "วิทยาเขตล้านนา", "วิทยาเขตศรีธรรมาโศกราช", "วิทยาเขตร้อยเอ็ด", "วิทยาเขตศรีล้านช้าง", "วิทยาลัยศาสนศาสตร์ยโสธร", "วิทยาลัยศาสนศาสตร์เฉลิมพระเกียรติกาฬสินธุ์"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "บริษัท อสมท จำกัด (มหาชน)",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏหมู่บ้านจอมบึง",
    "level3": ["สำนักงานอธิการบดี", "คณะครุศาสตร์", "คณะมนุษยศาตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์และเทคโนโลยี", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักศิลปะและวัฒนธรรม", "สำนักส่งเสริมวิชาการและงานทะเบียน", "วิทยาลัยมวยไทยศึกษาและการแพทย์แผนไทย", "บัณฑิตวิทยาลัย", "คณะเทคโนโลยีอุตสาหกรรม", "กองนโยบายและแผน"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย",
    "level3": ["สำนักงานอธิการบดี", "กองแผนงาน", "บัณฑิตวิทยาลัย", "คณะพุทธศาสตร์", "คณะครุศาสตร์", "คณะมนุษยศาสตร์", "คณะสังคมศาสตร์", "สถาบันภาษา", "สถาบันวิจัยพุทธศาสตร์", "สถาบันวิปัสสนาธุระ", "สำนักทะเบียนและวัดผล", "สำนักส่งเสริมพระพุทธศาสนาและบริการสังคม", "สำนักหอสมุดและเทคโนโลยีสารสนเทศ", "ศูนย์อาเซียนศึกษา", "วิทยาลัยพุทธศาสตร์นานาชาติ", "วิทยาลัยธรรมฑูต", "วิทยาลัยสงฆ์พุทธชินราช", "วิทยาลัยสงฆ์พุทธโสธร", "สำนักงานวิทยาเขตหนองคาย", "วิทยาลัยสงฆ์นครพนม", "สำนักงานวิทยาเขตเชียงใหม่", "วิทยาลัยสงฆ์ลำพูน", "สำนักงานวิทยาเขตนครศรีธรรมราช", "วิทยาลัยสงฆ์ปัตตานี", "สำนักงานวิทยาเขตขอนแก่น", "วิทยาลัยสงฆ์เลย", "สำนักงานวิทยาเขตนครราชสีมา", "สำนักงานวิทยาเขตอุบลราชธานี", "วิทยาลัยสงฆ์ศรีสะเกษ", "สำนักงานวิทยาเขตแพร่", "วิทยาเขตลำปาง", "สำนักงานวิทยาเขตสุรินทร์", "วิทยาลัยสงฆ์บุรีรัมย์", "สำนักงานวิทยาเขตพะเยา", "วิทยาลัยสงฆ์นครน่าน", "วิทยาลัยสงฆ์เชียงราย", "สำนักงานวิทยาเขตบาฬีศึกษาพุทธโฆส", "วิทยาลัยสงฆ์ชัยภูมิ", "วิทยาลัยสงฆ์พุทธปัญญาศรีทวารวดี", "วิทยาลัยสงฆ์ร้อยเอ็ด", "วิทยาลัยสงฆ์พ่อขุนผาเมือง เพชรบูรณ์", "วิทยาลัยสงฆ์ราชบุรี", "สำนักงานวิทยาเขตนครสวรรค์"]
}, {
    "level1": "กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม",
    "level2": "กองบังคับการปราบปรามการกระทำความผิดเกี่ยวกับอาชญากรรมทางเทคโนโลยี",
    "level3": ["ฝ่ายอำนวยการ  กองบังคับการปราบปรามการกระทำความผิดเกี่ยวกับอาชญากรรมทางเทคโนโลยี", "กองบังคับการปราบปรามการกระทำความผิดเกี่ยวกับอาชญากรรมทางเทคโนโลยี", "กองกำกับการ 1 กองบังคับการปราบปรามการกระทำความผิดเกี่ยวกับอาชญากรรมทางเทคโนโลยี", "กองกำกับการ 2 กองบังคับการปราบปรามการกระทำความผิดเกี่ยวกับอาชญากรรมทางเทคโนโลยี", "กองกำกับการ 3 กองบังคับการปราบปรามการกระทำความผิดเกี่ยวกับอาชญากรรมทางเทคโนโลยี", "กลุ่มงานสนับสนุนคดีเทคโนโลยี  กองบังคับการปราบปรามการกระทำความผิดเกี่ยวกับอาชญากรรมทางเทคโนโลยี"]
}, {
    "level1": "กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม",
    "level2": "สำนักงานส่งเสริมเศรษฐกิจดิจิทัล",
    "level3": ["ฝ่ายตรวจสอบภายใน", "กลุ่มงานภายใต้ผู้อำนวยการสำนักงาน", "ฝ่ายส่งเสริมและสนับสนุนการบริการในพื้นที่ภาคเหนือ", "ฝ่ายส่งเสริมและสนับสนุนการบริการในพื้นที่ภาคอีสาน", "ฝ่ายส่งเสริมและสนับสนุนการบริการในพื้นที่ภาคตะวันออก", "ฝ่ายส่งเสริมและสนับสนุนการบริการในพื้นที่ภาคใต้", "ฝ่ายส่งเสริมเขตนวัตกรรมดิจิทัล (โครงการพิเศษ 1)", "ฝ่ายส่งเสริมเมืองอัจฉริยะ (โครงการพิเศษ 2)", "ฝ่ายส่งเสริมการพัฒนากำลังคนดิจิทัล", "ฝ่ายส่งเสริมและสนับสนุนการพัฒนาชุมชน", "ฝ่ายส่งเสริมและสนับสนุนการพัฒนาคุณภาพชีวิตและความมั่นคง", "ฝ่ายส่งเสริมและสนับสนุนการพัฒนาการเกษตรสมัยใหม่", "ฝ่ายส่งเสริมและสนับสนุนการพัฒนาอุตสาหกรรมและธุรกิจ", "ฝ่ายส่งเสริมอุตสาหกรรมดิจิทัล", "ฝ่ายนโยบายและยุทธศาสตร์", "ฝ่ายกลยุทธ์องค์กร", "ฝ่ายอำนวยการสำนักงาน", "ฝ่ายบริหารทรัพยากรองค์กรและบุคคล", "ฝ่ายบริหารการคลังและบริการกลาง"]
}, {
    "level1": "กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม",
    "level2": "สำนักงานปลัดกระทรวงดิจิทัลเพื่อเศรษฐิจและสังคม",
    "level3": ["สำนักงานปลัดกระทรวง", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "กองกลาง", "กองกฎหมาย", "กองการต่างประเทศ", "กองป้องกันและปราบปรามการกระทำความผิดทางเทคโนโลยีสารสนเทศ", "กองยุทธศาสตร์และแผนงาน", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักงานคณะกรรมการธุรกรรมทางอิเล็กทรอนิกส์", "ศูนย์ขับเคลื่อนดิจิทัลเพื่อเศรษฐกิจและสังคม", "กลุ่ม ป.ย.ป.", "กองสื่อสารโทรคมนาคม"]
}, {
    "level1": "กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม",
    "level2": "กรมอุตุนิยมวิทยา",
    "level3": ["สำนักงานเลขานุการกรม", "กองเครื่องมืออุตุนิยมวิทยา", "กองตรวจและเฝ้าระวังสภาวะอากาศ", "กองบริการดิจิทัลอุตุนิยมวิทยา", "กองเฝ้าระวังแผ่นดินไหว", "กองพยากรณ์อากาศ", "กองพัฒนาอุตุนิยมวิทยา", "กองสื่อสาร", "กองอุตุนิยมวิทยาการบิน", "ศูนย์อุตุนิยมวิทยาภาคตะวันออกเฉียงเหนือตอนบน", "ศูนย์อุตุนิยมวิทยาภาคตะวันออกเฉียงเหนือตอนล่าง", "ศูนย์อุตุนิยมวิทยาภาคใต้ฝั่งตะวันตก", "ศูนย์อุตุนิยมวิทยาภาคใต้ฝั่งตะวันออก", "ศูนย์อุตุนิยมวิทยาภาคเหนือ"]
}, {
    "level1": "กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม",
    "level2": "สำนักงานคณะกรรมการดิจิทัลเพื่อเศรษฐกิจและสังคมแห่งชาติ",
    "level3": ["กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริการ", "สำนักงานเลขาธิการ", "กองกฎหมาย", "กองยุทธศาสตร์และแผนงาน", "กองบริหารกองทุนพัฒนาดิจิทัลเพื่อเศรษฐกิจและสังคม", "กองกิจการอวกาศแห่งชาติ", "กองโครงสร้างพื้นฐานเทคโนโลยีดิจิทัล", "ศูนย์พัฒนานโยบายดิจิทัลเพื่อเศรษฐกิจและสังคม", "กองขับเคลื่อนดิจิทัลเพื่อเศรษฐกิจ", "กองขับเคลื่อนดิจิทัลเพื่อสังคม", "ศูนย์ข้อมูลเศรษฐกิจและสังคมดิจิทัล"]
}, {
    "level1": "กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม",
    "level2": "สำนักงานสถิติแห่งชาติ",
    "level3": ["สำนักงานเลขานุการกรม", "กองนโยบายและวิชาการสถิติ", "กองบริหารจัดเก็บข้อมูลสถิติ", "กองสถิติพยากรณ์", "กองสถิติเศรษฐกิจ", "กองสถิติสาธารณมติ", "กองสถิติสังคม", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "ศูนย์สารสนเทศยุทธศาสตร์ภาครัฐ", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงการต่างประเทศ",
    "level2": "สำนักปลัดกระทรวงการต่างประเทศ",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยแม่ฟ้าหลวง",
    "level3": ["ส่วนนโยบายและแผน", "สำนักวิชาศิลปศาสตร์", "สำนักวิชาวิทยาศาสตร์", "สำนักวิชาการจัดการ", "สำนักวิชาเทคโนโลยีสารสนเทศ", "สำนักวิชาอุตสาหกรรมเกษตร", "ส่วนบริการงานวิจัย", "สำนักวิชานิติศาสตร์", "สำนักวิชาวิทยาศาสตร์สุขภาพ", "สำนักวิชาวิทยาศาสตร์เครื่องสำอาง", "สำนักวิชาพยาบาลศาสตร์", "สำนักวิชาเวชศาสตร์ชะลอวัยและฟื้นฟูสุขภาพ", "สำนักวิชาแพทยศาสตร์", "สำนักวิชาทันตแพทยศาสตร์", "สำนักวิชานวัตกรรมสังคม", "สำนักวิชาจีนวิทยา"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยแม่โจ้",
    "level3": ["คณะเศรษฐศาสตร์", "มหาวิทยาลัยแม่โจ้-ชุมพร", "คณะบริหารธุรกิจ", "คณะสารสนเทศและการสื่อสาร", "กองแผนงาน สำนักงานอธิการบดี มหาวิทยาลัยแม่โจ้", "วิทยาลัยบริหารศาสตร์", "คณะสถาปัตยกรรมศาสตร์และการออกแบบสิ่งแวดล้อม", "มหาวิทยาลัยแม่โจ้-แพร่ เฉลิมพระเกียรติ", "คณะสัตวศาสตร์และเทคโนโลยี", "สำนักหอสมุด", "สำนักบริหารและพัฒนาวิชาการ", "วิทยาลัยพลังงานทดแทน", "บัณฑิตวิทยาลัย", "วิทยาลัยนานาชาติ", "คณะผลิตกรรมการเกษตร", "คณะวิทยาศาสตร์", "คณะวิศวกรรมและอุตสาหกรรมเกษตร", "สำนักวิจัยและส่งเสริมวิชาการการเกษตร", "คณะเทคโนโลยีการประมงและทรัพยากรทางน้ำ", "คณะพัฒนาการท่องเที่ยว", "คณะศิลปศาสตร์"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "องค์การบริหารจัดการก๊าซเรือนกระจก",
    "level3": ["อำนวยการ,ตรวจสอบภายใน,พัฒนาระบบบริหาร", "วิเคราะห์และติดตามประเมินผล,ยุทธศาสตร์,พัฒนาธุรกิจ,พัฒนาศักยภาพและเผยแพร่องค์กร,ศูนย์ข้อมูลความรู้,สนับสนุนวิชาการ,สื่อสารองค์กร"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "สำนักงานปลัดกระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level3": ["กองกลาง", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "กองการแก้ไขปัญหาการบุกรุกที่ดิน", "กองการต่างประเทศ", "สำนักงานสิ่งแวดล้อมภาคที่ 10", "สำนักงานสิ่งแวดล้อมภาคที่ 1", "สำนักงานสิ่งแวดล้อมภาคที่ 11", "สำนักงานสิ่งแวดล้อมภาคที่ 12", "สำนักงานสิ่งแวดล้อมภาคที่ 13", "สำนักงานสิ่งแวดล้อมภาคที่ 14", "สำนักงานสิ่งแวดล้อมภาคที่ 15", "สำนักงานสิ่งแวดล้อมภาคที่ 16", "สำนักงานสิ่งแวดล้อมภาคที่ 2", "สำนักงานสิ่งแวดล้อมภาคที่ 3", "สำนักงานสิ่งแวดล้อมภาคที่ 4", "สำนักงานสิ่งแวดล้อมภาคที่ 5", "สำนักงานสิ่งแวดล้อมภาคที่ 6", "สำนักงานสิ่งแวดล้อมภาคที่ 7", "สำนักงานสิ่งแวดล้อมภาคที่ 8", "สำนักงานสิ่งแวดล้อมภาคที่ 9", "กองตรวจราชการ", "กองยุทธศาสตร์และแผนงาน", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กองการบิน", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด กระบี่", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด กรุงเทพมหานคร", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด กาญจนบุรี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด กาฬสินธุ์", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด กำแพงเพชร", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ขอนแก่น", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด จันทบุรี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ฉะเชิงเทรา", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ชลบุรี", "ศูนย์บริการร่วมกระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ชัยนาท", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ชัยภูมิ", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ชุมพร", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด เชียงราย", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด เชียงใหม่", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ตรัง", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ตราด", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ตาก", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด นครนายก", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด นครปฐม", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด นครพนม", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด นครราชสีมา", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด นครศรีธรรมราช", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด นครสวรรค์", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด นนทบุรี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด นราธิวาส", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด น่าน", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด บึงกาฬ", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด บุรีรัมย์", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ปทุมธานี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ประจวบคีรีขันธ์", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ปราจีนบุรี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ปัตตานี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด พะเยา", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด พระนครศรีอยุธยา", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด พังงา", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด พัทลุง", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด พิจิตร", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด พิษณุโลก", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด เพชรบุรี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด เพชรบูรณ์", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด แพร่", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ภูเก็ต", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด มหาสารคาม", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด มุกดาหาร", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด แม่ฮ่องสอน", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ยโสธร", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ยะลา", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ร้อยเอ็ด", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ระนอง", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ระยอง", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ราชบุรี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ลพบุรี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ลำปาง", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ลำพูน", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด เลย", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด ศรีสะเกษ", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด สกลนคร", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด สงขลา", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด สตูล", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด สมุทรปราการ", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด สมุทรสงคราม", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด สมุทรสาคร", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด สระแก้ว", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด สระบุรี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด สิงห์บุรี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด สุโขทัย", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด สุพรรณบุรี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด สุราษฎร์ธานี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด สุรินทร์", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด หนองคาย", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด หนองบัวลำภู", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด อ่างทอง", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด อำนาจเจริญ", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด อุดรธานี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด อุตรดิตถ์", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด อุทัยธานี", "สำนักงานทรัพยากรธรรมชาติและสิ่งแวดล้อมจังหวัด อุบลราชธานี", "สำนักผู้ประสานงานคณะรัฐมนตรีและหน่วยงานของรัฐสภา", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "กองกฎหมาย", "สถาบันพัฒนาทรัพยากรบุคคล", "กลุ่ม ป.ย.ป."]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "สำนักงานพัฒนาเศรษฐกิจจากฐานชีวภาพ",
    "level3": ["สำนักงานพัฒนาเศรษฐกิจจากฐานชีวภาพ"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "กรมควบคุมมลพิษ",
    "level3": ["สำนักงานเลขานุการกรม", "กองนิติกร", "กองแผนงานและประเมินผล", "สำนักจัดการกากของเสียและสารอันตราย", "สำนักจัดการคุณภาพน้ำ", "สำนักจัดการคุณภาพอากาศและเสียง", "ฝ่ายตรวจและบังคับการ", "ฝ่ายคุณภาพสิ่งแวดล้อมห้องปฏิบัติการ", "กลุ่มพัฒนาระบบบริหาร"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "กรมทรัพยากรทางทะเลและชายฝั่ง",
    "level3": ["สำนักงานเลขานุการกรม", "กองแผนงาน", "สถาบันวิจัยและพัฒนาทรัพยากรทางทะเล ชายฝั่งทะเล และป่าชายเลน", "สำนักอนุรักษ์ทรัพยากรทางทะเลและชายฝั่ง", "สำนักอนุรักษ์ทรัพยากรป่าชายเลน", "กลุ่มนิติการ", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มงานคุ้มครองจริยธรรม", "ผู้ตรวจราชการกรม", "กองบริหารจัดการพื้นที่ชายฝั่ง", "กลุ่มตรวจสอบภายใน", "กลุ่มส่งเสริมและประสานงานเครือข่ายทรัพยากรทางทะเลและชายฝั่ง", "สำนักงานบริหารจัดการทะเลและชายฝั่งที่ 1", "สำนักงานบริหารจัดการทะเลและชายฝั่งที่ 2", "สำนักงานบริหารจัดการทะเลและชายฝั่งที่ 3", "สำนักงานบริหารจัดการทะเลและชายฝั่งที่ 4", "สำนักงานบริหารจัดการทะเลและชายฝั่งที่ 5", "สำนักงานบริหารจัดการทะเลและชายฝั่งที่ 6", "สำนักงานบริหารจัดการทะเลและชายฝั่งที่ 7", "สำนักงานบริหารจัดการทะเลและชายฝั่งที่ 8", "สำนักงานบริหารจัดการทะเลและชายฝั่งที่ 9", "สำนักงานบริหารจัดการทะเลและชายฝั่งที่ 10", "ศูนย์สารสนเทศเพื่อการจัดการ"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "กรมทรัพยากรธรณี",
    "level3": ["สำนักเลขานุการกรม", "กองวิเคราะห์และตรวจสอบทรัพยากรธรณี", "กองอนุรักษ์และจัดการทรัพยากรธรณี", "ศูนย์สารสนเทศทรัพยากธรณี", "สำนักทรัพยากรแร่", "สำนักเทคโนโลยีธรณี", "สำนักธรณีวิทยา", "สำนักธรณีวิทยาสิ่งแวดล้อม", "กลุ่มตรวจสอบภายใน", "กลุ่มนิติการ", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มงานคุ้มครองจริยธรรม", "กองคุ้มครองซากดึกดำบรรพ์", "สำนักงานทรัพยากรธรณีเขต 1", "สำนักงานทรัพยากรธรณีเขต 2", "สำนักงานทรัพยากรธรณีเขต 3", "สำนักงานทรัพยากรธรณีเขต 4", "สำนักงานเลขานุการคณะกรรมการนโยบายบริหารจัดการแร่แห่งชาติ"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "กรมทรัพยากรน้ำ",
    "level3": ["สำนักเลขานุการกรม", "ศูนย์ป้องกันวิกฤติน้ำ", "ศูนย์สารสนเทศทรัพยากรน้ำ", "สำนักนโยบายและแผน", "สำนักบริหารจัดการน้ำ", "สำนักประสานความร่วมมือระหว่างประเทศ", "สำนักพัฒนาแหล่งน้ำ", "สำนักวิจัย พัฒนาและอุทกวิทยา", "สำนักส่งเสริมและประสานมวลชน", "สำนักอนุรักษ์และฟื้นฟูแหล่งน้ำ", "สำนักงานทรัพยากรน้ำภาค 1", "สำนักงานทรัพยากรน้ำภาค 2", "สำนักงานทรัพยากรน้ำภาค 3", "สำนักงานทรัพยากรน้ำภาค 4", "สำนักงานทรัพยากรน้ำภาค 5", "สำนักงานทรัพยากรน้ำภาค 6", "สำนักงานทรัพยากรน้ำภาค 7", "สำนักงานทรัพยากรน้ำภาค 8", "กลุ่มนิติการ", "สำนักงานทรัพยากรน้ำภาค 9", "สำนักบริหารจัดการลุ่มน้ำระหว่างประเทศ", "สำนักงานทรัพยากรน้ำภาค 10", "สำนักผู้ตรวจราชการ", "สำนักงานทรัพยากรน้ำภาค 11", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "กองสื่อสารและเผยแพร่"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "กรมทรัพยากรน้ำบาดาล",
    "level3": ["สำนักบริหารกลาง", "ศูนย์นาคราช", "กองแผนงาน", "ศูนย์เทคโนโลยีสารสนเทศทรัพยากรน้ำบาดาล", "สำนักควบคุมกิจการน้ำบาดาล", "สำนักพัฒนาน้ำบาดาล", "สำนักสำรวจและประเมินศักยภาพน้ำดาบาล", "สำนักอนุรักษ์และฟื้นฟูทรัพยากรน้ำบาดาล", "สำนักทรัพยากรน้ำบาดาล เขต 1 ลำปาง", "สำนักทรัพยากรน้ำบาดาล เขต 2 สุพรรณบุรี", "สำนักทรัพยากรน้ำบาดาล เขต 3 สระบุรี", "สำนักทรัพยากรน้ำบาดาล เขต 4 ขอนแก่น", "สำนักทรัพยากรน้ำบาดาล เขต 5 นครราชสีมา", "สำนักทรัพยากรน้ำบาดาล เขต 6 ตรัง", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "กลุ่มนิติการ", "สำนักทรัพยากรน้ำบาดาล เขต 7 กำแพงเพชร", "สำนักทรัพยากรน้ำบาดาล เขต 8 ราชบุรี", "สำนักทรัพยากรน้ำบาดาล เขต 9 ระยอง", "สำนักทรัพยากรน้ำบาดาล เขต 10 อุดรธานี", "สำนักทรัพยากรน้ำบาดาล เขต 11 อุบลราชธานี", "สำนักทรัพยากรน้ำบาดาล เขต 12 สงขลา", "กองวิเคราะห์น้ำบาดาล", "กองสื่อสารและการมีส่วนร่วม", "ศูย์ปฏิบัติการเพื่อสนับสนุนโครงการอันเนื่องมาจากพระราชดำริและโครงการพิเศษ", "วิทยาลัยน้ำบาดาลประชารักษ์", "กองบริหารกองทุนพัฒนาน้ำบาดาล", "ศูนย์พิทักษ์น้ำบาดาล"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "กรมส่งเสริมคุณภาพสิ่งแวดล้อม",
    "level3": ["สำนักงานเลขานุการกรม", "กองส่งเสริมและเผยแพร่", "ศูนย์วิจัยและฝึกอบรมด้านสิ่งแวดล้อม", "ศูนย์สารสนเทศสิ่งแวดล้อม", "สำนักส่งเสริมการมีส่วนร่วมของประชาชน", "กลุ่มพัฒนาระบบบริหารจัดการ", "กลุ่มตรวจสอบภายใน", "ผู้เชี่ยวชาญเฉพาะด้านส่งเสริม", "กลุ่มงานคุ้มครองจริยธรรม", "กองยุทธศาสตร์และแผนงาน", "กองพัฒนาทรัพยากรบุคคลด้านสิ่งแวดล้อม", "กองอาสาสมัครพิทักษ์ทรัพยากรธรรมชาติและสิ่งแวดล้อม"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "กรมอุทยานแห่งชาติ สัตว์ป่า และพันธุ์พืช",
    "level3": ["สำนักบริหารงานกลาง", "กองคุ้มครองพันธุ์สัตว์ป่าและพืชป่าตามอนุสัญญา", "กองนิติการ", "สำนักป้องกัน ปราบปราม และควบคุมไฟป่า", "สำนักแผนงานและสารสนเทศ", "สำนักฟื้นฟูและพัฒนาพื้นที่อนุรักษ์", "สำนักวิจัยการอนุรักษ์ป่าไม้และพันธุ์พืช", "สำนักอนุรักษ์และจัดการต้นน้ำ", "สำนักอนุรักษ์สัตว์ป่า", "สำนักอุทยานแห่งชาติ", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 1 (ปราจีนบุรี)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 2 (ศรีราชา)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 3 (บ้านโป่ง)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 4 (สุราษฎร์ธานี)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 5 (นครศรีธรรมราช)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 6 (สงขลา)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 7 (นครราชสีมา)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 8 (ขอนแก่น)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 9 (อุบลราชธานี)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 10 (อุดรธานี)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 11 (พิษณุโลก)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 12 (นครสวรรค์)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 13 (แพร่)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 14 (ตาก)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 15 (เชียงราย)", "สำนักบริหารพื้นที่อนุรักษ์ ที่ 16 (เชียงใหม่)", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "สำนักงานผู้ตรวจราชการกรม", "สำนักสนองงานพระราชดำริ", "ศูนย์ประสานราชการใสสะอาดกรมอุทยานแห่งชาติ สัตว์ป่า และพันธุ์พืช", "ศูนย์บริการประชาชน กรมอุทยานแห่งชาติ สัตว์ป่า และพันธุ์พืช", "ศูนย์ปฏิบัติการพิเศษผู้พิทักษ์อุทยานแห่งชาติและสัตว์ป่า", "กองการต่างประเทศ"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "สำนักงานนโยบายและแผนทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level3": ["สำนักงานเลขานุการกรม", "กองจัดการความหลากหลายทางชีวภาพ", "กองจัดการสิ่งแวดล้อมธรรมชาติและศิลปกรรม", "กองติดตามประเมินผลสิ่งแวดล้อม", "กองบริหารกองทุนสิ่งแวดล้อม", "กองบริหารจัดการที่ดิน", "กองประสานการจัดการเปลี่ยนแปลงสภาพภูมิอากาศ", "กองพัฒนาระบบวิเคราะห์ผลกระทบสิ่งแวดล้อม", "กองยุทธศาสตร์และแผนงาน", "กองวิเคราะห์ผลกระทบสิ่งแวดล้อม", "กองสิ่งแวดล้อมชุมชนและพื่นที่เฉพาะ", "กลุ่มตรวจสอบภายใน", "กลุ่มนิติการ", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มงานคุ้มครองจริยธรรม"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "องค์การสวนสัตว์",
    "level3": ["ผู้อำนวยการองค์การสวนสัตว์", "สำนักตรวจสอบ", "สำนักบริหารกลาง", "สำนักการเงินและทรัพย์สิน", "สำนักยุทธศาสตร์และแผน", "สำนักกฎหมาย", "สำนักอนุรักษ์ และวิจัย", "สำนักพัฒนาธุรกิจ", "สำนักเทคโนโลยีสารสนเทศ", "สโมสรผู้รักสวนสัตว์แห่งประเทศไทย", "สวนสัตว์ดุสิต", "สวนสัตว์เปิดเขาเขียว", "สวนสัตว์เชียงใหม่", "สวนสัตว์นครราชศรีมา", "สวนสัตว์สงขลา", "สวนสัตว์อุบลราชธานี", "สวนสัตว์ขอนแก่น", "โครงการคชอาณาจักร จังหวัดสุรินทร์", "สำนักบริหารทรัพยากรบุคคล", "คณะทำงานเลขานุการผู้อำนวยการองค์การสวนสัตว์", "พนักงานปฏิบัติหน้าที่ องค์การสวนสัตว์", "สถาบันบริหารจัดการสวนสัตว์"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "องค์การสวนพฤกษศาสตร์",
    "level3": ["สำนักอำนวยการ", "สำนักวิจัย", "สำนักพัฒนาสวนพฤกษศาสตร์", "สำนักส่งเสริมความรู้และกิจการ", "สำนักตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "องค์การจัดการน้ำเสีย",
    "level3": ["ผู้อำนวยการองค์การจัดการน้ำเสีย", "รองผู้อำนวยการบริหาร", "รองผู้อำนวยการวิชาการ", "รองผู้อำนวยการปฏิบัติการ"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "องค์การอุตสาหกรรมป่าไม้",
    "level3": ["บริหารงานกลาง", "สำนักตรวจสอบภายใน", "สำนักบัญชีและการเงิน", "สำนักนโยบายและแผน", "สำนักกฎหมาย", "สำนักวิจัยพัฒนาการจัดการป่าไม้เศรษฐกิจอย่างยั่งยืน", "สำนักธุรกิจการตลาด", "องค์การอุตสาหกรรมป่าไม้ภาคเหนือบน", "องค์การอุตสาหกรรมป่าไม้ภาคเหนือล่าง", "องค์การอุตสาหกรรมป่าไม้ภาคกลาง", "องค์การอุตสาหกรรมป่าไม้ภาคตะวันออกเฉียงเหนือ", "องค์การอุตสาหกรรมป่าไม้ภาคใต้", "สถาบันคชบาลแห่งชาติ ในพระอุปถัมภ์ฯ"]
}, {
    "level1": "กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    "level2": "กรมป่าไม้",
    "level3": ["สำนักบริหารกลาง", "สำนักการอนุญาต", "สำนักจัดการที่ดินป่าไม้", "สำนักจัดการป่าชุมชน", "สำนักป้องปันรักษาป่าและควบคุมไฟป่า", "สำนักแผนงานและสารสนเทศ", "สำนักวิจัยและพัฒนาการป่าไม้", "สำนักส่งเสริมการปลูกป่า", "สำนักกฎหมาย", "สำนักจัดการทรัพยากรป่าไม้ที่ 1 (เชียงใหม่)", "สำนักจัดการทรัพยากรป่าไม้ที่ 2 (เชียงราย)", "สำนักจัดการทรัพยากรป่าไม้ที่ 3 (ลำปาง)", "สำนักจัดการทรัพยากรป่าไม้ที่ 4 (ตาก)", "สำนักจัดการทรัพยากรป่าไม้ที่ 5 (สระบุรี)", "สำนักจัดการทรัพยากรป่าไม้ที่ 6 (อุดรธานี)", "สำนักจัดการทรัพยากรป่าไม้ที่ 7 (ขอนแก่น)", "สำนักจัดการทรัพยากรป่าไม้ที่ 8 (นครราชสีมา)", "สำนักจัดการทรัพยากรป่าไม้ที่ 9 (ชลบุรี)", "สำนักจัดการทรัพยากรป่าไม้ที่ 10 (ราชบุรี)", "สำนักจัดการทรัพยากรป่าไม้ที่ 11 (สุราษฎธานี)", "สำนักจัดการทรัพยากรป่าไม้ที่ 12 (นครศรีธรรมราช)", "สำนักจัดการทรัพยากรป่าไม้ที่ 13 (สงขลา)"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "สำนักงานปลัดกระทรวงเกษตรและสหกรณ์",
    "level3": ["สำนักงานรัฐมนตรี", "กองกลาง", "ศูนย์อำนวยการบริหารจังหวัดชายแดนภาคใต้", "กองการเจ้าหน้าที่", "กองคลัง", "สำนักการเกษตรต่างประเทศ", "กองเกษตรสารนิเทศ", "สำนักตรวจราชการ", "กองนโยบายเทคโนโลยีเพื่อการเกษตรและเกษตรกรรมยั่งยืน", "สำนักกฎหมาย", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สถาบันเกษตราธิการ", "สำนักแผนงานและโครงการพิเศษ", "สำนักตรวจสอบภายใน", "สำนักบริหารกองทุนช่วยเหลือเกษตรกรและรับเรื่องร้องเรียน", "สำนักพัฒนาระบบบริหาร", "กลุ่มประสานงานคณะรัฐมนตรีและหน่วยงานของรัฐสภา", "สำนักงานเกษตรและสหกรณ์จังหวัด กระบี่", "สำนักงานเกษตรและสหกรณ์จังหวัด กรุงเทพมหานคร", "สำนักงานเกษตรและสหกรณ์จังหวัด กาญจนบุรี", "สำนักงานเกษตรและสหกรณ์จังหวัด กาฬสินธุ์", "สำนักงานเกษตรและสหกรณ์จังหวัด กำแพงเพชร", "สำนักงานเกษตรและสหกรณ์จังหวัด ขอนแก่น", "สำนักงานเกษตรและสหกรณ์จังหวัด จันทบุรี", "สำนักงานเกษตรและสหกรณ์จังหวัด ฉะเชิงเทรา", "สำนักงานเกษตรและสหกรณ์จังหวัด ชลบุรี", "สำนักงานเกษตรและสหกรณ์จังหวัด ชัยนาท", "สำนักงานเกษตรและสหกรณ์จังหวัด ชัยภูมิ", "สำนักงานเกษตรและสหกรณ์จังหวัด ชุมพร", "สำนักงานเกษตรและสหกรณ์จังหวัด เชียงราย", "สำนักงานเกษตรและสหกรณ์จังหวัด เชียงใหม่", "สำนักงานเกษตรและสหกรณ์จังหวัด ตรัง", "สำนักงานเกษตรและสหกรณ์จังหวัด ตราด", "สำนักงานเกษตรและสหกรณ์จังหวัด ตาก", "สำนักงานเกษตรและสหกรณ์จังหวัด นครนายก", "สำนักงานเกษตรและสหกรณ์จังหวัด นครปฐม", "สำนักงานเกษตรและสหกรณ์จังหวัด นครพนม", "สำนักงานเกษตรและสหกรณ์จังหวัด นครราชสีมา", "สำนักงานเกษตรและสหกรณ์จังหวัด นครศรีธรรมราช", "สำนักงานเกษตรและสหกรณ์จังหวัด นครสวรรค์", "สำนักงานเกษตรและสหกรณ์จังหวัด นนทบุรี", "สำนักงานเกษตรและสหกรณ์จังหวัด นราธิวาส", "สำนักงานเกษตรและสหกรณ์จังหวัด น่าน", "สำนักงานเกษตรและสหกรณ์จังหวัด บึงกาฬ", "สำนักงานเกษตรและสหกรณ์จังหวัด บุรีรัมย์", "สำนักงานเกษตรและสหกรณ์จังหวัด ปทุมธานี", "สำนักงานเกษตรและสหกรณ์จังหวัด ประจวบคีรีขันธ์", "สำนักงานเกษตรและสหกรณ์จังหวัด ปราจีนบุรี", "สำนักงานเกษตรและสหกรณ์จังหวัด ปัตตานี", "สำนักงานเกษตรและสหกรณ์จังหวัด พะเยา", "สำนักงานเกษตรและสหกรณ์จังหวัด พระนครศรีอยุธยา", "สำนักงานเกษตรและสหกรณ์จังหวัด พังงา", "สำนักงานเกษตรและสหกรณ์จังหวัด พัทลุง", "สำนักงานเกษตรและสหกรณ์จังหวัด พิจิตร", "สำนักงานเกษตรและสหกรณ์จังหวัด พิษณุโลก", "สำนักงานเกษตรและสหกรณ์จังหวัด เพชรบุรี", "สำนักงานเกษตรและสหกรณ์จังหวัด เพชรบูรณ์", "สำนักงานเกษตรและสหกรณ์จังหวัด แพร่", "สำนักงานเกษตรและสหกรณ์จังหวัด ภูเก็ต", "สำนักงานเกษตรและสหกรณ์จังหวัด มหาสารคาม", "สำนักงานเกษตรและสหกรณ์จังหวัด มุกดาหาร", "สำนักงานเกษตรและสหกรณ์จังหวัด แม่ฮ่องสอน", "สำนักงานเกษตรและสหกรณ์จังหวัด ยโสธร", "สำนักงานเกษตรและสหกรณ์จังหวัด ยะลา", "สำนักงานเกษตรและสหกรณ์จังหวัด ร้อยเอ็ด", "สำนักงานเกษตรและสหกรณ์จังหวัด ระนอง", "สำนักงานเกษตรและสหกรณ์จังหวัด ระยอง", "สำนักงานเกษตรและสหกรณ์จังหวัด ราชบุรี", "สำนักงานเกษตรและสหกรณ์จังหวัด ลพบุรี", "สำนักงานเกษตรและสหกรณ์จังหวัด ลำปาง", "สำนักงานเกษตรและสหกรณ์จังหวัด ลำพูน", "สำนักงานเกษตรและสหกรณ์จังหวัด เลย", "สำนักงานเกษตรและสหกรณ์จังหวัด ศรีสะเกษ", "สำนักงานเกษตรและสหกรณ์จังหวัด สกลนคร", "สำนักงานเกษตรและสหกรณ์จังหวัด สงขลา", "สำนักงานเกษตรและสหกรณ์จังหวัด สตูล", "สำนักงานเกษตรและสหกรณ์จังหวัด สมุทรปราการ", "สำนักงานเกษตรและสหกรณ์จังหวัด สมุทรสงคราม", "สำนักงานเกษตรและสหกรณ์จังหวัด สมุทรสาคร", "สำนักงานเกษตรและสหกรณ์จังหวัด สระแก้ว", "สำนักงานเกษตรและสหกรณ์จังหวัด สระบุรี", "สำนักงานเกษตรและสหกรณ์จังหวัด สิงห์บุรี", "สำนักงานเกษตรและสหกรณ์จังหวัด สุโขทัย", "สำนักงานเกษตรและสหกรณ์จังหวัด สุพรรณบุรี", "สำนักงานเกษตรและสหกรณ์จังหวัด สุราษฎร์ธานี", "สำนักงานเกษตรและสหกรณ์จังหวัด สุรินทร์", "สำนักงานเกษตรและสหกรณ์จังหวัด หนองคาย", "สำนักงานเกษตรและสหกรณ์จังหวัด หนองบัวลำภู", "สำนักงานเกษตรและสหกรณ์จังหวัด อ่างทอง", "สำนักงานเกษตรและสหกรณ์จังหวัด อำนาจเจริญ", "สำนักงานเกษตรและสหกรณ์จังหวัด อุดรธานี", "สำนักงานเกษตรและสหกรณ์จังหวัด อุตรดิตถ์", "สำนักงานเกษตรและสหกรณ์จังหวัด อุทัยธานี", "สำนักงานเกษตรและสหกรณ์จังหวัด อุบลราชธานี", "กองบริหารงานกองทุนสงเคราะห์เกษตรกร", "กองประสานงานโครงการพระราชดำริ", "สำนักงานเลขานุการคณะกรรมการส่งเสริมและพัฒนาระบบเกษตรพันธสัญญา", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "กลุ่มขับเคลื่อนการปฏิรูปประเทศ ยุทธศาสตร์ชาติ และการสร้างความสามัคคีปรองดอง กระทรวงเกษตรและสหกรณ์"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "กรมชลประทาน",
    "level3": ["สำนักงานเลขานุการกรม", "กองการเงินและบัญชี", "กองแผนงาน", "กองพัฒนาแหล่งน้ำขาดแคลน", "กองพัสดุ", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักกฎหมายและที่ดิน", "สำนักเครื่องจักรกล", "สำนักงานจัดรูปที่ดินกลาง", "สำนักงานชลประทานที่ 1", "สำนักงานชลประทานที่ 2", "สำนักงานชลประทานที่ 3", "สำนักงานชลประทานที่ 4", "สำนักงานชลประทานที่ 5", "สำนักงานชลประทานที่ 6", "สำนักงานชลประทานที่ 7", "สำนักงานชลประทานที่ 8", "สำนักงานชลประทานที่ 9", "สำนักงานชลประทานที่ 10", "สำนักงานชลประทานที่ 11", "สำนักงานชลประทานที่ 12", "สำนักงานชลประทานที่ 13", "สำนักงานชลประทานที่ 14", "สำนักงานชลประทานที่ 15", "สำนักงานชลประทานที่ 16", "สำนักงานชลประทานที่ 17", "สำนักบริหารโครงการ", "สำนักบริหารจัดการน้ำและอุทกวิทยา", "สำนักบริหารทรัพยากรบุคคล", "สำนักพัฒนาแหล่งน้ำขนาดใหญ่", "สำนักวิจัยและพัฒนา", "สำนักสำรวจด้านวิศวกรรมและรณีวิทยา", "สำนักออกแบบวิศวกรรมและสถาปัตยกรรม", "กลุ่มตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "กรมตรวจบัญชีสหกรณ์",
    "level3": ["สำนักแผนงานและโครงการพิเศษ", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักมาตรฐานการบัญชีและการสอบบัญชี", "สำนักงานส่งเสริมพัฒนาการบัญชีและถ่ายทอดเทคโนโลยี"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "กรมประมง",
    "level3": ["ราชการบริหารส่วนกลาง", "สำนักงานเลขานุการกรม", "กองกฎหมาย", "กองการเจ้าหน้าที่", "กองคลัง", "กองควบคุมการค้าสัตว์น้ำและปัจจัยการผลิต", "กองโครงการอันเนื่องมาจากพระราชดำริและกิจกรรมพิเศษ", "กองตรวจการประมง", "กองตรวจสอบคุณภาพสินค้าประมง", "กองนโยบายและยุทธศาสตร์พัฒนาการประมง", "กองบริหารจัดการทรัพยากรและกำหนดมาตรการ", "กองบริหารจัดการเรือประมงและการทำการประมง", "กองประมงต่างประเทศ", "กองแผนงาน", "กองพัฒนาระบบการรับรองมาตรฐานสินค้าประมงและหลักฐานเพื่อการสืบค้น", "กองวิจัยและพัฒนาการเพาะเลี้ยงสัตว์น้ำจืด", "กองวิจัยและพัฒนาการเพาะเลี้ยงสัตว์น้ำชายฝั่ง", "กองวิจัยและพัฒนาเทคโนโลยีอุตสาหกรรมสัตว์น้ำ", "กองวิจัยและพัฒนาประมงทะเล", "กองวิจัยและพัฒนาประมงน้ำจืด", "กองวิจัยและพัฒนาพันธุกรรมสัตว์น้ำ", "กองวิจัยและพัฒนาสุขภาพสัตว์น้ำ", "กองวิจัยและพัฒนาอาหารสัตว์น้ำ", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักงานประมงพื้นที่กรุงเทพมหานคร", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบริหาร", "กองควบคุมการประมงนอกน่านน้ำและการขนถ่ายสัตว์น้ำ"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "กรมปศุสัตว์",
    "level3": ["เลขานุการกรม (สลก.)", "กองการเจ้าหน้าที่ (กกจ.)", "กองคลัง (กค.)", "สำนักกฎหมาย (สกม.)", "สำนักพัฒนาพันธุ์สัตว์ (สพพ.)", "กองแผนงาน (กผง.)", "สำนักพัฒนาอาหารสัตว์ (สอส.)", "ศูนย์เทคโนโลยีสารสนเทศการสื่อสาร (ศทส.)", "สถาบันสุขภาพสัตว์แห่งชาติ (สสช.)", "สำนักควบคุม ป้องกันและบำบัดโรคสัตว์ (สคบ.)", "สำนักตรวจสอบคุรภาพสินค้าปศุสัตว์ (สตส.)", "สำนัเทคโนโลยีชีวภัณฑ์สัตว์ (สทช.)", "สำนักเทคโนโลยีชีวภาพการผลิตปศุสัตว์ (สทป.)", "กองส่งเสริมและพัฒนาการปศุสัตว์ (กสส.)", "สำนักพัฒนาระบบและรับรองมาตรฐานสินค้าปศุสัตว์ (สพส.)", "กลุ่มตรวจสอบภายใน (สตน.)", "กลุ่มพัฒนาระบบบริหาร (กพร.)", "กองความร่วมมือด้านการปศุสัตว์ระหว่างประเทศ (กรป.)", "สำนักงานปุสัตว์พื้นที่กรุงเทพมหานคร ปศ.พท.กทม.)", "กองสารวัตรและกักกัน (กสก.)", "กองงานพระราชดำริและกิจกรรมพิเศษ (กพก.)", "กองควบคุมอาหารและยาสัตว์ (อยส.)", "กองผลิตภัณฑ์ปศุสัตว์ (กผส.)", "กลุ่มพัฒนาวิชาการปศุสัตว์ (กวป.)"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "กรมพัฒนาที่ดิน",
    "level3": ["กลุ่มพัฒนาระบบบริหาร", "สำนักงานเลขานุการกรม", "กองการเจ้าหน้าที่", "สำนักวิศวกรรมเพื่อการพัฒนาที่ดิน", "กองแผนงาน", "สำนักเทคโนโลยีการสำรวจและทำแผนที่", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "กองวิจัยและพัฒนาการจัดการที่ดิน", "สำนักวิทยาศาสตร์เพื่อการพัฒนาที่ดิน", "กองสำรวจและวิจัยทรัพยากรดิน", "กองเทคโนโลยีชีวภาพทางดิน", "กองนโยบายและแผนการใช้ที่ดิน"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "กรมวิชาการเกษตร",
    "level3": ["สำนักงานเลขานุการกรม", "สำนักผู้เชี่ยวชาญ", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กองการเจ้าหน้าที่", "กองคลัง", "สำนักคุ้มครองพันธุ์พืช", "กองแผนงานและวิชาการ", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สถาบันวิจัยเกษตรวิศวกรรม", "สถาบันวิจัยพืชไร่และพืชทดแทนพลังงาน", "สถาบันวิจัยพืชสวน", "สำนักควบคุมพืชและวัสดุการเกษตร", "สำนักวิจัยพัฒนาการอารักขาพืช", "สำนักวิจัยพัฒนาเทคโนโลยีชีวภาพ", "กองวิจัยพัฒนาปัจจัยการผลิตทางการเกษตร", "สำนักวิจัยและพัฒนาการเกษตร เขตที่ 1", "สำนักวิจัยและพัฒนาการเกษตร เขตที่ 2", "สำนักวิจัยและพัฒนาการเกษตร เขตที่ 3", "สำนักวิจัยและพัฒนาการเกษตร เขตที่ 4", "สำนักวิจัยและพัฒนาการเกษตร เขตที่ 5", "สำนักวิจัยและพัฒนาการเกษตร เขตที่ 6", "สำนักวิจัยและพัฒนาการเกษตร เขตที่ 7", "สำนักวิจัยและพัฒนาการเกษตร เขตที่ 8", "กองวิจัยและพัฒนาวิทยาการหลังการเก็บเกี่ยวและแปรรูปผลิตผลเกษตร", "สำนักนิติการและสิทธิประโยชน์", "กองประสานงานโครงการอันเนื่องมาจากพระราชดำริ", "กองพัฒนาระบบและรับรองมาตรฐานสินค้าพืช", "กองการยาง", "กองวิจัยพัฒนาเมล็ดพันธุ์พืช"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "กรมส่งเสริมการเกษตร",
    "level3": ["กองแผนงาน", "กองส่งเสริมโครงการพระราชดำริ การจัดการพื้นที่และวิศวกรรมเกษตร", "กองวิจัยและพัฒนางานส่งเสริมการเกษตร", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักพัฒนาการถ่ายทอดเทคโนโลยี", "กองพัฒนาเกษตรกร", "กองส่งเสริมการอารักขาพืชและจัดการดินปุ๋ย", "สำนักส่งเสริมและจัดการสินค้าเกษตร", "กลุ่มพัฒนาระบบบริหาร", "กองส่งเสริมวิสาหกิจชุมชน", "กองขยายพันธุ์พืช"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "กรมส่งเสริมสหกรณ์",
    "level3": ["สำนักงานเลขานุการกรม", "กองการเจ้าหน้าที่", "กองคลัง", "กองแผนงาน", "กองพัฒนาระบบสนับสนุนการสหกรณ์", "กองพัฒนาสหกรณ์ด้านการเงินและร้านค้า", "กองพัฒนาสหกรณ์ภาคการเกษตรและกลุ่มเกษตรกร", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักงานส่งเสริมสหกรณ์กรุงเทพมหานคร พื้นที่ 1", "สำนักงานส่งเสริมสหกรณ์กรุงเทพมหานคร พื้นที่ 2", "สำนักพัฒนาและถ่ายทอดเทคโนโลยีการสหกรณ์", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ผู้ตรวจราชการกรม", "สำนักนายทะเบียนและกฎหมาย", "สถาบันพัฒนากรรมการและฝ่ายจัดการสหกรณ์", "สถาบันพัฒนาเครื่องจักรกลและพื้นที่สหกรณ์", "กองประสานงานโครงการพระราชดำริ", "สำนักงานติดตามงานนโยบายของรัฐมนตรีว่าการกระทรวงเกษตรและสหกรณ์(กรมส่งเสริมสหกรณ์)", "ศูนย์วิเคราะห์และติดตามสถานการณ์ทางการเงินสหกรณ์"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "สำนักงานปฏิรูปที่ดินเพื่อเกษตรกรรม",
    "level3": ["สำนักบริหารกลาง", "กลุ่มประชาสัมพันธ์และเผยแพร่", "กลุ่มยานพาหนะสถานที่และสื่อสาร", "กลุ่มศิลป์และนิทรรศการ", "กลุ่มพัฒนาระบบงานคลัง", "กลุ่มงบประมาณ", "กลุ่มการเงิน", "กลุ่มบัญชี", "กลุ่มบริหารงานพัสดุ", "กลุ่มตรวจสอบใบสำคัญ", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "ฝ่ายบริหารทั่วไป", "กลุ่มตรวจและประสานราชการ", "กองการเจ้าหน้าที่", "ศูนย์สารสนเทศ", "สำนักกฎหมาย", "สำนักจัดการปฎิรูปที่ดิน", "สำนักจัดการแผนที่และสารบบที่ดิน", "สำนักบริหารกองทุน", "สำนักพัฒนาพื้นที่ปฏิรูปที่ดิน", "สำนักพัฒนาและถ่ายทอดเทคโนโลยี", "สำนักวิชาการและแผน", "กองประสานงานโครงการพระราชดำริและโครงการพิเศษ", "ศูนย์พัฒนาและส่งเสริมศิลปาชีพ"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "สำนักงานมาตรฐานสินค้าเกษตรและอาหารแห่งชาติ",
    "level3": ["สำนักงานมาตรฐานสินค้าเกษตรอาหารแห่งชาติ (มกอช.)", "กลุ่มตรวจสอบภายใน (กตน.)", "กลุ่มพัฒนาระบบบริหาร (กพร.)", "สำนักงานเลขานุการกรม (สลก.)", "กองนโยบายมาตรฐานสินค้าเกษตรและอาหาร (กนม.)", "สำนักกำหนดมาตรฐาน (สกม.)", "กองรับรองมาตรฐาน (กรร.)", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร (ศทส.)", "กองส่งเสริมมาตรฐาน (กสม.)", "กองควบคุมมาตรฐาน (กคม.)", "กลุ่มยุทธศาสตร์และแผนงาน (กยผ.)"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "กรมการข้าว",
    "level3": ["สำนักบริหารกลาง", "กองตรวจสอบรับรองมาตรฐานข้าวและผลิตภัณฑ์", "กองพัฒนาผลิตภัณฑ์ข้าว", "กองเมล็ดพันธุ์ข้าว", "กองวิจัยและพัฒนาข้าว", "สำนักนโยบายและยุทธศาสตร์ข้าว", "สำนักส่งเสริมการผลิตข้าว", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "กองประสานงานโครงการพระราชดำริ", "สถาบันวิทยาศาสตร์ข้าวแห่งชาติ", "สำนักผู้เชี่ยวชาญ"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "กรมหม่อนไหม",
    "level3": ["สำนักพัฒนาและถ่ายทอดเทคโนโลยีหม่อนไหม กลุ่มส่งเสริมเกษตรกรและเครือข่าย", "สำนักพัฒนาและถ่ายทอดเทคโนโลยีหม่อนไหม กลุ่มโครงการพระราชดำริและโครงการพิเศษ", "กองแผนงานกลุ่มยุทธศาสตร์และแผนงาน"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "กรมฝนหลวงและการบินเกษตร",
    "level3": ["", "สำนักงานเลขานุการกรม", "กองบริหารการบินเกษตร", "กองปฏิบัติการฝนหลวง", "กองวิจัยและพัฒนาเทคโนโลยีฝนหลวง", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "กองแผนงาน", "กองประสานงานโครงการอันเนื่องมาจากพระราชดำริ", "กองพัสดุ"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "สำนักงานเศรษฐกิจการเกษตร",
    "level3": ["สำนักงานเศรษฐกิจการเกษตร", "กลุ่มพัฒนาระบบบริหาร", "สำนักงานเลขานุการกรม,ฝ่ายการเจ้าหน้าที่,ฝ่ายแผนงาน,ฝ่ายสารบรรณ,ฝ่ายประชาสัมพันธ์, กลุ่มพัฒนาบุคคล", "ศูนย์ประเมินผล", "ศูนย์สารสนเทศการเกษตร", "กองนโยบายและแผนพัฒนาการเกษตร", "สำนักวิจัยเศรษฐกิจการเกษตร", "สศท.1", "สศท.2", "สศท.3", "สศท.4", "สศท.5", "สศท.6", "สศท.7", "สศท.8", "สศท.9", "กองเศรษฐกิจการเกษตรระหว่างประเทศ", "สศท.10", "ศูนย์ปฏิบัติการเศรษฐกิจการเกษตร", "สศท.11", "สศท.12"]
}, {
    "level1": "กระทรวงพาณิชย์",
    "level2": "สำนักงานปลัดกระทรวงพาณิชย์",
    "level3": ["สำนักงานรัฐมนตรี", "กองกลาง", "กองบริหารทรัพยากรบุคคล", "กองบริหารหารการคลัง", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สถาบันกรมพระจันทบุรีนฤนาถ", "กองยุทธศาสตร์และแผนงาน", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มกฎหมาย", "ศูนย์ปฏิบัติการต่อต้านการทุจริตคอรัปชั่น", "กองตรวจราชการ", "กองบริหารการพาณิชย์ภูมิภาค", "สำนักงานพาณิชย์ในต่างประเทศ ณ กรุงบรัสเซลส์", "สำนักงานพาณิชย์ในต่างประเทศ ณ กรุงปักกิ่ง", "คณะผู้แทนถาวรไทยประจำองค์การการค้าโลกและองค์การทรัพย์สินทางปัญญาโลก (คผท.)", "สำนักงานพาณิชย์ในต่างประเทศ ณ กรุงวอชิงตัน"]
}, {
    "level1": "กระทรวงพาณิชย์",
    "level2": "กรมการค้าต่างประเทศ",
    "level3": ["สำนักงานเลขานุการกรม", "กองกฎหมาย", "กองคลัง", "กองความร่วมมือการค้าและการลงทุน", "กองบริหารการค้าข้าว", "กองบริหารการค้าสินค้าทั่วไป", "กองบริหารการนำเข้าและรับรองถิ่นกำเนิด", "กองบริหารสินค้าข้อตกลงและมาตรการการค้า", "กองปกป้องและตอบโต้ทางการค้า", "กองมาตรฐานสินค้านำเข้าส่งออก", "กองสิทธิประโยชน์ทางการค้า", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักบริการการค้าต่างประเทศ", "กลุ่มตรวจสอบภายใน", "สำนักบริหารนโยบายและยุทธศาสตร์การค้า", "สถาบันส่งเสริมสินค้าเกษตรนวัตกรรม"]
}, {
    "level1": "กระทรวงพาณิชย์",
    "level2": "กรมการค้าภายใน",
    "level3": ["สำนักงานเลขานุการกรม", "กองนิติการ", "กองส่งเสริมการค้าสินค้าเกษตร 1", "กองส่งเสริมการค้าสินค้าเกษตร 2", "กองส่งเสริมและบริหารระบบตลาด", "สำนักจัดระบบราคาและปริมาณสินค้า", "สำนักชั่งตวงวัด", "สำนักตรวจสอบและปฏิบัติการ", "สำนักสารสนเทศและแผนงานการค้าในประเทศ", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "สำนักกำกับและตรวจสอบเครื่องชั่ง", "สำนักจัดระบบและพัฒนามาตรฐานทางการค้า", "ศูนย์เทคโนโลยีสารสนเทศ", "ศูนย์ชั่งตวงวัดภาค/สำนักงานสาขาชั่งตวงวัด"]
}, {
    "level1": "กระทรวงพาณิชย์",
    "level2": "กรมเจรจาการค้าระหว่างประเทศ",
    "level3": ["สำนักบริหารกลาง", "สำนักการค้าสินค้า", "สำนักการค้าบริการและการลงทุน", "สำนักเอเชีย แอฟริกาและตะวันออกกลาง", "ศูนย์สารสนเทศการเจรจาการค้าระหว่างประเทศ", "สำนักประชาคมเศรษฐกิจอาเซียน", "สำนักพัฒนาความพร้อมทางการค้า", "สำนักอเมริกา แปซิฟิกและองค์การระหว่างประเทศ", "สำนักยุโรป", "กลุ่มตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงพาณิชย์",
    "level2": "กรมทรัพย์สินทางปัญญา",
    "level3": ["สำนักบริหารกลาง", "สำนักกฎหมาย", "สำนักส่งเสริมการพัฒนาทรัพย์สินทางปัญญา", "สำนักเครื่องหมายการค้า", "สำนักลิขสิทธิ์", "กองสิทธิบัตร", "สำนักป้องปรามการละเมิดทรัพย์สินทางปัญญา", "สำนักบริหารจัดการทรัพย์สินทางปัญญา", "กองสิทธิบัตรออกแบบ"]
}, {
    "level1": "กระทรวงพาณิชย์",
    "level2": "กรมพัฒนาธุรกิจการค้า",
    "level3": ["สำนักงานเลขานุการกรม", "กองคลัง", "สำนักกฎหมาย", "กองทะเบียนธุรกิจ", "กองข้อมูลธุรกิจ", "กองส่งเสริมและพัฒนาธุรกิจ", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "กองบริหารการประกอบธุรกิจของชาวต่างชาติ", "กองธรรมาภิบาลธุรกิจ", "กองธุรกิจภูมิภาคและชุมชน", "กองธุรกิจบริการ", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "กองพาณิชย์อิเล็กทรอนิกส์", "กองทะเบียนบริษัทมหาชนและธุรกิจพิเศษ", "กองพัฒนาระบบงานสารสนเทศ", "กองกำกับบัญชีธุรกิจ", "กองทะเบียนหลักประกันทางธุรกิจ"]
}, {
    "level1": "กระทรวงพาณิชย์",
    "level2": "กรมส่งเสริมการค้าระหว่างประเทศ",
    "level3": ["สำนักบริหารกลาง", "สถาบันพัฒนาผู้ประกอบการค้ายุคใหม่", "สำนักยุทธศาสตร์การค้าระหว่างประเทศ", "สำนักประชาสัมพันธ์และสื่อสารองค์กร", "สำนักส่งเสริมการค้าสินค้าไลฟ์สไตล์", "สำนักส่งเสริมการค้าสินค้าเกษตรและอุตสาหกรรม", "สำนักพัฒนาและส่งเสริมธุรกิจบริการ", "สำนักส่งเสริมนวัตกรรมและสร้างมูลค่าเพิ่มเพื่อการค้า", "สำนักพัฒนาตลาดและธุรกิจไทยในต่างประเทศ 1", "สำนักพัฒนาตลาดและธุรกิจไทยในต่างประเทศ 2", "สำนักสารสนเทศและการบริการการค้าระหว่างประเทศ", "สำนักตลาดพาณิชย์ดิจิทัล", "กลุ่มตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงพาณิชย์",
    "level2": "สำนักงานนโยบายและยุทธศาสตร์การค้า",
    "level3": ["สำนักงานเลขานุการกรม", "กองนโยบายและยุทธศาสตร์การค้าสินค้าเกษตร", "กองนโยบายและยุทธศาสตร์การค้าสินค้าอุตสาหกรรมและธุรกิจบริการ", "กองยุทธศาสตร์การพัฒนาความสามารถทางการแข่งขัน", "กองสารสนเทศและดัชนีเศรษฐกิจการค้า", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร"]
}, {
    "level1": "กระทรวงกลาโหม",
    "level2": "สำนักงานปลัดกระทรวงกลาโหม",
    "level3": ["สำนักงานปลัดกระทรวงกลาโหม", "กรมเสมียนตรา", "กรมพระธรรมนูญ", "กรมการเงินกลาโหม", "กรมการพลังงานทหาร ศูนย์การอุตสาหกรรมป้องกันประเทศและพลังงานทหาร", "กรมการอุตสาหกรรมทหาร ศูนย์การอุตสาหกรรมป้องกันประเทศและพลังงานทหาร", "สำนักนโยบายและแผนกลาโหม", "สำนักงบประมาณกลาโหม", "สำนักปลัดกระทรวงกลาโหม", "สำนักเลขานุการสำนักงานปลัดกระทรวงกลาโหม", "สำนักงานตรวจสอบภายในกลาโหม", "สำนักโยธาธิการ สำนักงานสนับสนุนสำนักงานปลัดกระทรวงกลาโหม", "ศูนย์การอุตสาหกรรมป้องกันประเทศและพลังงานทหาร", "กรมวิทยาศาสตร์และเทคโนโลยีกลาโหม", "โรงงานเภสัชกรรมทหาร ศูนย์การอุตสาหกรรมป้องกันประเทศและพลังงานทหาร", "กรมเทคโนโลยีสารสนเทศและอวกาศกลาโหม", "ศูนย์อำนวยการสร้างอาวุธ ศูนย์การอุตสาหกรรมป้องกันประเทศและพลังงานทหาร", "สำนักงานแพทย์ สำนักงานสนับสนุนสำนักงานปลัดกระทรวงกลาโหม", "กรมการสรรพกำลังกลาโหม", "สำนักงานสนับสนุน สำนักงานปลัดกระทรวงกลาโหม", "ศูนย์วิจัยพัฒนาการทหาร กรมวิทยาศาสตร์และเทคโนโลยีกลาโหม"]
}, {
    "level1": "กระทรวงกลาโหม",
    "level2": "กองบัญชาการกองทัพไทย",
    "level3": ["กองบัญชาการกองทัพไทย", "สำนักผู้บัญชาการทหารสูงสุด", "ศูนย์ไซเบอร์ทหาร", "สำนักกองบัญชาการ กองบัญชาการกองทัพไทย", "สำนักงานเลขานุการ กองบัญชาการกองทัพไทย", "สำนักงานจเรทหาร", "สำนักงานตรวจสอบภายในทหาร", "สำนักงานพระธรรมนูญทหาร", "สำนักสวัสดิการทหาร", "สำนักยุทธโยธาทหาร", "ศูนย์ประสานงานโครงการอันเนื่องมาจากพระราชดำริและความมั่นคง", "กรมกำลังพล", "กรมข่าวทหาร", "กรมยุทธการทหาร", "กรมส่งกำลังบำรุงทหาร", "กรมกิจการพลเรือน", "กรมการสื่อสารทหาร", "สำนักงานปลัดบัญชีทหาร", "หน่วยบัญชาการทหารพัฒนา", "กรมสารบรรณทหาร", "กรมการเงินทหาร", "กรมแผนที่ทหาร", "กรมยุทธบริการทหาร", "กรมกิจการชายแดนทหาร", "สถาบันวิชาการป้องกันประเทศ", "กองบัญชาการ สถาบันวิชาการป้องกันประเทศ", "วิทยาลัยป้องกันราชอาณาจักร สถาบันวิชาการป้องกันประเทศ", "วิทยาลัยเสนาธิการทหาร สถาบันวิชาการป้องกันประเทศ", "สถาบันจิตวิทยาความมั่นคง  สถาบันวิชาการป้องกันประเทศ", "ศูนย์ศึกษายุทธศาสตร์ สถาบันวิชาการป้องกันประเทศ", "โรงเรียนเตรียมทหาร สถาบันวิชาการป้องกันประเทศ", "โรงเรียนช่างฝีมือทหาร สถาบันวิชาการป้องกันประเทศ"]
}, {
    "level1": "กระทรวงกลาโหม",
    "level2": "กองทัพบก",
    "level3": ["สำนักงานเลขานุการกองทัพ", "กรมกำลังพลทหารบก", "กรมข่าวทหารบก", "กรมยุทธการทหารบก", "กรมส่งกำลังบำรุงทหารบก", "กรมกิจการพลเรือนทหารบก", "สำนักงานปลัดบัญชีกองทัพบก", "ศูนย์ปฏิบัติการกองทัพบก", "กรมสารบรรณทหารบก", "กรมการเงินทหารบก", "การจเรทหารบก", "กรมสารวัตรทหารบก", "กรมสวัสดิการทหารบก", "สำนักงานตรวจสอบภายในกองทัพบก", "สำนักงานวิจัยและพัฒนาการทหารกองทัพบก", "หน่วยข่าวกรองทางทหาร", "ส่วนสนับสนุนกองบัญชาการกองทัพบก", "ศูนย์ไซเบอร์กองทัพบก", "สำนักงานพระธรรมนูญทหารบก", "กรมการทหารช่าง", "กรมการทหารสื่อสาร", "การสรรพาวุธทหารบก", "กรมการขนส่งทหารบก", "กรมพลาธิการทหารบก", "กรมแพทย์ทหารบก", "กรมยุทธโยธทหารบก", "กรมการสัตว์ทหารบก", "การวิทยาศาสตร์ทหารบก", "หน่วยบัญชาการรักษาดินแดน", "ศูนยการบินทหารบก", "กองทัพภาคที่ 1", "กองทัพภาคที่ 2", "กองทัพภาคที่ 3", "กองทัพภาคที่ 4", "หน่วยบัญชาการสงครามพิเศษ", "กองพลทหารม้าที่ 2 รักษาพระองค์", "กองพลทหารปืนใหญ่", "หน่วยบัญชาการป้องกันภัยทางอากาศกองทัพบก", "กองพลทหารราบที่ 11", "กองพลทหารราบที่ 15"]
}, {
    "level1": "กระทรวงกลาโหม",
    "level2": "กองทัพเรือ",
    "level3": ["กองทัพเรือ", "สำนักงานเลขานุการกองทัพเรือ", "กรมสารบรรณทหารเรือ", "กรมกำลังพลทหารเรือ", "กรมข่าวทหารเรือ", "กรมยุทธการทหารเรือ", "กรมส่งกำลังบำรุงทหารเรือ", "กรมการสื่อสารและเทคโนโลยีสารสนเทศทหารเรือ", "กรมกิจการพลเรือนทหารเรือ", "สำนักงานปลัดบัญชีทหารเรือ", "กรมการเงินทหารเรือ", "กรมจเรทหารเรือ", "สำนักงานตรวจสอบภายในทหารเรือ", "สำนักงานจัดหายุทโธปกรณ์ทหารเรือ", "สำนักงานพระธรรมนูญทหารเรือ", "กองเรือยุทธการ", "ทัพเรือภาคที่ 1", "ทัพเรือภาคที่ 2", "ทัพเรือภาคที่ 3", "หน่วยบัญชาการนาวิกโยธิน", "หน่วยบัญชาการต่อสู้อากาศยานและชายฝั่ง", "ฐานทัพเรือสัตหีบ", "ฐานทัพเรือกรุงเทพ", "กรมสารวัตรทหารเรือ", "กรมอู่ทหารเรือ", "กรมอิเล็กทรอนิกส์ทหารเรือ", "กรมช่างโยธาทหารเรือ", "กรมสรรพาวุธทหารเรือ", "กรมพลาธิการทหารเรือ", "กรมแพทย์ทหารเรือ", "กรมขนส่งทหารเรือ", "กรมอุทกศาสตร์", "กรมสวัสดิการทหารเรือ", "กรมวิทยาศาสตร์ทหารเรือ", "กรมยุทธศึกษาทหารเรือ", "โรงเรียนนายเรือ", "สำนักงานวิจัยและพัฒนาการทางทหารกองทัพเรือ", "ศูนย์ปฏิบัติการกองทัพเรือ", "กองบัญชาการป้องกันชายแดนจันทบุรีและตราด", "หน่วยเฉพาะกิจนาวิกโยธินกองทัพเรือ", "หน่วยเฉพาะกิจนาวิกโยธินภาคใต้", "หน่วยเรือรักษาความสงบเรียบร้อยตามลำแม่น้ำโขง", "สำนักงานเจ้าหน้าที่ประสานงานกับคณะที่ปรึกษาการช่วยเหลือทางทหารของสหรัฐอเมริกาฝ่ายทหารเรือ", "คณะเลขานุการพิจารณาจัดหาเรือ", "สำนักงานทหารเรือหญิง", "คณะกรรมการบริหารวิทยุกระจายเสียงทหารเรือ", "คณะกรรมการอำนวยการสร้างอู่ซ่อมเรือที่สัตหีบ", "คณะกรรมการประวัติศาสตร์กองทัพเรือ", "คณะกรรมการพัฒนาการฝึกอาชีพให้แก่ทหารกองประจำการก่อนปลดเป็นกองหนุนของกองทัพเรือ", "ศูนย์ประสานงานประมงชายแดนทางทะเลไทย – พม่า", "ศูนย์อำนวยการพลังแผ่นดินเอาชนะยาเสพติดกองทัพเรือ", "ศูนย์ประสานราชการใสสะอาด ทร.", "ศูนย์ประสานการจัดสวัสดิการภายในกองทัพเรือ", "ศูนย์ประสานการปฏิบัติในการรักษาผลประโยชน์ของชาติทางทะเล"]
}, {
    "level1": "กระทรวงกลาโหม",
    "level2": "กองทัพอากาศ",
    "level3": ["กองทัพอากาศ", "กองบัญชาการกองทัพอากาศ", "สำนักงานเลขานุการกองทัพอากาศ", "กรมสารบรรณทหารอากาศ", "กรมกำลังพลทหารอากาศ", "กรมข่าวทหารอากาศ", "กรมยุทธการทหารอากาศ", "กรมส่งกำลังบำรุงทหารอากาศ", "กรมกิจการพลเรือนทหารอากาศ", "กรมเทคโนโลยีสารสนเทศและการสื่อสารทหารอากาศ", "สำนักงานปลัดบัญชีทหารอากาศ", "กรมการเงินทหารอากาศ", "กรมจเรทหารอากาศ", "สำนักงานตรวจสอบภายในทหารอากาศ", "สำนักงานนิรภัยทหารอากาศ", "สำนักงานพระธรรมนูญทหารอากาศ", "กองบิน 1", "กองบิน 2", "กองบิน 4", "กองบิน 5", "กองบิน 6", "กองบิน 7", "กองบิน 21", "กองบิน 23", "กองบิน 41", "กองบิน 46", "กองบิน 56", "โรงเรียนการบิน", "กรมควบคุมปฏิบัติการทางอากาศ", "หน่วยบัญชาการอากาศโยธิน", "กรมช่างอากาศ", "กรมสื่อสารอิเล็กทรอนิกส์ทหารอากาศ", "กรมสรรพภาวุธทหารอากาศ", "กรมแพทย์ทหารอากาศ", "กรมพลาธิการทหารอากาศ", "กรมช่างโยธาทหารอากาศ", "กรมขนส่งทหารอากาศ", "กรมยุทธศึกษาทหารอากาศ", "โรงเรียนนายเรืออากาศนวมินทกษัตริยาธิราช", "กรมสวัสดิการทหารอากาศ", "ศูนย์วิจัยพัฒนาวิทยาศาสตร์เทคโนโลยีการบินและอวกาศกองทัพอากาศ", "สถาบันเวชศาสตร์การบินกองทัพอากาศ", "สำนักงานผู้บังคับทหารอากาศดอนเมือง", "ศูนย์ปฏิบัติการกองทัพอากาศ", "ศูนย์บรรเทาสาธารณภัยกองทัพอากาศ", "ศูนย์ปฏิบัติการต่อสู้เพื่อเอาชนะยาเสพติดกองทัพอากาศ", "สำนักงานตรวจติดตามการปฏิบัติราชการกองทัพอากาศ", "ศูนย์สนับสนุนการถวายบิน 904", "สำนักงานคลังสมองกองทัพอากาศ", "สำนักงานอาเซียนกองทัพอากาศ"]
}, {
    "level1": "กระทรวงกลาโหม",
    "level2": "กองทัพไทย",
    "level3": ["กองทัพไทย"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สำนักงานรัฐมนตรี",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สำนักงานปลัดกระทรวงศึกษาธิการ",
    "level3": ["สำนักอำนวยการ", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สถาบันพัฒนาครู คณาจารย์ และบุคลากรทางการศึกษา", "สำนักการลูกเสือ ยุวกาชาด และกิจการนักเรียน", "สำนักความสัมพันธ์ต่างประเทศ", "สำนักงานคณะกรรมการข้าราชการครูและบุคลากรทางการศึกษา", "สำนักตรวจราชการและติดตามประเมินผล", "สำนักนโยบายและยุทธศาสตร์", "สำนักนิติการ", "สำนักงานศึกษาธิการจังหวัดยโสธร", "สำนักงานส่งเสริมการศึกษานอกระบบและการศึกษาตามอัธยาศัย", "สำนักงานศึกษาธิการจังหวัดยะลา", "สำนักงานศึกษาธิการจังหวัดร้อยเอ็ด", "สำนักงานศึกษาธิการจังหวัดระนอง", "สำนักงานศึกษาธิการจังหวัดระยอง", "สำนักงานศึกษาธิการจังหวัดราชบุรี", "สำนักงานศึกษาธิการจังหวัดลพบุรี", "สำนักงานศึกษาธิการจังหวัดลำปาง", "สำนักงานศึกษาธิการจังหวัดลำพูน", "สำนักงานศึกษาธิการจังหวัดเลย", "สำนักงานศึกษาธิการจังหวัดศรีสะเกษ", "สำนักงานคณะกรรมการส่งเสริมการศึกษาเอกชน", "สำนักงานศึกษาธิการจังหวัดสกลนคร", "สำนักงานศึกษาธิการจังหวัดสงขลา", "สำนักงานศึกษาธิการจังหวัดสตูล", "สำนักงานศึกษาธิการจังหวัดสมุทรปราการ", "สำนักงานศึกษาธิการจังหวัดสมุทรสงคราม", "สำนักงานศึกษาธิการจังหวัดสมุทรสาคร", "สำนักงานศึกษาธิการจังหวัดสระแก้ว", "สำนักงานศึกษาธิการจังหวัดสระบุรี", "สำนักงานศึกษาธิการจังหวัดสิงห์บุรี", "สำนักงานศึกษาธิการจังหวัดสุโขทัย", "กลุ่มพัฒนาระบบบริหาร", "สำนักงานศึกษาธิการจังหวัดสุพรรณบุรี", "สำนักงานศึกษาธิการจังหวัดสุราษฎร์ธานี", "สำนักงานศึกษาธิการจังหวัดสุรินทร์", "สำนักงานศึกษาธิการจังหวัดหนองคาย", "สำนักงานศึกษาธิการจังหวัดบึงกาฬ", "สำนักงานศึกษาธิการจังหวัดหนองบัวลำภู", "สำนักงานศึกษาธิการจังหวัดอ่างทอง", "สำนักงานศึกษาธิการจังหวัดอำนาจเจริญ", "สำนักงานศึกษาธิการจังหวัดอุดรธานี", "สำนักงานศึกษาธิการจังหวัดอุตรดิตถ์", "กลุ่มตรวจสอบภายใน", "สำนักงานศึกษาธิการจังหวัดอุทัยธานี", "สำนักงานศึกษาธิการจังหวัดอุบลราชธานี", "สำนักบูรณาการการศึกษา", "สำนักงานประสานงานคณะรัฐมนตรีและหน่วยงานของรัฐสภา กระทรวงศึกษาธิการ", "สำนักประสานงานและบูรณาการการศึกษาจังหวัดชายแดนภาคใต้", "สำนักงานเลขานุการกองทุนพัฒนาเทคโนโลยีเพื่อการศึกษา", "สำนักส่งเสริมกิจการการศึกษา", "ศูนย์ปฏิบัติการต่อต้านการทุจริต กระทรวงศึกษาธิการ", "ศูนย์ประสานงานและบริหารการศึกษาจังหวัดชายแดนภาคใต้", "สำนักงานศึกษาธิการภาค 1 (จังหวัดปทุมธานี)", "สำนักงานศึกษาธิการภาค 2 (จังหวัดลพบุรี)", "สำนักงานศึกษาธิการภาค 3 (จังหวัดฉะเชิงเทรา)", "สำนักงานศึกษาธิการภาค 4 (จังหวัดราชบุรี)", "สำนักงานศึกษาธิการภาค 5 (จังหวัดสมุทรสงคราม)", "สำนักงานศึกษาธิการภาค 6 (จังหวัดนครศรีธรรมราช)", "สำนักงานศึกษาธิการภาค 7 (จังหวัดภูเก็ต)", "สำนักงานศึกษาธิการภาค 8 (จังหวัดยะลา)", "สำนักงานศึกษาธิการภาค 9 (จังหวัดชลบุรี)", "สำนักงานศึกษาธิการภาค 10 (จังหวัดอุดรธานี)", "สำนักงานศึกษาธิการภาค 11 (จังหวัดสกลนคร)", "สำนักงานศึกษาธิการภาค 12 (จังหวัดขอนแก่น)", "สำนักงานศึกษาธิการภาค 13 (จังหวัดอุบลราชธานี)", "สำนักงานศึกษาธิการภาค 14 (จังหวัดนครราชสีมา)", "สำนักงานศึกษาธิการภาค 15 (จังหวัดเชียงใหม่)", "สำนักงานศึกษาธิการภาค 16 (จังหวัดเชียงราย)", "สำนักงานศึกษาธิการภาค 17 (จังหวัดพิษณุโลก)", "สำนักงานศึกษาธิการภาค 18 (จังหวัดนครสวรรค์)", "สำนักงานศึกษาธิการจังหวัดกระบี่", "สำนักงานศึกษาธิการกรุงเทพมหานคร", "สำนักงานศึกษาธิการจังหวัดกาญจนบุรี", "สำนักงานศึกษาธิการจังหวัดกาฬสินธุ์", "สำนักงานศึกษาธิการจังหวัดกำแพงเพชร", "สำนักงานศึกษาธิการจังหวัดขอนแก่น", "สำนักงานศึกษาธิการจังหวัดจันทบุรี", "สำนักงานศึกษาธิการจังหวัดฉะเชิงเทรา", "สำนักงานศึกษาธิการจังหวัดชลบุรี", "สำนักงานศึกษาธิการจังหวัดชัยนาท", "สำนักงานศึกษาธิการจังหวัดชัยภูมิ", "สำนักงานศึกษาธิการจังหวัดชุมพร", "สำนักงานศึกษาธิการจังหวัดเชียงราย", "สำนักงานศึกษาธิการจังหวัดเชียงใหม่", "สำนักงานศึกษาธิการจังหวัดตรัง", "สำนักงานศึกษาธิการจังหวัดตราด", "สำนักงานศึกษาธิการจังหวัดตาก", "สำนักงานศึกษาธิการจังหวัดนครนายก", "สำนักงานศึกษาธิการจังหวัดนครปฐม", "สำนักงานศึกษาธิการจังหวัดนครพนม", "สำนักงานศึกษาธิการจังหวัดนครราชสีมา", "สำนักงานศึกษาธิการจังหวัดนครศรีธรรมราช", "สำนักงานศึกษาธิการจังหวัดนครสวรรค์", "สำนักงานศึกษาธิการจังหวัดนนทบุรี", "สำนักงานศึกษาธิการจังหวัดนราธิวาส", "สำนักงานศึกษาธิการจังหวัดน่าน", "สำนักงานศึกษาธิการจังหวัดบุรีรัมย์", "สำนักงานศึกษาธิการจังหวัดปทุมธานี", "สำนักงานศึกษาธิการจังหวัดประจวบคีรีขันธ์", "สำนักงานศึกษาธิการจังหวัดปราจีนบุรี", "สำนักงานศึกษาธิการจังหวัดปัตตานี", "สำนักงานศึกษาธิการจังหวัดพระนครศรีอยุธยา", "สำนักงานศึกษาธิการจังหวัดพะเยา", "สำนักงานศึกษาธิการจังหวัดพังงา", "สำนักงานศึกษาธิการจังหวัดพัทลุง", "สำนักงานศึกษาธิการจังหวัดพิจิตร", "สำนักงานศึกษาธิการจังหวัดพิษณุโลก", "สำนักงานศึกษาธิการจังหวัดเพชรบุรี", "สำนักงานศึกษาธิการจังหวัดเพชรบูรณ์", "สำนักงานศึกษาธิการจังหวัดแพร่", "สำนักงานศึกษาธิการจังหวัดภูเก็ต", "สำนักงานศึกษาธิการจังหวัดมหาสารคาม", "สำนักงานศึกษาธิการจังหวัดมุกดาหาร", "สำนักงานศึกษาธิการจังหวัดแม่ฮ่องสอน", "กลุ่ม ป.ย.ป. กระทรวงศึกษาธิการ"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สำนักงานเลขาธิการสภาการศึกษา",
    "level3": ["สำนักอำนวยการ", "สำนักนโยบายและแผนการศึกษา", "สำนักประเมินผลการจัดการศึกษา", "สำนักพัฒนากฎหมายการศึกษา", "สำนักมาตรฐานการศึกษาและพัฒนาการเรียนรู้", "สำนักวิจัยและพัฒนาการศึกษา", "กลุ่มพัฒนาระบบริหาร", "กลุ่มตรวจสอบภายใน", "สำนักนโยบายความร่วมมือกับต่างประเทศ", "สำนักสื่อสารองค์กร", "สำนักงานเลขานุการคณะกรรมการอิสระเพื่อการปฏิรูปการศึกษา"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน",
    "level3": ["สำนักอำนวยการ", "สำนักการคลังและสินทรัพย์", "สำนักติดตามและประเมินผลการจัดการศึกษาขั้นพื้นฐาน", "สำนักทดสอบทางการศึกษา", "สำนักเทคโนโลยีเพื่อการเรียนการสอน", "สำนักนโยบายและแผนการศึกษาขั้นพื้นฐาน", "สำนักบริหารงานการศึกษาพิเศษ", "สำนักพัฒนานวัตกรรมการจัดการศึกษา", "สำนักพัฒนาระบบบริหารงานบุคคลและนิติการ", "สำนักวิชาการและมาตรฐานการศึกษา", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "สำนักพัฒนากิจกรรมนักเรียน", "สำนักพัฒนาครูและบุคลากรทางการศึกษาขั้นพื้นฐาน", "สำนักพัฒนาการศึกษาเขตพัฒนาพิเศษเฉพาะกิจจังหวัดชายแดนภาคใต้", "สำนักบริหารงานการมัธยมศึกษาตอนปลาย", "สำนักบริหารงานการศึกษาภาคบังคับ", "หน่วยศึกษานิเทศก์", "ศูนย์เฉพาะกิจคุ้มครองและช่วยเหลือเด็กนักเรียน", "ศูนย์พัฒนาโรงเรียนวิทยาศาสตร์", "ศูนย์พัฒนาคุณภาพการศึกษาด้วยเทคโนโลยีทางไกล", "ศูนย์ประสานงานโครงการอันเนื่องมาจากพระราชดำริ"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สำนักงานคณะกรรมการการอุดมศึกษา (สกอ.)",
    "level3": ["สำนักอำนวยการ", "สำนักนโยบายและแผนการอุดมศึกษา", "สำนักประสานและส่งเสริมกิจการอุดมศึกษา", "สำนักมาตรฐานและคุณภาพอุดมศึกษา", "สำนักยุทธศาสตร์อุดมศึกษาต่างประเทศ", "สำนักส่งเสริมและพัฒนาศักยภาพนักศึกษา", "สำนักส่งเสริมและพัฒนาสมรรถนะบุคลากร", "กลุ่มพัฒนาระบบบริหาร", "หน่วยตรวจสอบภายใน", "สำนักงานบริหารเทคโนโลยีสารสนเทศเพื่อพัฒนาการศึกษา", "สำนักงานบริหารโครงการมหาวิทยาลัยไซเบอร์ไทย", "สำนักติดตามและประเมินผลอุดมศึกษา", "สำนักนิติการ", "สำนักพัฒนาบัณฑิตศึกษาและวิจัยด้านวิทยาศาสตร์และเทคโนโลยี", "วิทยาลัยเทคโนโลยีจิตรลดา", "สถาบันวิจัยจุฬาภรณ์", "สถาบันเทคโนโลยีแห่งเอเชีย", "สถาบันคลังสมองของชาติ"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สำนักงานคณะกรรมการการอาชีวศึกษา",
    "level3": ["สำนักอำนวยการ", "สำนักความร่วมมือ", "สำนักนโยบายและแผนการอาชีวศึกษา", "สำนักพัฒนาสมรรถนะครูและบุคลากรอาชีวศึกษา", "สำนักมาตรฐานการอาชีวศึกษาและวิชาชีพ", "สำนักวิจัยและพัฒนาการอาชีวศึกษา", "ศูนย์พัฒนาการศึกษาเขตพัฒนาพิเศษเฉพาะกิจ จังหวัดชายแดนภาคใต้", "ศูนย์พัฒนา ส่งเสริม ประสานงานกิจการ นักศึกษาและกิจการพิเศษ", "ศูนย์เทคโนโลยีสารสนเทศและกำลังคนอาชีวศึกษา", "หน่วยศึกษานิเทศก์", "ศูนย์ประสานงานสถาบันการอาชีวศึกษา", "ศูนย์อาชีวศึกษาทวิภาคี", "สำนักบริหารการอาชีวศึกษาเอกชน"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สำนักงานเลขาธิการคุรุสภา",
    "level3": ["สำนักงานเลขาธิการคุรุสภา", "สำนักมาตรฐานวิชาชีพ", "สำนักทะเบียนใบอนุญาตประกอบวิชาชีพ", "สำนักจรรยาบรรณวิชาชีพและนิติการ", "สำนักพัฒนาและส่งเสริมวิชาชีพ", "สำนักนโยบายและแผน"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สำนักงานลูกเสือแห่งชาติ",
    "level3": ["สำนักงานลูกเสือแห่งชาติ"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สถาบันส่งเสริมการสอนวิทยาศาสตร์และเทคโนโลยี",
    "level3": ["ฝ่ายยุทธศาสตร์แผนและประกันคุณภาพ", "กลุ่มงานยุทธศาสตร์", "กลุ่มงานงบประมาณ", "กลุ่มงานแผน", "กลุ่มงานติดตาม"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "กองทุนสงเคราะห์ กระทรวงศึกษาธิการ",
    "level3": [""]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "สำนักงานรัฐมนตรี กระทรวงการคลัง",
    "level3": ["สำนักงานรัฐมนตรี", "ฝ่ายบริหารงานทั่วไป", "กลุ่มงานประสานการเมือง", "กลุ่มงานสนับสนุนวิชาการ"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "สำนักงานปลัดกระทรวงการคลัง",
    "level3": ["สำนักบริหารกลาง", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักตรวจสอบและประเมินผล", "สำนักนโยบายและยุทธศาสตร์", "สำนักบริหารทรัพยากรบุคคล", "กลุ่มกฎหมาย", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มสารนิเทศการคลัง", "ศูนย์ปฏิบัติการต่อต้านการทุจริต"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "กรมธนารักษ์",
    "level3": ["สำนักงานเลขานุการกรม", "กองเทคโนโลยีการสำรวจและฐานข้อมูลที่ราชพัสดุ", "กองบริหารจัดการกรรมสิทธิ์ที่ราชพัสดุ", "กองบริหารทรัพยากรบุคคล", "กองบริหารที่ราชพัสดุภูมิภาค", "กองแผนงาน", "ศูนย์เทคโนโลยีสารสนเทศ", "สำนักกฎหมาย", "สำนักกษาปณ์", "สำนักการคลัง", "สำนักงานธนารักษ์พื้นที่", "สำนักทรัพย์สินมีค่าของแผ่นดิน", "สำนักบริหารเงินตรา", "สำนักบริหารที่ราชพัสดุกรุงเทพมหานคร", "สำนักประเมินราคาทรัพย์สิน", "สำนักพัฒนาธุรกิจและศักยภาพที่ราชพัสดุ", "สำนักพัฒนาและบำรุงรักษาอาคารที่ราชพัสดุ", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มงานตรวจราชการ"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "กรมบัญชีกลาง",
    "level3": ["สำนักงานเลขานุการกรม", "กองกฏหมาย", "กองการเงินการคลังภาครัฐ", "กองการเจ้าหน้าที่", "กองการพัสดุภาครัฐ", "กองกำกับและพัฒนาระบบเงินนอกงบประมาณ", "กองคดี", "กองค่าตอบแทนและประโยชน์เกื้อกูล", "กองตรวจสอบภาครัฐ", "กองบัญชีภาครัฐ", "กองบริหารการเบิกจ่ายเงินเดือน ค่าจ้าง บำเหน็จบำนาญ", "กองบริหารการรับ - จ่ายเงินภาครัฐ", "กองแผนงาน", "กองระบบการคลังภาครัฐ", "กองละเมิดและแพ่ง", "กองสวัสดิการรักษาพยาบาล", "ศูนย์เทคโนโลยีสารสนเทศ", "สถาบันพัฒนาบุคลากรด้านการคลังและบัญชีภาครัฐ", "กลุ่มนโยบายการจัดซื้อโดยรัฐระหว่างประเทศ", "กลุ่มพัฒนาระบบลูกจ้าง", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "กรมศุลกากร",
    "level3": ["สำนักบริหารกลาง (สบก.)", "ด่านศุลกากรจันทบุรี (ดจบ.)", "ด่านศุลกากรสังขละบุรี (ดสบ.)", "ด่านศุลกากรคลองใหญ่ (ดคญ.)", "ด่านศุลกากรหนองคาย (ดนค.)", "ด่านศุลกากรบึงกาฬ (ดบก.)", "ด่านศุลกากรนครพนม (ดนพ.)", "ด่านศุลการมุกดาหาร (ดมห.)", "ด่านศุลกากรท่าลี่ (ดทล.)", "ด่านศุลกากรเชียงคาน (ดชค.)", "ด่านศุลกากรช่างจอม (ดชจ.)", "ด่านศุลกากรช่องเม็ก (ดชม.)", "ด่านศุลกากรเขมราฐ (ดขร.)", "ด่านศุลกากรแม่กลอง (ดมก.)", "ด่านศุลกากรแม่สาย (ดมย.)", "ด่านศุลกากรเชียงแสน (ดชส.)", "ด่านศุลกากรเชียงของ (ดชข.)", "ด่านศุลกากรแม่ฮ่องสอน (ดมส.)", "ด่านศุลกากรแม่สะเรียง (ดมร.)", "ด่านศุลกากรเชียงดาว (ดชด.)", "ด่านศุลกากรท่าอากาศยานเชียงใหม่ (ดทช.)", "ด่านศุลกากรแม่สอด (ดมด.)", "ด่านศุลกากรทุ่งช้าง (ดทง.)", "ด่านศุลกากรนครศรีธรรมคราช (ดนศ.)", "ด่านศุลกากรประจวบคีรีขันธ์ (ดปข.)", "ด่านศุลกากรศิชล (ดสช.)", "ด่านศุลกากรสงขลา (ดสข.)", "ด่านศุลกากรสะเดา (ดสด.)", "ด่านศุลกากรปาดังเบซาร์ (ดปบ.)", "ด่านศุลกากรท่าอากาศยานหาดใหญ่ (ดทห.)", "ด่านศุลกากรปัตตานี (ดปน.)", "ด่านศุลกากรตากใบ (ดตบ.)", "ด่านศุลกากรสุไหงโก-ลก (ดสก.)", "ด่านศุลกากรเบตง (ดบต.)", "ด่านศุลกากรภูเก็ต (ดภก.)", "ด่านศุลกากรชุมพร (ดชพ.)", "ด่านศุลกากรท่าอากาศยานภูเก็ต (ดทภ.)", "ด่านศุลกากรกระบี่ (ดกบ.)", "ด่านศุลกากรกันตัง (ดกต.)", "ด่านศุลกากรวังประจัน (ดวป.)", "ด่านศุลกากรสตูล (ดสต.)", "ด่านศุลกากรบ้านประกอบ (ดบป.)", "ด่านศุลกากรช่องสะงำ (ดชง.)", "ด่านศุลกากรบูเก๊ะตา (ดบกต.)", "ด่านศุลกากรระนอง (ดรน.)", "ด่านศุลกากรบ้านดอน (ดบด.)", "ด่านศุลกากรเกาะสมุย (ดกส.)", "ด่านศุลกากรอรัญประเทศ (ดอป.)", "ด่านศุลกากรมาบตาพุด (ดมพ.)", "สำนักกฎหมาย (สกม.)", "สำนักงานศุลกากรกรุงเทพ (สกท.)", "สำนักงานศุลกากรตรวจของผู้โดยสารท่าอากาศยานสุวรรณภูมิ (สผภ.)", "สำนักงานศุลกากรตรวจสินค้าท่าอากาศยานสุวรรณภูมิ (สสภ.)", "สำนักงานศุลกากรตรวจสินค้าลาดกระบัง (สสล.)", "สำนักงานศุลกากรท่าเรือกรุงเทพ (สทก.)", "สำนักงานศุลกากรท่าเรือแหลมฉบัง (สทบ.)", "สำนักงานศุลกากรภาคที่ 1 (ศภ.1)", "สำนักงานศุลกากรภาคที่ 2 (ศภ.2)", "สำนักงานศุลกากรภาคที่ 3 (ศภ.3)", "สำนักงานศุลกากรภาคที่ 4 (ศภ.4)", "สำนักตรวจสอบอากร (สตอ.)", "สำนักเทคโนโลยีสารสนเทศและการสื่อสาร (สทส.)", "สำนักบริหารทรัพยากรบุคคล (สบท.)", "สำนักแผนและการต่างประเทศ (สผต.)", "สำนักพิกัดอัตราศุลกากร (สพก.)", "สำนักมาตรฐานพิธีการและราคาศุลกากร (สมพ.)", "สำนักสิทธิประโยชน์ทางภาษีอากร (สสอ.)", "สำนักสืบสวนและปราบปราม (สสป.)", "กลุ่มพัฒนาระบบบริหาร (กพบ.)", "กลุ่มตรวจสอบภายใน (กตน.)", "ศูนย์ประมวลข้อมูลการข่าวทางศุลกากร (ศปข.)"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "กรมสรรพสามิต",
    "level3": ["สำนักงานเลขานุการกรม", "ศูนย์เทคโนโลยีสารสนเทศ", "สำนักกฎหมาย", "สำนักงานสรรพสามิตภาคที่ 1", "สำนักงานสรรพสามิตภาคที่ 2", "สำนักงานสรรพสามิตภาคที่ 3", "สำนักงานสรรพสามิตภาคที่ 4", "สำนักงานสรรพสามิตภาคที่ 5", "สำนักงานสรรพสามิตภาคที่ 6", "สำนักงานสรรพสามิตภาคที่ 7", "สำนักงานสรรพสามิตภาคที่ 8", "สำนักงานสรรพสามิตภาคที่ 9", "สำนักงานสรรพสามิตภาคที่ 10", "สำนักตรวจสอบ ป้องกันและปราบปราม", "สำนักมาตรฐานและพัฒนาการจัดเก็บภาษี 1", "สำนักมาตรฐานและพัฒนาการจัดเก็บภาษี 2", "สำนักบริหารการคลังและรายได้", "สำนักบริหารทรัพยากรบุคคล", "สำนักแผนภาษี", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาและตรวจสอบทางเทคนิค", "กลุ่มวิเคราะห์สินค้าและของกลาง"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "กรมสรรพากร",
    "level3": ["สำนักงานเลขานุการกรม", "กองกฎหมาย", "กองตรวจสอบภาษีกลาง", "กองเทคโนโลยีสารสนเทศ", "กองบริหารการคลังและรายได้", "กองบริหารการเสียภาษีทางอิเล็กทรอนิกส์", "กองบริหารทรัพยากรบุคคล", "กองบริหารภาษีธุรกิจขนาดกลางและขนาดเล็ก", "กองบริหารภาษีธุรกิจขนาดใหญ่", "กองมาตรฐานการกำกับและตรวจสอบภาษี", "กองมาตรฐานการจัดเก็บภาษี", "กองมาตรฐานการสอบบัญชีภาษีอากร", "กองวิชาการแผนภาษี", "กองสำรวจและติดตามธุรกิจนอกระบบ", "กองสืบสวนและคดี", "กองอุทธรณ์ภาษี", "สำนักงานสรรพากรภาค 1", "สำนักงานสรรพากรภาค 2", "สำนักงานสรรพากรภาค 3", "สำนักงานสรรพากรภาค 4", "สำนักงานสรรพากรภาค 5", "สำนักงานสรรพากรภาค 6", "สำนักงานสรรพากรภาค 7", "สำนักงานสรรพากรภาค 8", "สำนักงานสรรพากรภาค 9", "สำนักงานสรรพากรภาค 10", "สำนักงานสรรพากรภาค 11", "สำนักงานสรรพากรภาค 12", "กลุ่มตรวจสอบภายใน", "กลุ่มบริหารการคืนภาษีมูลค่าเพิ่มให้แก่นักท่องเที่ยว", "กลุ่มพัฒนาระบบบริหาร", "งานตรวจราชการ 1", "งานตรวจราชการ 2", "งานตรวจราชการ 3", "งานตรวจราชการ 4", "งานตรวจราชการ 5", "งานตรวจราชการ 6", "ศูนย์สารนิเทศสรรพากร"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "สำนักงานคณะกรรมการนโยบายรัฐวิสาหกิจ",
    "level3": ["สำนักงานเลขานุการกรม", "ศูนย์เทคโนโลยีสารสนเทศ", "สำนักกฎหมาย", "สำนักกำกับและประเมินผลรัฐวิสาหกิจ", "สำนักนโยบายและแผนรัฐวิสาหกิจ", "สำนักบริหารหลักทรัพย์ของรัฐ", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "กองพัฒนารัฐวิสาหกิจ 1", "กองพัฒนารัฐวิสาหกิจ 2", "กองพัฒนารัฐวิสาหกิจ 3", "กองส่งเสริมการให้เอกชนร่วมลงทุนในกิจการของรัฐ", "กองขับเคลื่อนองค์กรด้วยเทคโนโลยีดิจิทัล"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "สำนักงานบริหารหนี้สาธารณะ",
    "level3": ["กลุ่มตรวจสอบภายใน", "กลุ่มบริหารความเสี่ยงหนี้สาธารณะ", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มกฎหมาย", "สำนักงานเลขานุการกรม", "ศูนย์เทคโนโลยีสารสนเทศ", "สำนักจัดการหนี้ 1", "สำนักจัดการหนี้ 2", "สำนักนโยบายและแผน", "สำนักบริหารการชำระหนี้", "สำนักบริหารการระดมทุนโครงการลงทุนภาครัฐ", "สำนักพัฒนาตลาดตราสารหนี้", "สำนักบริหารและประเมินผลโครงการลงทุนภาครัฐ", "ศูนย์ข้อมูลที่ปรึกษา"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "องค์การตลาดเพื่อเกษตรกร",
    "level3": ["", "ฝ่ายกิจการภูมิภาค 1", "ฝ่ายกิจการภูมิภาค 2", "สำนักนโยบายและแผน", "สำนักตรวจสอบภายใน", "ฝ่ายบริหารและพัฒนาองค์กร", "ฝ่ายการเงินและบัญชี", "ฝ่ายธุรกิจเกษตร", "ฝ่ายกิจการตลาด", "สำนักงานผู้อำนวยการ", "กองแผนงานและงบประมาณ", "กองเทคโนโลยีสารสนเทศ", "กองพัฒนาระบบงานและบริหารความเสี่ยง", "กลุ่มตรวจสอบระบบปฏิบัติการ", "กลุ่มตรวจสอขการปฏิบัติการส่วนกลาง", "กลุ่มตรวจสอบการปฏิบัติการส่วนภูมิภาค", "กองทรัพยากรบุคคล", "กองกฎหมาย", "กองพัสดุ", "กองการเงิน", "กองบัญชี", "กองบัญชีสาขา", "กลุ่มการค้าต่างประเทศและพัฒนาธุรกิจ", "กองธุรกิจข้าว", "กองธุรกิจพืชผล", "กองธุรกิจปัจจัยการผลิต", "กองตลาด 1", "กองตลาด 2", "กองพัฒนาธุรกิจตลาด", "กลุ่มบริหารงานกิจการภูมิภาค 1", "สำนักงาน อ.ต.ก. เขต 1", "สำนักงาน อ.ต.ก.จ.ราชบุรี", "สำนักงาน อ.ต.ก.จ.เพชรบุรี", "สำนักงาน อ.ต.ก.เขต 2", "สำนักงาน อ.ต.ก.จ.พระนครศรีอยุธยา", "สำนักงาน อ.ต.ก.จ.สระบุรี", "สำนักงาน อ.ต.ก.จ.สุพรรณบุรี", "สำนักงาน อ.ต.ก.จ.สิงห์บุรี", "สำนักงาน อ.ต.ก.จ.ลพบุรี", "สำนักงาน อ.ต.ก.เขต 3", "สำนักงาน อ.ต.ก.จ.ฉะเชิงเทรา", "สำนักงาน อ.ต.ก.จ.จันทบุรี", "สำนักงาน อ.ต.ก.จ.ปราจีนบุรี", "สำนักงาน อ.ต.ก.เขต 4", "สำนักงาน อ.ต.ก.จ.สงขลา", "สำนักงาน อ.ต.ก.จ.สุราษฎร์ธานี", "สำนักงาน อ.ต.ก.จ.นครศรีธรรมราช", "สำนักงาน อ.ต.ก.จ.ตรัง", "กลุ่มบริหารงานกิจการภูมิภาค 2", "สำนักงาน อ.ต.ก.เขต 5", "สำนักงาน อ.ต.ก.จ.เชียงใหม่", "สำนักงาน อ.ต.ก.จ.ลำปาง", "สำนักงาน อ.ต.ก.จ.พิษณุโลก", "สำนักงาน อ.ต.ก.จ.กำแพงเพชร", "สำนักงาน อ.ต.ก.เขต 6", "สำนักงาน อ.ต.ก.จ.นครสวรรค์", "สำนักงาน อ.ต.ก.จ.ชัยนาท", "สำนักงาน อ.ต.ก.จ.เพชรบูรณ์", "สำนักงาน อ.ต.ก.เขต 7", "สำนักงาน อ.ต.ก.จ.ขอนแก่น", "สำนักงาน อ.ต.ก.จ.ร้อยเอ็ด", "สำนักงาน อ.ต.ก.จ.อุดรธานี", "สำนักงาน อ.ต.ก.จ.นครพนม", "สำนักงาน อ.ต.ก.เขต 8", "สำนักงาน อ.ต.ก.จ.นครราชสีมา", "สำนักงาน อ.ต.ก.จ.อุบลราชธานี", "สำนักงาน อ.ต.ก.จ.สุรินทร์"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "สำนักงานเศรษฐกิจการคลัง",
    "level3": ["เลขานุการกรม", "ศูนย์เทคโนโลยีสารสนเทศ", "สำนักกฎหมาย", "สำนักนโยบายการคลัง", "สำนักนโยบายภาษี", "สำนักนโยบายระบบการเงินและสถาบันการเงิน", "สำนักนโยบายการออมและการลงทุน", "สำนักนโยบายระบบการคุ้มครองผลประโยชน์ทางการเงิน", "สำนักนโยบายเศรษฐกิจมหภาค", "สำนักนโยบายเศรษฐกิจระหว่างประเทศ", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "ศูนย์บริหารงานวิจัยและบรรณสารสนเทศ", "สำนักนโยบายพัฒนาระบบการเงินภาคประชาชน"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "กองทุนการออมแห่งชาติ",
    "level3": ["กองทุนการออมแห่งชาติ"]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "กระบี่",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "กาญจนบุรี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "กาฬสินธุ์",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "กำแพงเพชร",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ขอนแก่น",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "จันทบุรี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ฉะเชิงเทรา",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ชลบุรี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ชัยนาท",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ชัยภูมิ",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ชุมพร",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "เชียงราย",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "เชียงใหม่",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ตรัง",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ตราด",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ตาก",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "นครนายก",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "นครปฐม",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "นครพนม",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "นครราชสีมา",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "นครศรีธรรมราช",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "นครสวรรค์",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "นนทบุรี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "นราธิวาส",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "น่าน",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "บึงกาฬ",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "บุรีรัมย์",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ปทุมธานี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ประจวบคีรีขันธ์",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ปราจีนบุรี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ปัตตานี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "พะเยา",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "พระนครศรีอยุธยา",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "พังงา",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "พัทลุง",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "พิจิตร",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "พิษณุโลก",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "เพชรบุรี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "เพชรบูรณ์",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "แพร่",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภูเก็ต",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "มหาสารคาม",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "มุกดาหาร",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "แม่ฮ่องสอน",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ยโสธร",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ยะลา",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ร้อยเอ็ด",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ระนอง",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ระยอง",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ราชบุรี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ลพบุรี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ลำปาง",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ลำพูน",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "เลย",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ศรีสะเกษ",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "สกลนคร",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "สงขลา",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "สตูล",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "สมุทรปราการ",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "สมุทรสงคราม",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "สมุทรสาคร",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "สระแก้ว",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "สระบุรี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "สิงห์บุรี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "สุโขทัย",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "สุพรรณบุรี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "สุราษฎร์ธานี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "สุรินทร์",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "หนองคาย",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "หนองบัวลำภู",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "อ่างทอง",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "อำนาจเจริญ",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "อุดรธานี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "อุตรดิตถ์",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "อุทัยธานี",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "อุบลราชธานี",
    "level3": [""]
}, {
    "level1": "กระทรวงมหาดไทย",
    "level2": "สำนักงานปลัดกระทรวงมหาดไทย",
    "level3": ["กองกลาง", "กองการเจ้าหน้าที่", "กองคลัง", "กองการต่างประเทศ", "สำนักตรวจราชการและเรื่องราวร้องทุกข์", "กองสารนิเทศ", "สถาบันดำรงราชานุภาพ", "สำนักกฎหมาย", "สำนักงานคณะกรรมการมาตรฐานการบริหารงานบุคคลท้องถิ่น", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักนโยบายและแผน", "สำนักพัฒนาและส่งเสริมการบริหารราชการจังหวัด", "กลุ่มงานสนับสนุนปลัดกระทรวง", "ศูนย์ปฏิบัติการข่าวกระทรวงมหาดไทย", "สำนักงานที่ปรึกษากฎหมาย", "กลุ่มงานตรวจสอบภายในระดับกระทรวง", "กลุ่มงานตรวจสอบภายในระดับกรม", "กลุ่มพัฒนาระบบบริหาร", "สำนักงานศูนย์บริหารจังหวัดชายแดนภาคใต้", "สำนักบริหารยุทธศาสตร์กลุ่มจังหวัด", "สำนักงานที่ปรึกษา", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "กลุ่มยุทธศาสตร์การพัฒนาภาค", "กลุ่มขับเคลื่อนการปฏิรูปประเทศ ยุทธศาสตร์ชาติ และการสร้างความสามัคคีปรองดอง กระทรวงมหาดไทย (ป.ย.ป.มท.)"]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคกลางตอนบน",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคกลางปริมณฑล",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคกลางตอนล่าง 1",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคกลางตอนล่าง 2",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคใต้ฝั่งอ่าวไทย",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคใต้ฝั่งอันดามัน",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคใต้ชายแดน",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคตะวันออก 1",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคตะวันออก 2",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคตะวันออกเฉียงเหนือตอนบน 1",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคตะวันออกเฉียงเหนือตอนบน 2",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคตะวันออกเฉียงเหนือตอนกลาง",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคตะวันออกเฉียงเหนือตอนล่าง 1",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคตะวันออกเฉียงเหนือตอนล่าง 2",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคเหนือตอนบน 1",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคเหนือตอนบน 2",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคเหนือตอนล่าง 1",
    "level3": [""]
}, {
    "level1": "จังหวัดและกลุ่มจังหวัด",
    "level2": "ภาคเหนือตอนล่าง 2",
    "level3": [""]
}, {
    "level1": "กระทรวงมหาดไทย",
    "level2": "กรมการปกครอง",
    "level3": ["สำนักงานเลขานุการกรมการปกครอง", "กองการเจ้าหน้าที่", "กองคลัง", "กองการสื่อสาร", "กองวิชาการและแผนงาน", "วิทยาลัยกรมการปกครอง", "สำนักการสอบสวนและนิติการ", "สำนักกิจการความมั่นคงภายใน", "สำนักบริหารการทะเบียน", "สำนักบริหารการปกครองท้องที่", "สำนักอำนวยการกองอาสารักษาดินแดน", "กองตรวจราชการและเรื่องราวร้องทุกข์", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "สำนักงานผู้เชี่ยวชาญด้านความมั่นคง", "สำนักงานผู้เชี่ยวชาญด้านกฎหมาย", "ศูนย์สารสนเทศเพื่อการบริหารงานปกครอง", "สำนักงานผู้ช่วยเลขาธิการศูนย์อำนวยการบริหารจังหวัดชายแดนภาคใต้ กรมการปกครอง", "กองส่งเสริมองค์กรศาสนาอิสลามและกิจการฮัจย์"]
}, {
    "level1": "กระทรวงมหาดไทย",
    "level2": "กรมการพัฒนาชุมชน",
    "level3": ["สำนักงานเลขานุการกรม", "กองการเจ้าหน้าที่", "กองคลัง", "กองแผนงาน", "ศูนย์สารสนเทศเพื่อการพัฒนาชุมชน", "สถาบันการพัฒนาชุมชน", "สำนักพัฒนาทุนและองค์กรการเงินชุมชน", "สำนักส่งเสริมภูมิปัญญาท้องถิ่นและวิสาหกิจชุมชน", "สำนักเสริมสร้างความเข้มแข็งชุมชน", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "สำนักตรวจราชการกรม", "กองประชาสัพันธ์", "ศูนย์ประสานราชการจังหวัดชายแดนภาคใต้ กรมการพัฒนาชุมชน", "กลุ่มงานคุ้มครองจริยธรรม", "สำนักงานกองุนพัฒนาบทบาทสตรี"]
}, {
    "level1": "กระทรวงมหาดไทย",
    "level2": "กรมที่ดิน",
    "level3": ["สำนักงานเลขานุการกรม", "กองการเจ้าหน้าที่", "กองคลัง", "กองการพิมพ์", "สำนักกฎหมาย", "กองแผนงาน", "กองฝึกอบรม", "กองพัสดุ", "สำนักงานคณะกรรมการช่างรังวัดเอกชน", "สำนักงานที่ดินกรุงเทพมหานคร", "สำนักจัดการที่ดินของรัฐ", "กองเทคโนโลยีทำแผนที่", "สำนักเทคโนโลยีสารสนเทศ", "สำนักมาตรฐานและส่งเสริมการรังวัด", "สำนักมาตรฐานการทะเบียนที่ดิน", "สำนักมาตรฐานการออกหนังสือสำคัญ", "สำนักส่งเสริมธุรกิจอสังหาริมทรัพย์", "สำนักผู้ตรวจราชการกรมที่ดิน", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "สำนักงานบริหารโครงการพัฒนากรมที่ดินและเร่งรัดการออกโฉนดที่ดิน", "สำนักงานตรวจราชการ", "ศูนย์ข้อมูลแผนที่รูปแปลงที่ดิน", "ศูนย์ปฏิบัติการต่อต้านการทุจริตกรมที่ดิน", "ศูนย์ดำรงธรรมกรมที่ดิน", "กลุ่มงานคุ้มครองจริยธรรมกรมที่ดิน"]
}, {
    "level1": "กระทรวงมหาดไทย",
    "level2": "กรมป้องกันและบรรเทาสาธารณภัย",
    "level3": ["สำนักงานเลขานุการกรม", "กองกฎหมาย", "กองการเจ้าหน้าที่", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "กองคลัง", "กองช่วยเหลือผู้ประสบภัย", "กองนโยบายป้องกันและบรรเทาสาธารณภัย", "กองบูรณาการความปลอดภัยทางถนน", "กองมาตรการป้องกันสาธารณภัย", "กองส่งเสริมการป้องกันสาธารณภัย", "ศูนย์เตือนภัยพิบัติแห่งชาติ", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 1 ปทุมธานี", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 2 สุพรรณบุรี", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 3 ปราจีนบุรี", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 4 ประจวบคีรีขันธ์", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 5 นครราชสีมา", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 6 ขอนแก่น", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 7 สกลนคร", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 8 กำแพงเพชร", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 9 พิษณุโลก", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 10 ลำปาง", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 11 สุราษฎร์ธานี", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 12 สงขลา", "ศูนย์อำนวยการบรรเทาสาธารณภัย", "กองบัญชาการป้องกันและบรรเทาสาธารณภัยแห่งชาติ", "สถาบันพัฒนาบุคลากรด้านการป้องกันและบรรเทาสาธารณภัย", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 13 อุบลราชธานี", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 14 อุดรธานี", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 15 เชียงราย", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 16 ชัยนาท", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 17 จันทบุรี", "ศูนย์ป้องกันและบรรเทาสาธารณภัย เขต 18 ภูเก็ต", "สำนักวิจัยและความร่วมมือระหว่างประเทศ", "กองเผยแพร่และประชาสัมพันธ์", "กองโรงงานเครื่องจักรกล", "กลุ่มงานคุ้มครองจริยธรรม", "ศูนย์ประสานราชการจังหวัดชายแดนภาคใต้ฯ", "สำนักผู้ตรวจราชการกรม"]
}, {
    "level1": "กระทรวงมหาดไทย",
    "level2": "กรมโยธาธิการและผังเมือง",
    "level3": ["สำนักงานเลขานุการกรม", "กองการเจ้าหน้าที่", "กองคลัง", "กองแผนงาน", "กองเผยแพร่และประชาสัมพันธ์", "กองนิติการ", "ศูนย์เทคโนโลยีสารสนเทศ", "สถาบันพัฒนาบุคลากรด้านการพัฒนาเมือง", "กองควบคุมการก่อสร้าง", "สำนักควบคุมและตรวจสอบอาคาร", "สำนักผังประเทศและผังภาค", "สำนักผังเมืองรวม", "สำนักวิเคราะห์และประเมินผล", "สำนักวิศวกรรมการผังเมือง", "สำนักวิศวกรรมโครงสร้างและงานระบบ", "สภนักสถาปัตยกรรม", "สำนักสนับสนุนและพัฒนาตามผังเมือง", "กลุ่มงานตรวจสอบภายใน", "กองผังเมืองเฉพาะ", "สำนักงานจัดรูปที่ดินเพื่อการพัฒนาพื้นที่", "สำนักงานคณะกรรมการผังเมือง", "กลุ่มพัฒนาระบบบริหาร", "กองออกแบบก่อสร้างพลับพลาพิธีและโครงการพิเศษ", "สำนักงานวิเทศสัมพันธ์", "สำนักจัดรูปที่ดินเพื่อพัฒนาพื้นที่", "สำนักก่อสร้างและปรับปรุงพระที่นั่งอัมพรสถาน", "สำนักก่อสร้างวังทวีวัฒนา", "กองวิเคราะห์วิจัยและทดสอบวัสดุ", "กองบูรณะและบำรุงรักษา", "กองตรวจราชการ", "สำนักงานกองทุนจัดรูปที่ดินเพื่อพัฒนาพื้นที่", "กองมาตรฐานราคากลาง", "สำนักก่อสร้างและปรับปรุงวังศุโขทัย"]
}, {
    "level1": "กระทรวงมหาดไทย",
    "level2": "กรมส่งเสริมการปกครองท้องถิ่น",
    "level3": ["สำนักงานเลขานุการกรม (สล.)", "กองการเจ้าหน้าที่ (กจ.)", "กองคลัง (กค.)", "กองกฎหมายและระเบียบท้องถิ่น (กม.)", "กองตรวจสอบระบบการเงินบัญชีท้องถิ่น (ตบ.)", "ศูนย์เทคโนโลยีสารสนเทศ (ศส.)", "สถาบันพัฒนาบุคลากรท้องถิ่น (สบ.พถ.)", "สำนักบริหารการคลังท้องถิ่น (สน.คท.)", "สำนักพัฒนาระบบบริหารงานบุคคลท้องถิ่น (สน.บถ.)", "กองพัฒนาและส่งเสริมการบริหารงานท้องถิ่น (กพส.)", "กลุ่มประสานการตรวจราชการกรม (กปต.)", "กลุ่มพัฒนาระบบบริหาร (ก.พ.ร.สถ.)", "กลุ่มตรวจสอบภายใน (กตภ.)", "กองยุทธศาสตร์และแผนงาน (กยผ.)", "กองส่งเสริมและพัฒนาการจัดการศึกษาท้องถิ่น (กศ.)", "ศูนย์ปฏิบัติการต่อต้านการทุจริต สถ. (ศปท.สถ.)"]
}, {
    "level1": "กระทรวงมหาดไทย",
    "level2": "องค์การตลาด",
    "level3": ["ตลาดสาขาปากคลองตลาด", "ตลาดสาขาตลิ่งชัน", "ตลาดสาขาบางคล้า", "ตลาดสาขาหนองม่วง", "ตลาดสาขาลำพูน", "แผนกตลาดและจัดส่งสินค้า", "แผนกกิจการพิเศษ", "แผนกวางแผนและงบประมาณ", "แผนกติดตามและประเมินผล", "แผนกบริหารความเสี่ยง", "แผนกบริหารบุคคล", "แผนกจัดหาและพัสดุ", "แผนกกฎหมาย", "แผนกบัญชี", "แผนกการเงิน", "แผนกสารสนเทศ", "แผนกการประชุมและยานพาหนะ", "แผนกประชาสัมพันธ์", "แผนกตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงมหาดไทย",
    "level2": "การไฟฟ้านครหลวง",
    "level3": ["ฝ่ายสื่อสารองค์กร", "ฝ่ายตรวจสอบภายใน", "ฝ่ายทรัพยากรมนุษย์", "ฝ่ายอำนวยการ", "ฝ่ายบริหารความเสี่ยงองค์กร", "ฝ่ายการแพทย์", "ฝ่ายกฎหมาย", "ฝ่ายฝึกอบรม", "ฝ่ายกิจการสังคมและสิ่งแวดล้อม", "ฝ่ายความปลอดภัยอาชีวอนามัยและสิ่งแวดล้อม", "ฝ่ายบัญชี", "ฝ่ายการเงิน", "ฝ่ายงบประมาณ", "ฝ่ายจัดหา", "ฝ่ายออกแบบระบบไฟฟ้าและงานวิศวกรรมโยธา", "ฝ่ายพัสดุ", "ฝ่ายวางแผนและบริหารทรัพย์สินเทคโนโลยี", "ฝ่ายอุปกรณ์งานจำหน่าย", "ฝ่ายวิจัยและพัฒนา", "ฝ่ายวางแผนระบบไฟฟ้า", "ฝ่ายบำรุงรักษาระบบไฟฟ้า", "ฝ่ายบริการระบบไฟฟ้า", "ฝ่ายธุรกิจบริการและคุณภาพไฟฟ้า", "ฝ่ายพัฒนาระบบงานเทคโนโลยีสารสนเทศ", "ฝ่ายระบบโครงสร้างพื่นฐาน", "ฝ่ายพัฒนาระบบงานประยุกต์", "สำนักมาตรฐานและมั่นคงปลอดภัยสารสนเทศ", "ฝ่ายควบคุมระบบไฟฟ้า", "ฝ่ายแผนกลยุทธ์", "ฝ่ายพัฒนาคุณภาพองค์กร", "ฝ่ายพัฒนาธุรกิจ", "ฝ่ายเศรษฐกิจพลังไฟฟ้า", "ฝ่ายจัดการยานพาหนะและเครื่องมือกล", "ฝ่ายธุรกิจขนส่งและผลิตภัณฑ์", "ฝ่ายจัดการทรัพย์สินและรักษาความปลอดภัย", "ฝ่ายก่อสร้าง", "ฝ่ายบริหารโครงการ", "ฝ่ายการตลาดและลูกค้าสัมพันธ์", "ฝ่ายบริหารงานกลางการไฟฟ้านครหลวงเขต", "การไฟฟ้านครหลวงเขตลาดพร้าว", "การไฟฟ้านครหลวงเขตสามเสน", "การไฟฟ้านครหลวงเขตนนทบุรี", "การไฟฟ้านครหลวงเขตธนบุรี", "การไฟฟ้านครหลวงเขตบางใหญ่", "การไฟฟ้านครหลวงเขตลาดกระบัง", "การไฟฟ้านครหลวงเขตประเวศ", "การไฟฟ้านครหลวงเขตวัดเลียบ", "การไฟฟ้านครหลวงเขตคลองเตย", "การไฟฟ้านครหลวงเขตราษฎร์บูรณะ", "การไฟฟ้านครหลวงเขตยานนาวา", "การไฟฟ้านครหลวงเขตบางขุนเทียน", "การไฟฟ้านครหลวงเขตบางบัวทอง", "การไฟฟ้านครหลวงเขตบางกระปิ", "การไฟฟ้านครหลวงเขตสมุทรปราการ", "การไฟฟ้านครหลวงเขตบางพลี", "การไฟฟ้านครหลวงเขตมีนบุรี", "การไฟฟ้านครหลวงเขตบางเขน"]
}, {
    "level1": "กระทรวงมหาดไทย",
    "level2": "การไฟฟ้าส่วนภูมิภาค",
    "level3": ["ฝ่ายนโยบายและยุทธศาสตร์", "กองวางแผนวิสาหกิจ", "กองวิเคราะห์และประเมินผล", "ฝ่ายส่งเสริมพลังงานทดแทนและอนุรักษ์พลังงาน", "กองส่งเสริมพลังงานทดแทนและผู้ผลิตไฟฟ้าขนาดเล็ก", "กองส่งเสริมอนุรักษ์พลังงาน", "ฝ่ายวางแผนระบบไฟฟ้า", "กองโครงการ", "กองวิเคราะห์และวางแผนระบบไฟฟ้า", "กองแผนที่ระบบไฟฟ้า", "กองแผนงานระบบไฟฟ้าอัจฉริยะ", "กองจัดการโครงการ 1 ฝ่ายบริหารโครงการ 1", "ฝ่ายวางแผนธุรกิจภาค 3", "กองบริการลุกค้าและวิศวกรรม ภาค 3", "กองจัดการงานทั่วไป ภาค 3"]
}, {
    "level1": "กระทรวงมหาดไทย",
    "level2": "การประปานครหลวง",
    "level3": ["กองเลขานุการ (กลน.)", "ฝ่ายธรรมาภิบาล (ฝธภ.)", "ฝ่ายกิจการคณะกรรมการ กปน. (ฝกค.)", "ฝ่ายตรวจสอบกระบวนงานหลัก (ฝตล.)", "ฝ่ายตรวจสอบกระบวนงานสนับสนุน (ฝตน.)", "ฝ่ายพัฒนาและสนับสนุนงานตรวจสอบ (ฝพน.)", "ฝ่ายสื่อสารองค์กร (ฝสอ.)", "ฝ่ายปฏิบัติการ การประปานครหลวง (ฝปก.)", "ฝ่ายบริหารความรับผิดชอบต่อสังคม (ฝรส.)", "ฝ่ายพัฒนาวิชาการประปา (ฝพป.)", "กองแผนยุทธศาสตร์และการต่างประเทศ (กผต.)", "ฝ่ายพัฒนาทรัพยากรบุคคล (ฝพบ.)", "กองบริการงานสถาบัน (กบถ.)", "ฝ่ายกฎหมาย (ฝกม.)", "ฝ่ายบริการกลาง (ฝบก.)", "ฝ่ายจัดหาและพัสดุ (ฝจพ.)", "ฝ่ายบริหารทรัพยากรบุคคล (ฝบบ.)", "กองสารสนเทศงานบุคคล (กสบ.)", "ฝ่ายสวัสดิการและกิจการสัมพันธ์    (ฝสก.)", "กองบริการทางการแพทย์ (กบพ.)", "ฝ่ายงบประมาณ (ฝงป.)", "ฝ่ายวิเคราะห์และวางแผนการเงิน (ฝวง.)", "ฝ่ายพัฒนาระบบงานเสริมสร้างมูลค่ากิจการ (ฝพส.)", "ฝ่ายบัญชี (ฝบช.)", "ฝ่ายการเงิน (ฝกง.)", "สำนักงานประปาสาขาสุขุมวิท (สสส.)", "สำนักงานประปาสาขาบางกอกน้อย (สสบ.)", "สำนักงานประปาสาขาตากสิน (สสต.)", "สำนักงานประปาสาขาภาษีเจริญ (สสภ.)", "สำนักงานประปาสาขาสุขสวัสดิ์ (สสว.)", "สำนักงานประปาสาขาพระโขนง (สสพ.)", "สำนักงานประปาสาขานนทบุรี (สสน.)", "สำนักงานประปาสาขาบางบัวทอง (สสบท.)", "สำนักงานประปาสาขามหาสวัสดิ์ (สสมส.)", "สำนักงานประปาสาขาสมุทรปราการ (สสป.)", "ฝ่ายสนับสนุนงานบริการ (ฝสบ.)", "ฝ่ายมาตรวัดน้ำ (ฝมน.)", "ฝ่ายบริหารจัดการน้ำสูญเสีย (ฝจส.)", "สำนักงานประปาสาขาแม้นศรี (สสม.)", "สำนักงานประปาสาขาพญาไท (สสญ.)", "สำนักงานประปาสาขาทุ่งมหาเมฆ (สสท.)", "สำนักงานประปาสาขาลาดพร้าว (สสล.)", "สำนักงานประปาสาขาสุวรรณภูมิ (สสสภ.)", "สำนักงานประปาสาขาประชาชื่น (สสช.)", "สำนักงานประปาสาขาบางเขน (สสข.)", "สำนักงานประปาสาขามีนบุรี (สสมบ.)", "ฝ่ายออกแบบระบบจ่ายน้ำ (ฝอจ.)", "ฝ่ายออกแบบระบบผลิต ส่งน้ำและงานโยธา (ฝอผ.)", "กองบริหารธุรกิจเสริมระบบประปา (กธป.)", "ฝ่ายมาตรฐานวิศวกรรมและสารสนเทศภูมิศาสตร์ (ฝมส.)", "ฝ่ายก่อสร้างระบบผลิตส่งน้ำและงานโยธา (ฝกผ.)", "ฝ่ายก่อสร้างระบบผลิตส่งน้ำและงานโยธา (ฝกผ.)", "ฝ่ายโรงงานผลิตน้ำบางเขน (ฝผข.)", "กองวิชาการและข้อมูลผลิตน้ำ (กวผ.)", "ฝ่ายบำรุงรักษาระบบไฟฟ้า (ฝบฟ.)", "กองวิศวกรรมและข้อมูลบำรุงรักษา (กวร.)", "ฝ่ายก่อสร้างระบบจ่ายน้ำ 1 (ฝกจ.1)", "ฝ่ายก่อสร้างระบบจ่ายน้ำ 2 (ฝกจ.2)", "ฝ่ายบริหารโครงการ (ฝบค.)", "ฝ่ายโครงการปรับปรุงกิจการประปาแผนหลัก (ฝคป.)", "ฝ่ายวางแผนและพัฒนาการผลิตระบบส่งและจ่ายน้ำ (ฝพผ.)", "ฝ่ายทรัพยากรน้ำและสิ่งแวดล้อม (ฝนส.)", "ฝ่ายระบบส่งน้ำดิบ (ฝรด.)", "ฝ่ายคุณภาพน้ำ (ฝคภ.)", "ฝ่ายโรงงานผลิตน้ำสามเสน (ฝผส.)", "ฝ่ายโรงงานผลิตน้ำมหาสวัสดิ์และธนบุรี (ฝมธ.)", "ฝ่ายสถานีสูบจ่ายน้ำ (ฝสน.)", "ฝ่ายควบคุมการส่งและจ่ายน้ำ (ฝคจ.)", "ฝ่ายบำรุงรักษาระบบเครื่องกลและโยธา (ฝบย.)", "ฝ่ายบำรุงรักษาระบบอัตโนมัติและเครื่องวัด (ฝบอ.)", "ฝ่ายนโยบายและยุทธศาสตร์ (ฝนย.)", "ฝ่ายพัฒนาธุรกิจ (ฝพธ.)", "ฝ่ายติดตามและประเมินผล (ฝตป.)", "ฝ่ายบริหารความเสี่ยง (ฝบส.)", "ฝ่ายยุทธศาสตร์ด้านเทคโนโลยีสารสนเทศ (ฝยท.)", "ฝ่ายพัฒนาและสนับสนุนเทคโนโลยี (ฝพท.)", "ฝ่ายเทคโนโลยีและสื่อสาร (ฝยส.)"]
}, {
    "level1": "กระทรวงมหาดไทย",
    "level2": "การประปาส่วนภูมิภาค",
    "level3": ["หน่วยงานผู้ว่าการ", "หน่วยงานผู้ช่วยผู้ว่าการ (สำนักผู้ว่าการ)", "สำนักผู้ว่าการ", "กองเลขานุการ", "กองการประชุม", "หน่วยงานผู้ช่วยผู้ว่าการ (สำนักสื่อสารองค์กรและลูกค้าสัมพันธ์)", "สำนักสื่อสารองค์กรและลูกค้าสัมพันธ์", "กองสื่อสารองค์กร", "กองลูกค้าสัมพันธ์", "หน่วยงานผู้ช่วยผู้ว่าการ (เทคโนโลยีสารสนเทศ)", "กองศูนย์ข้อมูลและแผนเทคโนโลยีสารสนเทศ", "สำนักเทคโนโลยีสารสนเทศ", "กองคอมพิวเตอร์และเครือข่าย", "กองพัฒนาระบบงานสารสนเทศ", "กองบริการสารสนเทศ", "สำนักเทคโนโลยีภูมิสารสนเทศ", "กองภูมิสารสนเทศ", "กองเทคโนโลยีสารสนเทศน้ำสูญเสีย", "หน่วยงานผู้ช่วยผู้ว่าการ (สำนักตรวจสอบ)", "กองพัฒนาและสนับสนุนงานตรวจสอบ", "ฝ่ายตรวจสอบหน่วยงานส่วนกลาง", "กองตรวจสอบหน่วยงานส่วนกลาง", "กองตรวจสอบเทคโนโลยีสารสนเทศ", "ฝ่ายตรวจสอบหน่วยงานส่วนภูมิภาค", "กองตรวจสอบภูมิภาค 1", "กองตรวจสอบภูมิภาค 2", "กองตรวจสอบภูมิภาค 3", "กองตรวจสอบภูมิภาค 4", "กองตรวจสอบภูมิภาค 5", "หน่วยงานผู้เชี่ยวชาญ (ด้านการสื่อสารองค์กร)", "หน่วยงานรองผู้ว่าการ (ปฏิบัติการ 1)", "สำนักปฏิบัติการ 1", "กองกิจการประปา 1", "การประปาส่วนภูมิภาคเขต 9", "กองแผนและวิชาการ", "การประปาส่วนภูมิภาคสาขาเชียงใหม่(ชั้นพิเศษ)", "การประปาส่วนภูมิภาคสาขาฮอด", "การประปาส่วนภูมิภาคสาขาสันกำแพง", "การประปาส่วนภูมิภาคสาขาแม่ริม", "การประปาส่วนภูมิภาคสาขาแม่แตง", "การประปาส่วนภูมิภาคสาขาฝาง", "การประปาส่วนภูมิภาคสาขาจอมทอง", "การประปาส่วนภูมิภาคสาขาแม่ฮ่องสอน", "การประปาส่วนภูมิภาคสาขาแม่สะเรียง", "การประปาส่วนภูมิภาคสาขาลำพูน", "กองระบบผลิตและควบคุมคุณภาพน้ำ", "การประปาส่วนภูมิภาคสาขาบ้านโฮ่ง", "การประปาส่วนภูมิภาคสาขาลำปาง", "การประปาส่วนภูมิภาคสาขาเกาะคา", "การประปาส่วนภูมิภาคสาขาเถิน", "การประปาส่วนภูมิภาคสาขาแพร่", "การประปาส่วนภูมิภาคสาขาเด่นชัย", "การประปาส่วนภูมิภาคสาขาร้องกวาง", "การประปาส่วนภูมิภาคสาขาน่าน", "การประปาส่วนภูมิภาคสาขาท่าวังผา", "การประปาส่วนภูมิภาคสาขาพะเยา", "กองระบบจำหน่าย", "การประปาส่วนภูมิภาคสาขาจุน", "การประปาส่วนภูมิภาคสาขาเชียงราย", "การประปาส่วนภูมิภาคสาขาพาน", "การประปาส่วนภูมิภาคสาขาเทิง", "การประปาส่วนภูมิภาคสาขาเวียงเชียงของ", "การประปาส่วนภูมิภาคสาขาแม่สาย", "การประปาส่วนภูมิภาคสาขาแม่ขะจาน", "กองบัญชีและการเงิน", "กองเทคโนโลยีสารสนเทศ", "กองบริหารทั่วไป", "หน่วยงานผู้ช่วยผู้อำนวยการการประปาส่วนภูมิภาคเขต 9", "การประปาส่วนภูมิภาคเขต 10", "การประปาส่วนภูมิภาคสาขานครสวรรค์", "การประปาส่วนภูมิภาคสาขาท่าตะโก", "การประปาส่วนภูมิภาคสาขาลาดยาว", "การประปาส่วนภูมิภาคสาขาพยุหะคีรี", "การประปาส่วนภูมิภาคสาขาชัยนาท", "การประปาส่วนภูมิภาคสาขาอุทัยธานี", "การประปาส่วนภูมิภาคสาขากำแพงเพชร", "การประปาส่วนภูมิภาคสาขาขาณุวรลักษบุรี", "การประปาส่วนภูมิภาคสาขาตาก", "การประปาส่วนภูมิภาคสาขาแม่สอด", "การประปาส่วนภูมิภาคสาขาสุโขทัย", "การประปาส่วนภูมิภาคสาขาทุ่งเสลี่ยม", "การประปาส่วนภูมิภาคสาขาศรีสำโรง", "การประปาส่วนภูมิภาคสาขาสวรรคโลก", "การประปาส่วนภูมิภาคสาขาศรีสัชนาลัย", "การประปาส่วนภูมิภาคสาขาอุตรดิตถ์", "การประปาส่วนภูมิภาคสาขาพิษณุโลก", "การประปาส่วนภูมิภาคสาขานครไทย", "การประปาส่วนภูมิภาคสาขาพิจิตร", "การประปาส่วนภูมิภาคสาขาบางมูลนาก", "การประปาส่วนภูมิภาคสาขาตะพานหิน", "การประปาส่วนภูมิภาคสาขาเพชรบูรณ์", "การประปาส่วนภูมิภาคสาขาหล่มสัก", "การประปาส่วนภูมิภาคสาขาชนแดน", "การประปาส่วนภูมิภาคสาขาหนองไผ่", "การประปาส่วนภูมิภาคสาขาวิเชียรบุรี", "หน่วยงานผู้ช่วยผู้อำนวยการการประปาส่วนภูมิภาคเขต 10", "หน่วยงานรองผู้ว่าการ (ปฏิบัติการ 2)", "สำนักปฏิบัติการ 2", "กองกิจการประปา 2", "การประปาส่วนภูมิภาคเขต 6", "การประปาส่วนภูมิภาคสาขาขอนแก่น(ชั้นพิเศษ)", "การประปาส่วนภูมิภาคสาขาบ้านไผ่", "การประปาส่วนภูมิภาคสาขาชุมแพ", "การประปาส่วนภูมิภาคสาขาน้ำพอง", "การประปาส่วนภูมิภาคสาขาชนบท", "การประปาส่วนภูมิภาคสาขากระนวน", "การประปาส่วนภูมิภาคสาขาหนองเรือ", "การประปาส่วนภูมิภาคสาขาเมืองพล", "การประปาส่วนภูมิภาคสาขากาฬสินธุ์", "การประปาส่วนภูมิภาคสาขากุฉินารายณ์", "การประปาส่วนภูมิภาคสาขาสมเด็จ", "การประปาส่วนภูมิภาคสาขามหาสารคาม", "การประปาส่วนภูมิภาคสาขาพยัคฆภูมิพิสัย", "การประปาส่วนภูมิภาคสาขาชัยภูมิ", "การประปาส่วนภูมิภาคสาขาแก้งคร้อ", "การประปาส่วนภูมิภาคสาขาจัตุรัส", "การประปาส่วนภูมิภาคสาขาหนองบัวแดง", "การประปาส่วนภูมิภาคสาขาภูเขียว", "การประปาส่วนภูมิภาคสาขาบำเหน็จณรงค์", "การประปาส่วนภูมิภาคสาขาร้อยเอ็ด", "การประปาส่วนภูมิภาคสาขาโพนทอง", "การประปาส่วนภูมิภาคสาขาสุวรรณภูมิ", "หน่วยงานผู้ช่วยผู้อำนวยการการประปาส่วนภูมิภาคเขต 6", "การประปาส่วนภูมิภาคเขต 7", "การประปาส่วนภูมิภาคสาขาอุดรธานี(ชั้นพิเศษ)", "การประปาส่วนภูมิภาคสาขากุมภวาปี", "การประปาส่วนภูมิภาคสาขาบ้านผือ", "การประปาส่วนภูมิภาคสาขาบ้านดุง", "การประปาส่วนภูมิภาคสาขาหนองบัวลำภู", "การประปาส่วนภูมิภาคสาขาเลย", "การประปาส่วนภูมิภาคสาขาเชียงคาน", "การประปาส่วนภูมิภาคสาขาด่านซ้าย", "การประปาส่วนภูมิภาคสาขาวังสะพุง", "การประปาส่วนภูมิภาคสาขาหนองคาย", "การประปาส่วนภูมิภาคสาขาบึงกาฬ", "การประปาส่วนภูมิภาคสาขาศรีเชียงใหม่", "การประปาส่วนภูมิภาคสาขาโพนพิสัย", "การประปาส่วนภูมิภาคสาขาสกลนคร", "การประปาส่วนภูมิภาคสาขาสว่างแดนดิน", "การประปาส่วนภูมิภาคสาขาพังโคน", "การประปาส่วนภูมิภาคสาขานครพนม", "การประปาส่วนภูมิภาคสาขาธาตุพนม", "การประปาส่วนภูมิภาคสาขาบ้านแพง", "การประปาส่วนภูมิภาคสาขาศรีสงคราม", "หน่วยงานผู้ช่วยผู้อำนวยการการประปาส่วนภูมิภาคเขต 7", "หน่วยงานรองผู้ว่าการ (ปฏิบัติการ 3)", "สำนักปฏิบัติการ 3", "กองกิจการประปา 3", "การประปาส่วนภูมิภาคเขต 1", "การประปาส่วนภูมิภาคสาขาชลบุรี(ชั้นพิเศษ)", "การประปาส่วนภูมิภาคสาขาพัทยา(ชั้นพิเศษ)", "การประปาส่วนภูมิภาคสาขาบ้านบึง", "การประปาส่วนภูมิภาคสาขาพนัสนิคม", "การประปาส่วนภูมิภาคสาขาศรีราชา", "การประปาส่วนภูมิภาคสาขาแหลมฉบัง", "การประปาส่วนภูมิภาคสาขาฉะเชิงเทรา", "การประปาส่วนภูมิภาคสาขาบางปะกง", "การประปาส่วนภูมิภาคสาขาบางคล้า", "การประปาส่วนภูมิภาคสาขาพนมสารคาม", "การประปาส่วนภูมิภาคสาขาระยอง", "การประปาส่วนภูมิภาคสาขาบ้านฉาง", "การประปาส่วนภูมิภาคสาขาปากน้ำประแสร์", "การประปาส่วนภูมิภาคสาขาจันทบุรี", "การประปาส่วนภูมิภาคสาขาขลุง", "การประปาส่วนภูมิภาคสาขาตราด", "การประปาส่วนภูมิภาคสาขาคลองใหญ่", "การประปาส่วนภูมิภาคสาขาสระแก้ว", "การประปาส่วนภูมิภาคสาขาวัฒนานคร", "การประปาส่วนภูมิภาคสาขาอรัญประเทศ", "การประปาส่วนภูมิภาคสาขาปราจีนบุรี", "การประปาส่วนภูมิภาคสาขากบินทร์บุรี", "หน่วยงานผู้ช่วยผู้อำนวยการการประปาส่วนภูมิภาคเขต 1", "การประปาส่วนภูมิภาคเขต 8", "การประปาส่วนภูมิภาคสาขาอุบลราชธานี", "การประปาส่วนภูมิภาคสาขาพิบูลมังสาหาร", "การประปาส่วนภูมิภาคสาขาเดชอุดม", "การประปาส่วนภูมิภาคสาขาเขมราฐ", "การประปาส่วนภูมิภาคสาขาอำนาจเจริญ", "การประปาส่วนภูมิภาคสาขายโสธร", "การประปาส่วนภูมิภาคสาขาเลิงนกทา", "การประปาส่วนภูมิภาคสาขามหาชนะชัย", "การประปาส่วนภูมิภาคสาขาบุรีรัมย์", "การประปาส่วนภูมิภาคสาขาสตึก", "การประปาส่วนภูมิภาคสาขาลำปลายมาศ", "การประปาส่วนภูมิภาคสาขานางรอง", "การประปาส่วนภูมิภาคสาขาละหานทราย", "การประปาส่วนภูมิภาคสาขาสุรินทร์", "การประปาส่วนภูมิภาคสาขาศรีขรภูมิ", "การประปาส่วนภูมิภาคสาขารัตนบุรี", "การประปาส่วนภูมิภาคสาขาสังขะ", "การประปาส่วนภูมิภาคสาขาศรีสะเกษ", "การประปาส่วนภูมิภาคสาขากันทรลักษ์", "การประปาส่วนภูมิภาคสาขามุกดาหาร", "หน่วยงานผู้ช่วยผู้อำนวยการการประปาส่วนภูมิภาคเขต 8", "หน่วยงานรองผู้ว่าการ (ปฏิบัติการ 4)", "สำนักปฏิบัติการ 4", "กองกิจการประปา 4", "การประปาส่วนภูมิภาคเขต 2", "การประปาส่วนภูมิภาคสาขาพระพุทธบาท", "การประปาส่วนภูมิภาคสาขาหนองแค", "การประปาส่วนภูมิภาคสาขามวกเหล็ก", "การประปาส่วนภูมิภาคสาขาบ้านหมอ", "การประปาส่วนภูมิภาคสาขาลพบุรี", "การประปาส่วนภูมิภาคสาขาบ้านหมี่", "การประปาส่วนภูมิภาคสาขาชัยบาดาล", "การประปาส่วนภูมิภาคสาขาสิงห์บุรี", "การประปาส่วนภูมิภาคสาขาอ่างทอง", "การประปาส่วนภูมิภาคสาขาวิเศษชัยชาญ", "การประปาส่วนภูมิภาคสาขาพระนครศรีอยุธยา(ชั้นพิเศษ)", "การประปาส่วนภูมิภาคสาขาผักไห่", "การประปาส่วนภูมิภาคสาขาเสนา", "การประปาส่วนภูมิภาคสาขาท่าเรือ", "การประปาส่วนภูมิภาคสาขาปทุมธานี", "การประปาส่วนภูมิภาคสาขารังสิต(ชั้นพิเศษ)", "การประปาส่วนภูมิภาคสาขานครนายก", "การประปาส่วนภูมิภาคสาขาบ้านนา", "การประปาส่วนภูมิภาคสาขานครราชสีมา", "การประปาส่วนภูมิภาคสาขาปากช่อง", "การประปาส่วนภูมิภาคสาขาครบุรี", "การประปาส่วนภูมิภาคสาขาสีคิ้ว", "การประปาส่วนภูมิภาคสาขาปักธงชัย", "การประปาส่วนภูมิภาคสาขาโชคชัย", "การประปาส่วนภูมิภาคสาขาพิมาย", "การประปาส่วนภูมิภาคสาขาชุมพวง", "การประปาส่วนภูมิภาคสาขาโนนสูง", "การประปาส่วนภูมิภาคสาขาด่านขุนทด", "การประปาส่วนภูมิภาคสาขาคลองหลวง", "การประปาส่วนภูมิภาคสาขาธัญบุรี", "หน่วยงานผู้ช่วยผู้อำนวยการการประปาส่วนภูมิภาคเขต 2", "การประปาส่วนภูมิภาคเขต 3", "การประปาส่วนภูมิภาคสาขาบ้านโป่ง", "การประปาส่วนภูมิภาคสาขาสวนผึ้ง", "การประปาส่วนภูมิภาคสาขาปากท่อ", "การประปาส่วนภูมิภาคสาขาราชบุรี", "การประปาส่วนภูมิภาคสาขาสมุทรสงคราม", "การประปาส่วนภูมิภาคสาขาสมุทรสาคร", "การประปาส่วนภูมิภาคสาขาอ้อมน้อย", "การประปาส่วนภูมิภาคสาขาสามพราน", "การประปาส่วนภูมิภาคสาขาสุพรรณบุรี", "การประปาส่วนภูมิภาคสาขาศรีประจันต์", "การประปาส่วนภูมิภาคสาขาเดิมบางนางบวช", "การประปาส่วนภูมิภาคสาขาด่านช้าง", "การประปาส่วนภูมิภาคสาขาอู่ทอง", "การประปาส่วนภูมิภาคสาขากาญจนบุรี", "การประปาส่วนภูมิภาคสาขาเลาขวัญ", "การประปาส่วนภูมิภาคสาขาพนมทวน", "การประปาส่วนภูมิภาคสาขาท่ามะกา", "การประปาส่วนภูมิภาคสาขาเพชรบุรี", "การประปาส่วนภูมิภาคสาขาประจวบคีรีขันธ์", "การประปาส่วนภูมิภาคสาขาปราณบุรี", "การประปาส่วนภูมิภาคสาขากุยบุรี", "การประปาส่วนภูมิภาคสาขาบางสะพาน", "การประปาส่วนภูมิภาคสาขานครปฐม", "หน่วยงานผู้ช่วยผู้อำนวยการการประปาส่วนภูมิภาคเขต 3", "หน่วยงานรองผู้ว่าการ (ปฏิบัติการ 5)", "สำนักปฏิบัติการ 5", "กองกิจการประปา 5", "การประปาส่วนภูมิภาคเขต 4", "การประปาส่วนภูมิภาคสาขาสุราษฎร์ธานี(ชั้นพิเศษ)", "การประปาส่วนภูมิภาคสาขากาญจนดิษฐ์", "การประปาส่วนภูมิภาคสาขาเกาะสมุย", "การประปาส่วนภูมิภาคสาขาบ้านนาสาร", "การประปาส่วนภูมิภาคสาขาบ้านตาขุน", "การประปาส่วนภูมิภาคสาขาไชยา", "การประปาส่วนภูมิภาคสาขาชุมพร", "การประปาส่วนภูมิภาคสาขาหลังสวน", "การประปาส่วนภูมิภาคสาขาท่าแซะ", "การประปาส่วนภูมิภาคสาขาระนอง", "การประปาส่วนภูมิภาคสาขาพังงา", "การประปาส่วนภูมิภาคสาขาตะกั่วป่า", "การประปาส่วนภูมิภาคสาขาท้ายเหมือง", "การประปาส่วนภูมิภาคสาขาภูเก็ต", "การประปาส่วนภูมิภาคสาขากระบี่", "การประปาส่วนภูมิภาคสาขาอ่าวลึก", "การประปาส่วนภูมิภาคสาขาทุ่งสง", "การประปาส่วนภูมิภาคสาขาชะอวด", "การประปาส่วนภูมิภาคสาขาปากพนัง", "การประปาส่วนภูมิภาคสาขาจันดี", "การประปาส่วนภูมิภาคสาขาขนอม", "การประปาส่วนภูมิภาคสาขานครศรีธรรมราช", "การประปาส่วนภูมิภาคสาขาเกาะพงัน", "การประปาส่วนภูมิภาคสาขาคลองท่อม", "หน่วยงานผู้ช่วยผู้อำนวยการการประปาส่วนภูมิภาคเขต 4", "การประปาส่วนภูมิภาคเขต 5", "การประปาส่วนภูมิภาคสาขาสงขลา", "การประปาส่วนภูมิภาคสาขาหาดใหญ่(ชั้นพิเศษ)", "การประปาส่วนภูมิภาคสาขาสะเดา", "การประปาส่วนภูมิภาคสาขานาทวี", "การประปาส่วนภูมิภาคสาขาระโนด", "การประปาส่วนภูมิภาคสาขาพัทลุง", "การประปาส่วนภูมิภาคสาขาเขาชัยสน", "การประปาส่วนภูมิภาคสาขาตรัง", "การประปาส่วนภูมิภาคสาขาห้วยยอด", "การประปาส่วนภูมิภาคสาขาย่านตาขาว", "การประปาส่วนภูมิภาคสาขากันตัง", "การประปาส่วนภูมิภาคสาขาสตูล", "การประปาส่วนภูมิภาคสาขาละงู", "การประปาส่วนภูมิภาคสาขายะหา", "การประปาส่วนภูมิภาคสาขาเบตง", "การประปาส่วนภูมิภาคสาขาสายบุรี", "การประปาส่วนภูมิภาคสาขานราธิวาส", "การประปาส่วนภูมิภาคสาขารือเสาะ", "การประปาส่วนภูมิภาคสาขาสุไหงโก - ลก", "การประปาส่วนภูมิภาคสาขาพังลา", "หน่วยงานผู้ช่วยผู้อำนวยการการประปาส่วนภูมิภาคเขต 5", "หน่วยงานรองผู้ว่าการ (บริหาร)", "หน่วยงานผู้ช่วยผู้ว่าการ (บริหาร 1)", "สำนักวิทยาการ กปภ.", "กองบริหารองค์ความรู้", "กองวิจัยและพัฒนา", "กองพัฒนาทรัพยากรบุคคล", "กองฝึกอบรมภูมิภาค 1", "กองฝึกอบรมภูมิภาค 2", "กองฝึกอบรมภูมิภาค 3", "ฝ่ายวางแผนและประเมินทรัพยากรบุคคล", "กองแผนกลยุทธ์ทรัพยากรบุคคล", "กองประเมินผลบุคคล", "ฝ่ายบริหารทรัพยากรบุคคล", "กองทรัพยากรบุคคล", "กองบริหารค่าตอบแทน", "กองบริหารกองทุน", "กองกิจการสัมพันธ์", "หน่วยงานผู้ช่วยผู้ว่าการ (บริหาร 2)", "ฝ่ายอำนวยการ", "กองบริการกลาง", "กองจัดหา", "ฝ่ายกฎหมาย", "กองนิติการ", "กองวินัย", "การกองคดี", "กองกฎระเบียบและอุทธรณ์ร้องทุกข์", "หน่วยงานรองผู้ว่าการ (แผนยุทธศาสตร์)", "หน่วยงานผู้ช่วยผู้ว่าการ (แผนยุทธศาสตร์)", "ฝ่ายยุทธศาสตร์องค์กร", "กองแผนและกลยุทธ์", "กองพัฒนาธุรกิจ", "ฝ่ายประเมินผลองค์กร", "กองประเมินคุณภาพองค์กร", "กองประเมินผลการดำเนินงาน", "กองวิเคราะห์และประเมินผลโครงการ", "ฝ่ายแผนงานโครงการ", "กองแผนงานโครงการหลัก", "กองแผนงานโครงการ 1", "กองแผนงานโครงการ 2", "กองจัดเตรียมความพร้อมของแผนงานโครงการ", "ฝ่ายบริหารความเสี่ยง", "กองบริหารความเสี่ยง", "กองควบคุมภายใน", "หน่วยงานรองผู้ว่าการ (การเงิน)", "หน่วยงานผู้ช่วยผู้ว่าการ (การเงิน)", "ฝ่ายการเงินและบัญชี", "กองการเงิน", "กองบัญชี", "กองบริหารทรัพย์สิน", "ฝ่ายวิเคราะห์การเงินและงบประมาณ", "กองวิเคราะห์แผนการเงินองค์กร", "กองงบประมาณ", "หน่วยงานรองผู้ว่าการ (วิชาการ)", "หน่วยงานผู้ช่วยผู้ว่าการ (วิชาการ)", "กองมาตรวัดน้ำ", "ฝ่ายวิศวกรรม", "กองมาตรฐานวิศวกรรม", "กองออกแบบวิศวกรรม", "กองประมาณราคา", "กองจัดเตรียมโครงการ 1", "กองจัดเตรียมโครงการ 2", "ฝ่ายควบคุมการก่อสร้าง", "กองเทคนิคก่อสร้าง", "กองควบคุมการก่อสร้าง 1", "กองควบคุมการก่อสร้าง 2", "กองควบคุมการก่อสร้าง 3", "ฝ่ายทรัพยากรน้ำ", "กองพัฒนาแหล่งน้ำ", "กองควบคุมคุณภาพน้ำ"]
}, {
    "level1": "กระทรวงยุติธรรม",
    "level2": "สำนักงานรัฐมนตรี",
    "level3": ["สำนักงานรัฐมนตรี"]
}, {
    "level1": "กระทรวงยุติธรรม",
    "level2": "สำนักงานปลัดกระทรวงยุติธรรม",
    "level3": ["กองกลาง", "กองการเจ้าหน้าที่", "กองคลัง", "กองการต่างประเทศ", "กองออกแบบและก่อสร้าง", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักกฎหมาย", "สำนักนโยบายและยุทธศาสตร์", "สำนักพัฒนาบุคลากรกระทรวงยุติธรรม", "สำนักบังคับคดีอาญาและบังคับใช้กฎหมาย", "กลุ่มตรวจสอบภายในระดับกระทรวง", "กลุ่มพัฒนาระบบบริหารกระทรวงยุติธรรม", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "สำนักผู้ตรวจราชการกระทรวงยุติธรรม", "สำนักกิจการในพระดำริพระเจ้าหลานเธอ พระองค์เจ้าพัชรกิติยาภา", "สำนักงานกลุ่มภารกิจอำนวยความยุติธรรม", "สำนักงานกลุ่มภารกิจบริหารความยุติธรรม", "สำนักงานกลุ่มภารกิจพัฒนาพฤตินิสัย", "ศูนย์บริการร่วมกระทรวงยุติธรรม", "สำนักงานคณะกรรมการเสริมสร้างความสมานฉันท์แห่งชาติ", "สำนักงานยุติธรรมจังหวัดกระบี่", "สำนักงานยุติธรรมจังหวัดกาญจนบุรี", "สำนักงานยุติธรรมจังหวัดกาฬสินธ์", "สำนักงานยุติธรรมจังหวัดกำแพงเพชร", "สำนักงานยุติธรรมจังหวัดขอนแก่น", "สำนักงานยุติธรรมจังหวัดจันทบุรี", "สำนักงานยุติธรรมจังหวัดฉะเชิงเทรา", "สำนักงานยุติธรรมจังหวัดชลบุรี", "สำนักงานยุติธรรมจังหวัดชัยนาท", "สำนักงานยุติธรรมจังหวัดชัยภูมิ", "สำนักงานยุติธรรมจังหวัดชุมพร", "สำนักงานยุติธรรมจังหวัดเชียงราย", "สำนักงานยุติธรรมจังหวัดเชียงใหม่", "สำนักงานยุติธรรมจังหวัดเชียงใหม่ สาขาฝาง", "สำนักงานยุติธรรมจังหวัดตรัง", "สำนักงานยุติธรรมจังหวัดตราด", "สำนักงานยุติธรรมจังหวัดตาก", "สำนักงานยุติธรรมจังหวัดตาก สาขาแม่สอด", "สำนักงานยุติธรรมจังหวัดนครนายก", "สำนักงานยุติธรรมจังหวัดนครปฐม", "สำนักงานยุติธรรมจังหวัดนครพนม", "สำนักงานยุติธรรมจังหวัดนครราชสีมา", "สำนักงานยุติธรรมจังหวัดนครศรีธรรมราช", "สำนักงานยุติธรรมจังหวัดนครสวรรค์", "สำนักงานยุติธรรมจังหวัดนนทบุรี", "สำนักงานยุติธรรมจังหวัดนราธิวาส", "สำนักงานยุติธรรมจังหวัดน่าน", "สำนักงานยุติธรรมจังหวัดบุรีรัมย์", "สำนักงานยุติธรรมจังหวัดบึงกาฬ", "สำนักงานยุติธรรมจังหวัดปทุมธานี", "สำนักงานยุติธรรมจังหวัดประจวบคีรีขันธ์", "สำนักงานยุติธรรมจังหวัดปราจีนบุรี", "สำนักงานยุติธรรมจังหวัดปัตตานี", "สำนักงานยุติธรรมจังหวัดพระนครศรีอยุธยา", "สำนักงานยุติธรรมจังหวัดพะเยา", "สำนักงานยุติธรรมจังหวัดพังงา", "สำนักงานยุติธรรมจังหวัดพัทลุง", "สำนักงานยุติธรรมจังหวัดพิจิตร", "สำนักงานยุติธรรมจังหวัดพิษณุโลก", "สำนักงานยุติธรรมจังหวัดเพชรบุรี", "สำนักงานยุติธรรมจังหวัดเพชรบูรณ์", "สำนักงานยุติธรรมจังหวัดแพร่", "สำนักงานยุติธรรมจังหวัดภูเก็ต", "สำนักงานยุติธรรมจังหวัดมหาสารคาม", "สำนักงานยุติธรรมจังหวัดมุกดาหาร", "สำนักงานยุติธรรมจังหวัดแม่ฮ่องสอน", "สำนักงานยุติธรรมจังหวัดยโสธร", "สำนักงานยุติธรรมจังหวัดยะลา", "สำนักงานยุติธรรมจังหวัดยะลา สาขาเบตง", "สำนักงานยุติธรรมจังหวัดร้อยเอ็ด", "สำนักงานยุติธรรมจังหวัดระนอง", "สำนักงานยุติธรรมจังหวัดระยอง", "สำนักงานยุติธรรมจังหวัดราชบุรี", "สำนักงานยุติธรรมจังหวัดลพบุรี", "สำนักงานยุติธรรมจังหวัดลำปาง", "สำนักงานยุติธรรมจังหวัดลำพูน", "สำนักงานยุติธรรมจังหวัดเลย", "สำนักงานยุติธรรมจังหวัดศรีสะเกษ", "สำนักงานยุติธรรมจังหวัดสกลนคร", "สำนักงานยุติธรรมจังหวัดสงขลา", "สำนักงานยุติธรรมจังหวัดสตูล", "สำนักงานยุติธรรมจังหวัดสมุทรปราการ", "สำนักงานยุติธรรมจังหวัดสมุทรสงคราม", "สำนักงานยุติธรรมจังหวัดสมุทรสาคร", "สำนักงานยุติธรรมจังหวัดสระแก้ว", "สำนักงานยุติธรรมจังหวัดสระบุรี", "สำนักงานยุติธรรมจังหวัดสิงห์บุรี", "สำนักงานยุติธรรมจังหวัดสุโขทัย", "สำนักงานยุติธรรมจังหวัดสุพรรณบุรี", "สำนักงานยุติธรรมจังหวัดสุราษฎร์ธานี", "สำนักงานยุติธรรมจังหวัดสุราษฎร์ธานี สาขาเกาะสมุย", "สำนักงานยุติธรรมจังหวัดสุรินทร์", "สำนักงานยุติธรรมจังหวัดสุรินทร์ สาขารัตนบุรี", "สำนักงานยุติธรรมจังหวัดหนองคาย", "สำนักงานยุติธรรมจังหวัดหนองบัวลำภู", "สำนักงานยุติธรรมจังหวัดอ่างทอง", "สำนักงานยุติธรรมจังหวัดอำนาจเจริญ", "สำนักงานยุติธรรมจังหวัดอุดรธานี", "สำนักงานยุติธรรมจังหวัดอุตรดิตถ์", "สำนักงานยุติธรรมจังหวัดอุทัยธานี", "สำนักงานยุติธรรมจังหวัดอุบลราชธานี", "สถาบันเพื่อการยุติธรรมแห่งประเทศไทย (TIJ)", "สำนักงานบริหารโครงการศูนย์การเรียนรู้ระหว่างประเทศด้านกระบวนการยุติธรรม", "สำนักงานประสานงานคณะรักษาความสงบแห่งชาติ", "ศูนย์อำนวยการวิเคราะห์พยานหลักฐานและการข่าว", "สำนักงานกองทุนยุติธรรม", "สำนักงานส่งเสริมสัมมาชีพและผลิตภัณฑ์เพื่อการพัฒนาพฤตินิสัย", "กลุ่มขับเคลื่อนการปฏิรูปประเทศ ยุทธศาสตร์ชาติ และการสร้างความสามัคคีปรองดองกระทรวงยุติธรรม"]
}, {
    "level1": "กระทรวงยุติธรรม",
    "level2": "กรมคุมประพฤติ",
    "level3": ["สำนักงานเลขานุการกรม", "กองกิจการชุมชนและบริการสังคม", "กองบริหารทรัพยากรบุคคล", "กองแผนงานและสารสนเทศ", "กองพัฒนาการฟื้นฟูสมรรถภาพผู้ติดยาเสพติด", "ศูนย์ฟื้นฟูสมรรถภาพผู้ติดยาเสพติด (ลาดหลุมแก้ว)", "สำนักงานคุมประพฤติกรุงเทพมหานคร 1", "สำนักงานคุมประพฤติกรุงเทพมหานคร 2", "สำนักงานคุมประพฤติกรุงเทพมหานคร 3", "สำนักงานคุมประพฤติกรุงเทพมหานคร 4", "สำนักงานคุมประพฤติกรุงเทพมหานคร 5", "สำนักพัฒนาการคุมประพฤติ", "กลุ่มตรวจสอบภายใน (จัดตั้งขึ้นตามมติคณะรัฐมนตรีกำหนดให้ส่วนราชการตั้งหน่วยงานนี้)", "กลุ่มพัฒนาระบบบริหาร (หน่วยงานที่ถูกกำหนดให้มีตามหนังสือสำนักงาน ก.พ. ที่ นร 1009.4/10 ลงวันที่ 10 ต.ค.2545)", "กลุ่มงานคุ้มครองจริยธรรม (จัดตั้งตามประมวลจริยธรรมข้าราชการพลเรือน)", "สำนักตรวจราชการกรมคุมประพฤติ", "สำนักงานคุมประพฤติกรุงเทพมหานคร 6", "สำนักงานคุมประพฤติกรุงเทพมหานคร 7", "สำนักงานคุมประพฤติกรุงเทพมหานคร 8", "สำนักงานคุมประพฤติกรุงเทพมหานคร 9", "สำนักงานคุมประพฤติกรุงเทพมหานคร 10", "สำนักงานคุมประพฤติกรุงเทพมหานคร 11", "สำนักงานคุมประพฤติกรุงเทพมหานคร 12", "ศูนย์ฟื้นฟูสมรรถภาพผู้ติดยาเสพติด ปัตตานี", "ศูนย์เทคโนโลยีสารสนเทศเพื่อสนับสนุนการคุมประพฤติ"]
}, {
    "level1": "กระทรวงยุติธรรม",
    "level2": "กรมคุ้มครองสิทธิและเสรีภาพ",
    "level3": ["สำนักงานเลขานุการกรม", "กองพิทักษ์สิทธิและเสรีภาพ", "กองส่งเสริมการระงับข้อพิพาท", "กองส่งเสริมสิทธิและเสรีภาพ", "สำนักงานคุ้มครองพยาน", "สำนักงานช่วยเหลือทางการเงินแก่ผู้เสียหายหรือจำเลยในคดีอาญา", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มนิติการ", "กลุ่มงานผู้เชี่ยวชาญ", "กองส่งเสริมมาตรฐานการคุ้มครองสิทธิและเสรีภาพ", "สำนักงานคุ้มครองสิทธิและเสรีภาพพื้นที่ 1", "สำนักงานคุ้มครองสิทธิและเสรีภาพพื้นที่ 2", "สำนักงานคุ้มครองสิทธิและเสรีภาพพื้นที่ 3", "สำนักงานคุ้มครองสิทธิและเสรีภาพพื้นที่ 4", "กองแผนสิทธิมนุษยชนแห่งชาติและสารสนเทศ", "กองสิทธิมนุษยชนระหว่างประเทศ"]
}, {
    "level1": "กระทรวงยุติธรรม",
    "level2": "กรมบังคับคดี",
    "level3": ["สำนักงานเลขานุการกรม", "กองติดตามและเฉลี่ยทรัพย์สินในคดีล้มละลาย", "กองบังคับคดีล้มละลาย 1", "กองบังคับคดีล้มละลาย 2", "กองบังคับคดีล้มละลาย 3", "กองบังคับคดีล้มละลาย 4", "กองบังคับคดีล้มละลาย 5", "กองบังคับคดีล้มละลาย 6", "กองบริหารการคลัง", "กองบริหารทรัพยากรบุคคล", "กองพัฒนาระบบการบังคับคดีและประเมินราคาทรัพย์", "สำนักงานบังคับคดีแพ่งกรุงเทพมหานคร 1", "สำนักงานบังคับคดีแพ่งกรุงเทพมหานคร 2", "สำนักงานบังคับคดีแพ่งกรุงเทพมหานคร 3", "สำนักงานบังคับคดีแพ่งกรุงเทพมหานคร 4", "สำนักงานบังคับคดีแพ่งกรุงเทพมหานคร 5", "สำนักงานบังคับคดีแพ่งกรุงเทพมหานคร 6", "สำนักฟื้นฟูกิจการของลูกหนี้", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์สารสนเทศ", "สำนักผู้ตรวจราชการกรม", "กลุ่มงานคุ้มครองจริยธรรม", "ศูนย์ไกล่เกลี่ยข้อพิพาท", "สถาบันวิชาชีพบังคับคดีแพ่งและล้มละลาย"]
}, {
    "level1": "กระทรวงยุติธรรม",
    "level2": "กรมพินิจและคุ้มครองเด็กและเยาวชน",
    "level3": ["สำนักงานเลขานุการกรม", "ศูนย์ฝึกและอบรมเด็กและเยาวชนชายบ้านกรุณา", "ศูนย์ฝึกและอบรมเด็กและเยาวชนชายบ้านมุทิตา", "ศูนย์ฝึกและอบรมเด็กและเยาวชนชายบ้านอุเบกขา", "ศูนย์ฝึกและอบรมเด็กและเยาวชนหญิงบ้านปรานี", "ศูนย์ฝึกและอบรมเด็กและเยาวชนสิรินธร", "ศูนย์ฝึกและอบรมเด็กและเยาวชนบ้านกาญจนาภิเษก", "ศูนย์ฝึกและอบรมเด็กและเยาวชนชายบ้านบึง", "ศูนย์ฝึกและอบรมเด็กและเยาวชนจังหวัดพระนครศรีอยุธยา", "ศูนย์ฝึกและอบรมเด็กและเยาวชนจังหวัดลพบุรี", "ศูนย์ฝึกและอบรมเด็กและเยาวชนเขต 1", "ศูนย์ฝึกและอบรมเด็กและเยาวชนเขต 2", "ศูนย์ฝึกและอบรมเด็กและเยาวชนเขต 3", "ศูนย์ฝึกและอบรมเด็กและเยาวชนเขต 4", "ศูนย์ฝึกและอบรมเด็กและเยาวชนเขต 5", "ศูนย์ฝึกและอบรมเด็กและเยาวชนเขต 6", "ศูนย์ฝึกและอบรมเด็กและเยาวชนเขต 7", "ศูนย์ฝึกและอบรมเด็กและเยาวชนเขต 8", "ศูนย์ฝึกและอบรมเด็กและเยาวชนเขต 9", "สถานพินิจและคุ้มครองเด็กและเยาวชนกรุงเทพมหานคร", "ศูนย์แรกรับเด็กและเยาวชนชายบ้านเมตตา", "สถานแรกรับเด็กและเยาวชนหญิงบ้านปรานี", "สถานพินิจและคุ้มครองเด็กและเยาวชนกรุงเทพมหานคร (หน่วยบริการมีนบุรี)", "สถานพินิจและคุ้มครองเด็กและเยาวชนกรุงเทพมหานคร (หน่วยบริการธนบุรี)", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดนนทบุรี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดปทุมธานี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดสมุทรปราการ", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดนครนายก", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดฉะเชิงเทรา", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดระยอง", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดชลบุรี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดจันทบุรี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดตราด", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดปราจีนบุรี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดสระแก้ว", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดราชบุรี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดกาญจนบุรี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดกาญจนบุรี (หน่วยบริการทองผาภูมิ)", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดนครปฐม", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดสุพรรณบุรี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดสมุทรสาคร", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดเพชรบุรี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดสมุทรสงคราม", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดประจวบคีรีขันธ์", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดนครราชสีมา", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดบุรีรัมย์", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดสระบุรี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดชัยภูมิ", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดสุรินทร์", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดขอนแก่น", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดมหาสารคาม", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดอุดรธานี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดเลย", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดสกลนคร", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดหนองคาย", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดหนองบัวลำภู", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดร้อยเอ็ด", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดกาฬสินธุ์", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดบึงกาฬ", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดอุบลราชธานี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดนครพนม", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดอำนาจเจริญ", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดมุกดาหาร", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดยโสธร", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดศรีสะเกษ", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดนครสวรรค์", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดสุโขทัย", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดพิษณุโลก", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดเพชรบูรณ์", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดพระนครศรีอยุธยา", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดอ่างทอง", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดสิงห์บุรี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดลพบุรี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดชัยนาท", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดพิจิตร", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดกำแพงเพชร", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดตาก", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดตาก (หน่วยบริการแม่สอด)", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดอุทัยธานี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดเชียงใหม่", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดเชียงใหม่ (หน่วยบริการฝาง)", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดลำปาง", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดลำพูน", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดเชียงราย", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดพะเยา", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดแม่ฮ่องสอน", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดแพร่", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดน่าน", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดอุตรดิตถ์", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดสุราษฎร์ธานี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดสุราษฎร์ธานี (หน่วยบริการเกาะสมุย)", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดภูเก็ต", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดนครศรีธรรมราช", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดชุมพร", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดระนอง", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดพังงา", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดพังงา (หน่วยบริการตะกั่วป่า)", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดกระบี่", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดสงขลา", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดตรัง", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดสตูล", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดปัตตานี", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดนราธิวาส", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดพัทลุง", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดยะลา", "สถานพินิจและคุ้มครองเด็กและเยาวชนจังหวัดยะลา (หน่วยบริการเบตง)", "สำนักพัฒนาระบบงานยุติธรรมเด็กและเยาวชน", "กลุ่มผู้ตรวจราชการกรม", "กลุ่มตรวจสอบภายใน", "สถาบันพัฒนาบุคลากรในกระบวนการยุติธรรมเด็กและเยาวชน", "กลุ่มพัฒนาระบบบริหาร", "กองบริหารทรัพยากรบุคคล", "กลุ่มงานคลัง", "กองแผนงานและงบประมาณ", "ศูนย์เทคโนโลยีสารสนเทศ", "ศูนย์ฝึกและอบรมเด็กและเยาวชน เขต 10", "ผู้เชี่ยวชาญกรมพินิจและคุ้มครองเด็กและเยาวชน", "สำนักงานเลขานุการคณะกรรมการอำนวยการศูนย์ฯ (ศอ.กต.)", "สถาบันวิจัยและพัฒนา", "ศูนย์ฝึกและอบรมเด็กและเยาวชนนราธิวาส", "กองวิทยาศาสตร์งานยุติธรรมเด็กและเยาวชน", "สำนักผู้บริหาร"]
}, {
    "level1": "กระทรวงยุติธรรม",
    "level2": "กรมราชทัณฑ์",
    "level3": ["สำนักงานเลขานุการกรม", "กองการเจ้าหน้าที่", "กองคลัง", "สำนักพัฒนาพฤตินิสัย", "สำนักทัณฑวิทยา", "สำนักทัณฑปฏิบัติ", "สถาบันพัฒนาข้าราชการราชทัณฑ์", "กองบริการทางการแพทย์", "หน่วยตรวจสอบภายใน", "สำนักผู้ตรวจราชการกรม", "กองนิติการ", "กองแผนงาน", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มงานคุ้มครองจริยธรรมของกรมราชทัณฑ์", "กองสังคมสงเคราะห์", "สำนักผู้เชี่ยวชาญเฉพาะด้านทัณฑวิทยา", "สำนักพัฒนาระบบงานราชทัณฑ์", "เรือนจำพิเศษกรุงเทพมหานคร", "เรือนจำพิเศษมีนบุรี", "เรือนจำพิเศษธนบุรี", "เรือนจำพิเศษพัทยา", "เรือนจำกลางบางขวาง", "เรือนจำกลางคลองเปรม", "เรือนจำกลางสมุทรปราการ", "เรือนจำกลางชลบุรี", "เรือนจำกลางนครปฐม", "เรือนจำกลางพระนครศรีอยุธยา", "เรือนจำกลางฉะเชิงเทรา", "เรือนจำกลางราชบุรี", "เรือนจำกลางคลองไผ่", "เรือนจำกลางอุบลราชธานี", "เรือนจำกลางนครราชสีมา", "เรือนจำกลางอุดรธานี", "เรือนจำกลางขอนแก่น", "เรือนจำกลางเชียงใหม่", "เรือนจำกลางเชียงราย", "เรือนจำกลางพิษณุโลก", "เรือนจำกลางนครสวรรค์", "เรือนจำกลางลำปาง", "เรือนจำกลางนครศรีธรรมราช", "เรือนจำกลางสงขลา", "เรือนจำกลางลพบุรี", "เรือนจำกลางพัทลุง", "เรือนจำกลางสุราษฎร์ธานี", "เรือนจำกลางยะลา", "เรือนจำกลางระยอง", "เรือนจำกลางกำแพงเพชร", "เรือนจำกลางเขาบิน", "เรือนจำกลางสุรินทร์", "เรือนจำกลางปัตตานี", "เรือนจำกลางสมุทรสงคราม", "เรือนจำกลางนครพนม", "เรือนจำกลางเพชรบุรี", "เรือนจำกลางตาก", "ทัณฑสถานวัยหนุ่มกลาง", "ทัณฑสถานวัยหนุ่มพระนครศรีอยุธยา", "ทัณฑสถานวัยหนุ่มนครศรีธรรมราช", "ทัณฑสถานบำบัดพิเศษกลาง", "ทัณฑสถานบำบัดพิเศษจังหวัดปทุมธานี", "ทัณฑสถานบำบัดพิเศษสงขลา", "ทัณฑสถานบำบัดพิเศษพระนครศรีอยุธยา", "ทัณฑสถานบำบัดพิเศษขอนแก่น", "ทัณฑสถานบำบัดพิเศษหญิง", "ทัณฑสถานบำบัดพิเศษลำปาง", "ทัณฑสถานหญิงกลาง", "ทัณฑสถานหญิงสงขลา", "ทัณฑสถานหญิงพิษณุโลก", "ทัณฑสถานหญิงชลบุรี", "ทัณฑสถานหญิงธนบุรี", "ทัณฑสถานหญิงเชียงใหม่", "ทัณฑสถานหญิงนครราชสีมา", "ทัณฑสถานโรงพยาบาลราชทัณฑ์", "ทัณฑสถานเกษตรอุตสาหกรรมเขาพริก", "ทัณฑสถานเปิดห้วยโป่ง", "ทัณฑสถานเปิดหนองน้ำขุ่น", "ทัณฑสถานเปิดบ้านนาวง", "ทัณฑสถานเปิดทุ่งเบญจา", "ทัณฑสถานเปิดบ้านเนินสูง", "สถานกักขังกลางจังหวัดปทุมธานี", "สถานกักขังกลางจังหวัดตราด", "สถานกักขังกลางจังหวัดนครศรีธรรมราช", "สถานกักขังกลางจังหวัดร้อยเอ็ด", "สถานกักขังกลางจังหวัดลำปาง", "สถานกักกันนครปฐม"]
}, {
    "level1": "กระทรวงยุติธรรม",
    "level2": "กรมสอบสวนคดีพิเศษ",
    "level3": ["สำนักงานเลขานุการกรม", "กองกฎหมาย", "กองกิจการต่างประเทศและคดีอาชญากรรมระหว่างประเทศ", "กองคดีการค้ามนุษย์", "กองคดีการเงินการธนาคารและการฟอกเงิน", "กองคดีความผิดเกี่ยวกับการเสนอราคาต่อหน่วยงานของรัฐ", "กองคดีความมั่นคง", "กองคดีคุ้มครองผู้บริโภค", "กองคดีทรัพยากรธรรมชาติและสิ่งแวดล้อม", "กองคดีทรัพย์สินทางปัญญา", "กองคดีเทคโนโลยีและสารสนเทศ", "กองคดีธุรกิจการเงินนอกระบบ", "กองคดีภาษีอากร", "กองเทคโนโลยีและศูนย์ข้อมูลการตรวจสอบ", "กองนโยบายและยุทธศาสตร์", "กองบริหารคดีพิเศษ", "กองปฏิบัติการคดีพิเศษภาค", "กองปฏิบัติการพิเศษ", "กองพัฒนาและสนับสนุนคดีพิเศษ", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "สำนักงานอธิบดีกรมสอบสวนคดีพิเศษ", "สำนักงานรองอธิบดีกรมสอบสวนคดีพิเศษ 1", "สำนักงานรองอธิบดีกรมสอบสวนคดีพิเศษ 2", "สำนักงานรองอธิบดีกรมสอบสวนคดีพิเศษ 3", "สำนักงานรองอธิบดีกรมสอบสวนคดีพิเศษ 4", "สำนักงานผู้เชี่ยวชาญเฉพาะด้านคดีพิเศษ", "ศูนย์ปฏิบัติการสืบสวนสอบสวนอาชญากรรมพิเศษ", "ศูนย์เสริมสร้างภาพลักษณ์องค์กร กรมสอบสวนคดีพิเศษ"]
}, {
    "level1": "กระทรวงยุติธรรม",
    "level2": "สำนักงานกิจการยุติธรรม",
    "level3": ["สำนักงานเลขานุการกรม", "กองงานคณะกรรมการการพัฒนาการบริหารงานยุติธรรมแห่งชาติ", "สถาบันพัฒนาบุคลากรในกระบวนการยุติธรรม", "สถาบันวิจัยและพัฒนากระบวนการยุติธรรม", "สำนักนโยบายและประสานแผนกระบวนการยุติธรรม", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "กลุ่มสื่อสารองค์กร", "สำนักเทคโนโลยีสารสนเทศและการสื่อสารกระบวนการยุติธรรม", "ส่วนนโยบายและยุทธศาสตร์ยุติธรรมชุมชนและยุติธรรมจังหวัด"]
}, {
    "level1": "กระทรวงยุติธรรม",
    "level2": "สถาบันนิติวิทยาศาสตร์",
    "level3": ["สำนักงานเลขานุการกรม", "ศูนย์สารสนเทศนิติวิทยาศาสตร์", "กองส่งเสริมและพัฒนางานนิติวิทยาศาสตร์", "กองนิติวิทยาศาสตร์บริการ", "กองบุคคลสูญหายและศพนิรนาม", "กองปฏิบัติการทางนิติวิทยาศาสตร์", "กองตรวจพิสูจน์ทางวิทยาศาสตร์", "กองสารพันธุกรรม", "สำนักมาตรฐานนิติวิทยาศาสตร์", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มกฎหมายและนิติการ", "กลุ่มคุ้มครองจริยธรรม"]
}, {
    "level1": "กระทรวงยุติธรรม",
    "level2": "สำนักงานคณะกรรมการป้องกันและปราบปรามยาเสพติด",
    "level3": ["สำนักงานเลขานุการกรม", "กองกฎหมาย", "ศูนย์เทคโนโลยีและสารสนเทศ", "สถาบันพัฒนาบุคลากรด้านการป้องกันและปราบรามยาเสพติด", "สถาบันวิชาการและตรวจพิสูจน์ยาเสพติด", "สถาบันสำรวจและติดตามการปลูกพืชเสพติด", "สำนักการต่างประเทศ", "สำนักงานป้องกันและปราบปรามยาเสพติดกรุงเทพมหานคร", "สำนักงานป้องกันและปราบปรามยาเสพติด ภาค 1", "สำนักงานป้องกันและปราบปรามยาเสพติด ภาค 2", "สำนักงานป้องกันและปราบปรามยาเสพติด ภาค 3", "สำนักงานป้องกันและปราบปรามยาเสพติด ภาค 4", "สำนักงานป้องกันและปราบปรามยาเสพติด ภาค 5", "สำนักงานป้องกันและปราบปรามยาเสพติด ภาค 6", "สำนักงานป้องกันและปราบปรามยาเสพติด ภาค 7", "สำนักงานป้องกันและปราบปรามยาเสพติด ภาค 8", "สำนักงานป้องกันและปราบปรามยาเสพติด ภาค 9", "สำนักตรวจสอบทรัพย์สินคดียาเสพติด", "สำนักปราบปรามยาเสพติด", "สำนักพัฒนาการป้องกันและแก้ไขปัญหายาเสพติด", "สำนักยุทธศาสตร์", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร"]
}, {
    "level1": "กระทรวงแรงงาน",
    "level2": "สำนักงานปลัดกระทรวงแรงงาน",
    "level3": ["กองกลาง", "กองกฎหมาย", "กองบริหารการคลัง", "กองบริหารทรัพยากรบุคคล", "กองเผยแพร่และประชาสัมพันธ์", "กองยุทธศาสตร์และแผนงาน", "กองเศรษฐกิจการแรงงาน", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักตรวจและประเมินผล", "สำนักประสานความร่วมมือระหว่างประเทศ", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์ปฏิบัติการต่อต้านการทุจริต"]
}, {
    "level1": "กระทรวงแรงงาน",
    "level2": "กรมการจัดหางาน",
    "level3": ["สำนักงานเลขานุการกรม", "กองทะเบียนจัดหางานกลางและคุ้มครองคนหางาน", "กองนิติการ", "กองบริหารข้อมูลตลาดแรงงาน", "กองบริหารทรัพยากรบุคคล", "กองบริหารแรงงานไทยไปต่างประเทศ", "กองพัฒนาระบบบริการจัดหางาน", "กองยุทธศาสตร์และแผนงาน", "กองส่งเสริมการมีงานทำ", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักบริหารแรงงานต่างด้าว", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร"]
}, {
    "level1": "กระทรวงแรงงาน",
    "level2": "กรมพัฒนาฝีมือแรงงาน",
    "level3": ["กองบริหารทรัพยากรบุคคล", "กองแผนงานและสารสนเทศ", "กองพัฒนาศักยภาพแรงงานและผู้ประกอบกิจการ", "กองส่งเสริมการพัฒนาฝีมือแรงงาน", "สำนักพัฒนาผู้ฝึกและเทคโนโลยีการฝึก", "กลุ่มกฎหมาย", "กลุ่มพัฒนาระบบบริหาร", "กองยุทธศาสตร์และเครือข่ายพัฒนาฝีมือแรงงาน"]
}, {
    "level1": "กระทรวงแรงงาน",
    "level2": "กรมสวัสดิการและคุ้มครองแรงงาน",
    "level3": ["สำนักงานเลขานุการกรม", "สำนักตรวจราชการกรม", "กองคุ้มครองแรงงาน", "กองคุ้มครองแรงงานนอกระบบ", "กองความปลอดภัยแรงงาน", "กองนิติการ", "กองบริหารการคลัง", "กองการเจ้าหน้าที่", "กองสวัสดิการแรงงาน", "สำนักพัฒนามาตรฐานแรงงาน", "สำนักแรงงานสัมพันธ์", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร"]
}, {
    "level1": "กระทรวงแรงงาน",
    "level2": "สำนักงานประกันสังคม",
    "level3": ["สำนักงานเลขานุการกรม", "กองกฎหมาย", "กองคลัง", "กองนโยบายและแผนงาน", "กองบริหารการเงินและการบัญชี", "กองบริหารการลงทุน", "กองบริหารทรัพยากรบุคคล", "ศูนย์ฟื้นฟูสมรรถภาพคนงานภาค 1", "ศูนย์ฟื้นฟูสมรรถภาพคนงานภาค 2", "ศูนย์ฟื้นฟูสมรรถภาพคนงานภาค 4", "ศูนย์ฟื้นฟูสมรรถภาพคนงานภาค 3", "ศูนย์ฟื้นฟูสมรรถภาพคนงานภาค 5", "สำนักงานประกันสังคมกรุงเทพมหานครพื้นที่ 1", "สำนักงานประกันสังคมกรุงเทพมหานครพื้นที่ 2", "สำนักงานประกันสังคมกรุงเทพมหานครพื้นที่ 3", "สำนักงานประกันสังคมกรุงเทพมหานครพื้นที่ 4", "สำนักงานประกันสังคมกรุงเทพมหานครพื้นที่ 5", "สำนักงานประกันสังคมกรุงเทพมหานครพื้นที่ 6", "สำนักงานประกันสังคมกรุงเทพมหานครพื้นที่ 7", "สำนักงานประกันสังคมกรุงเทพมหานครพื้นที่ 8", "สำนักงานประกันสังคมกรุงเทพมหานครพื้นที่ 9", "สำนักงานประกันสังคมกรุงเทพมหานครพื้นที่ 10", "สำนักงานประกันสังคมกรุงเทพมหานครพื้นที่ 11", "สำนักงานประกันสังคมกรุงเทพมหานครพื้นที่ 12", "สำนักเงินสมทบ", "สำนักจัดระบบบริการทางการแพทย์", "สำนักตรวจสอบ", "สำนักบริหารเทคโนโลยีสารสนเทศ", "สำนักสิทธิประโยชน์", "สำนักเสริมสร้างความมั่นคงแรงงานนอกระบบ", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กองวิจัยและพัฒนา", "กองฝึกอบรม", "ศูนย์สารนิเทศ", "สำนักงานกองทุนเงินทดแทน"]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": "สำนักงานปลัดกระทรวงสาธารณสุข",
    "level3": ["กองกลาง", "กองกฏหมาย", "กองการต่างประเทศ", "กองการพยาบาล", "กองตรวจราชการ", "กองบริหารการคลัง", "กองบริหารการสาธารณสุข", "กองบริหารทรัพยากรบุคคล", "กองยุทธศาสตร์และแผนงาน", "กองเศรษฐกิจสุขภาพและหลักประกันสุขภาพ", "กองสาธารณสุขฉุกเฉิน", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สถาบันพระบรมราชชนก", "กลุ่มตรวจสอบภายใน สำนักงานปลัดกระทรวงสาธารณสุข", "กลุ่มตรวจสอบภายในระดับกระทรวง", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์ปฏิบัติการต่อต้านการทุจริต กระทรวงสาธารณสุข", "กลุ่มเสริมสร้างวินัยและระบบคุณธรรม", "สำนักวิชาการสาธารณสุข", "สำนักงานบริหารโครงการร่วมผลิตแพทย์เพิ่มเพื่อชาวชนบท", "ศูนย์สันติวิธีสาธารณสุข", "ศุนย์บริหารการพัฒนาสุขภาพจังหวัดชายแดนใต้", "สำนักสารนิเทศ", "สำนักงานบริหารยุทธศาสตร์สุขภาพดีวิถีชีวิตไทย", "สำนักส่งเสริมและสนับสนุนอาหารปลอดภัย", "สำนักงานเขตสุขภาพที่ 1", "สำนักงานเขตสุขภาพที่ 2", "สำนักงานเขตสุขภาพที่ 3", "สำนักงานเขตสุขภาพที่ 4", "สำนักงานเขตสุขภาพที่ 5", "สำนักงานเขตสุขภาพที่ 6", "สำนักงานเขตสุขภาพที่ 7", "สำนักงานเขตสุขภาพที่ 8", "สำนักงานเขตสุขภาพที่ 9", "สำนักงานเขตสุขภาพที่ 10", "สำนักงานเขตสุขภาพที่ 11", "สำนักงานเขตสุขภาพที่ 12", "สำนักงานเขตสุขภาพที่ 13", "สำนักงานสนับสนุนระบบปฐมภูมิและคลินิกหมอครอบครัว", "ศูนย์อำนวยการป้องกันและปราบปรามยาเสพติด กระทรวงสาธารณสุข", "ศูนย์บริหารจัดการเรื่องราวร้องทุกข์ กระทรวงสาธารณสุข", "สำนักงานพัฒนานโยบายสุขภาพระหว่างประเทศ", "ศูนย์ความร่วมมือไทย - สหรัฐ ด้านสาธารณสุข"]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": "กรมการแพทย์",
    "level3": ["สำนักเลขานุการกรม", "กองคลัง", "โรงพยาบาลนพรัตนราชธานี", "โรงพยาบาลเมตตาประชารักษ์ (วัดไร่ขิง)", "โรงพยาบาลราชวิถี", "สถาพยาบาลกระทรวงสาธารณสุข", "โรงพยาบาลเลิดสิน", "โรงพยาบาลสงฆ์", "สถาบันสิรินธรเพื่อการฟื้นฟูสมรรถภาพทางการแพทย์แห่งชาติ", "โรงพยาบาลฟื้นฟูสมรรถภาพทางการแพทย์ลำปาง", "สถาบันทันตกรรม", "สถาบันประสาทวิทยา", "โรงพยาบาลประสาทเชียงใหม่", "สถาบันพยาธิวิทยา", "สถาบันมะเร็งแห่งชาติ", "โรงพยาบาลมะเร็งชลบุรี", "โรงพยาบาลมะเร็งลพบุรี", "โรงพยาบาลมะเร็งลำปาง", "โรงพยาบาลมะเร็งอุบลราชธานี", "โรงพยาบาลมะเร็งอุดรธานี", "โรงพยาบาลมะเร็งสุราษฎร์ธานี", "โรงพยาบาลมหาวชิราลงกรณธัญบุรี", "สถาบันบำบัดรักษาและฟื้นฟูผู้ติดยาเสพติดแห่งชาติบรมราชชนนี", "โรงพยาบาลธัญญารักษ์เชียงใหม่", "โรงพยาบาลธัญญารักษ์สงขลา", "โรงพยาบาลธัญญารักษ์ขอนแก่น", "โรงพยาบาลธัญญารักษ์ปัตตานี", "โรงพยาบาลธัญญารักษ์แม่ฮ่องสอน", "โรงพยาบาลธัญญารักษ์อุดรธานี", "สถาบันโรคทรวงอก", "สถาบันโรคผิวหนัง", "โรงพยาบาลโรคผิวหนังเขตร้อนภาคใต้ จังหวัดตรัง", "สถาบันวิจัยและประเมินเทคโนโลยีทางการแพทย์", "สถาบันเวชศาสตร์สมเด็จพระสังฆราชญาณสังวรเพื่อผู้สูงอายุ", "โรงพยาบาลสมเด็จพระสังฆราชญาณสังวร เพื่อผู้สูงอายุ จังหวัดชลบุรี", "สถาบันสุขภาพเด็กแห่งชาติมหาราชินี", "สำนักบริหารทรัพยากรบุคคล", "สำนักยุทธศาสตร์การแพทย์", "สำนักโครงการศูนย์การแพทย์เฉพาะทาง กรมการแพทย์", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒาระบบบริหาร", "สำนักสารสนเทศการแพทย์", "สถาบันร่วมผลิตแพทย์ กรมการแพทย์-มหาวิทยาลัยรังสิต", "ศูนย์แพทย์ศาสตร์ชั้นคลินิก โรงพยาบาลราชวิถีและสถาบันสุขภาพเด็กมหาราชินี", "ศูนย์แพทย์ศาสตร์ชั้นคลินิก โรงพยาบาลเลิดสิน", "สำนักวิชาการแพทย์", "สำนักกฎหมายการแพทย์", "สถาบันเวชศาสตร์การออกกำลังกายและการกีฬา", "สำนักนิเทศระบบการแพทย์"]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": "กรมควบคุมโรค",
    "level3": ["สำนักเลขานุการกรม", "กองการเจ้าหน้าที่", "กองคลัง", "กองแผนงาน", "สถาบันบำราศนราดูร", "สถาบันราชประชาสมาสัย", "สำนักงานคณะกรรมการควบคุมเครื่องดื่มแอลกอฮอล์", "สำนักระบาดวิทยา", "สำนักโรคจากกการประกอบอาชีพและสิ่งแวดล้อม", "สำนักโรคติดต่อทั่วไป", "สำนักโรคติดต่อนำโดยแมลง", "สำนักโรคไม่ติดต่อ", "สำนักโรคเอดส์ วัณโรค และโรคติดต่อทางเพศสัมพันธ์", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "สำนักงานโครงการศึกษาวัคซีนเอดส์ทดลอง", "สำนักงานบริหารโครงการกองทุนโลก", "สำนักสื่อสารความเสี่ยงและพัฒาพฤติกรรมสุขภาพ", "สถาบันวิจัย จัดการความรู้และมาตรฐานการควบคุมโรค", "สำนักวัณโรค", "ศูนย์สารสนเทศ", "สำนักควบคุมการบริโภคยาสูบ", "สำนักงานความร่วมมือระหว่างประเทศ", "สำนักงานคณะกรรมการผู้ทรงคุณวุฒิ", "ศูนย์กฎหมาย", "กลุ่มคุ้มครองจริยธรรม", "สำนักงานป้องกันควบคุมโรคที่ 1 เชียงใหม่", "สำนักงานป้องกันควบคุมโรคที่ 2 พิษณุโลก", "สำนักงานป้องกันควบคุมโรคที่ 3 นครสวรรค์", "สำนักงานป้องกันควบคุมโรคที่ 4 สระบุรี", "สำนักงานป้องกันควบคุมโรคที่ 5 ราชบุรี", "สำนักงานป้องกันควบคุมโรคที่ 6 ชลบุรี", "สำนักงานป้องกันควบคุมโรคที่ 7 ขอนแก่น", "สำนักงานป้องกันควบคุมโรคที่ 8 อุดรธานี", "สำนักงานป้องกันควบคุมโรคที่ 9 นครราชสีมา", "สำนักงานป้องกันควบคุมโรคที่ 10 อุบลราชธานี", "สำนักงานป้องกันควบคุมโรคที่ 11 นครศรีธรรมราช", "สำนักงานป้องกันควบคุมโรคที่ 12 สงขลา", "สถาบันป้องกันโรคเขตเมือง", "สถาบันเวชศาสตร์ป้องกันศึกษา", "กองโรคป้องกันด้วยวัคซีน", "กองควบคุมโรคและภัยสุขภาพในภาวะฉุกเฉิน"]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": "กรมการแพทย์แผนไทยและการแพทย์ทางเลือก",
    "level3": ["สำนักงานเลขานุการกรม", "กองการแพทย์ทางเลือก", "กองคุ้มครองและส่งเสริมภูมิปัญญาการแพทย์แผนไทยและแพทย์พื้นบ้านไทย", "กองพัฒนายาแผนไทยและสมุนไพร", "กองวิชาการและแผนงาน", "สถาบันการแพทย์แผนไทย", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กองสมุนไพร", "สถาบันการแพทย์ไทย-จีน", "โรงพยาบาลการแพทย์แผนไทยและการแพทย์ผสมผสาน", "สำนักงานบริหารกองทุนภูมิปัญญาการแพทย์แผนไทย"]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": "กรมวิทยาศาสตร์การแพทย์",
    "level3": ["สำนักเลขานุการกรม", "สำนักเครื่องสำอางและวัตถุอันตราย", "สถาบันชีววัตถุ", "กองแผนงานและวิชาการ", "สำนักรังสีและเครื่องมือแพทย์", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 7 ขอนแก่น", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 6 ชลบุรี", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 1 เชียงใหม่", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 12/1 ตรัง", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 9 นครราชสีมา", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 3 นครสวรรค์", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 2 พิษณุโลก", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 12 สงขลา", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 5 สมุทรสงคราม", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 11 สุราษฏร์ธานี", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 8 อุดรธานี", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 10 อุบลราชธานี", "สถาบันวิจัยวิทยาศาสตร์สาธารณสุข", "สถาบันวิจัยสมุนไพร", "สำนักคุณภาพและความปลอดภัยอาหาร", "สำนักมาตรฐานห้องปฏิบัติการ", "สำนักยาและวัตถุเสพติด", "กลุ่มตรวจสอบภายใน", "กลุ่มพัมนาระบบบริหารราชการ", "สำนักวิชาการวิทยาศาสตร์การแพทย์", "ศูนย์เทคโนโลยีสารสนเทศ", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 1/1 เชียงราย", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 11/1 ภูเก็ต", "ศูนย์ชุดทดสอบและผลิตภัณฑ์กรมวิทยาศาสตร์การแพทย์", "กลุ่มงานคุ้มครองจริยธรรม", "ศูนย์วิทยาศาสตร์การแพทย์ที่ 4 สระบุรี", "สถาบันชีววิทยาศาสตร์ทางการแพทย์", "กลุ่มศูนย์วิทยาศาสตร์การแพทย์"]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": "กรมสนับสนุนบริการสุขภาพ",
    "level3": ["สำนักบริหาร", "กลุ่มอำนวยการ", "กลุ่มเทคโนโลยีสารสนเทศ", "กลุ่มบริหารทรัพยากรบุคคล", "กลุ่มแผนงาน", "สำนักสถานพยาบาลและการประกอบโรคศิลปะ", "กองแบบแผน", "กองวิศวกรรมการแพทย์", "กองสนับสนุนสุขภาพภาคประชาชน", "กองสุขศึกษา", "กองสุขภาพระหว่างประเทศ", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มกฎหมาย", "กลุ่มงานคุ้มครองจริยธรรม", "สำนักงานสนับสนุนบริการสุขภาพ เขต 1 จังหวัดเชียงใหม่", "สำนักงานสนับสนุนบริการสุขภาพ เขต 2 จังหวัดพิษณุโลก", "สำนักงานสนับสนุนบริการสุขภาพ เขต 3 จังหวัดนครสวรรค์", "สำนักงานสนับสนุนบริการสุขภาพ เขต 4 จังหวัดนนทบุรี", "สำนักงานสนับสนุนบริการสุขภาพ เขต 5 จังหวัดราชบุรี", "สำนักงานสนับสนุนบริการสุขภาพ เขต 6 จังหวัดชลบุรี", "สำนักงานสนับสนุนบริการสุขภาพ เขต 7 จังหวัดขอนแก่น", "สำนักงานสนับสนุนบริการสุขภาพ เขต 8 จังหวัดอุดรธานี", "สำนักงานสนับสนุนบริการสุขภาพ เขต 9 จังหวัดนครราชสีมา", "สำนักงานสนับสนุนบริการสุขภาพ เขต 10 จังหวัดอุบลราชธานี", "สำนักงานสนับสนุนบริการสุขภาพ เขต 11 จังหวัดสุราษฎร์ธานี", "สำนักงานสนับสนุนบริการสุขภาพ เขต 12 จังหวัดสงขลา", "กองสถานประกอบการเพื่อสุขภาพ", "สถาบันพัฒนานวัตกรรมด้านระบบบริการสุขภาพ ภาคเหนือ จังหวัดนครสวรรค์", "สถาบันพัฒนานวัตกรรมด้านระบบบริการสุขภาพ ภาคตะวันออกเฉียงเหนือ จังหวัดอุดรธานี", "สถาบันพัฒนานวัตกรรมด้านระบบบริการสุขภาพ ภาคกลาง จังหวัดชลบุรี", "สถาบันพัฒนานวัตกรรมด้านระบบบริการสุขภาพ ภาคใต้ จังหวัดนครศรีธรรมราช", "สถาบันพัฒนานวัตกรรมด้านระบบบริการสุขภาพ ชายแดนภาคใต้ จังหวัดยะลา"]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": "กรมสุขภาพจิต",
    "level3": ["สำนักงานเลขานุการกรม", "กองบริหารการคลัง", "กองบริหารทรัพยากรบุคคล", "กองบริหารระบบบริการสุขภาพจิต", "กองยุทธศาสตร์และแผนงาน", "กองสุขภาพจิตสังคม", "โรงพยาบาลศรีธัญญา", "ศูนย์สุขภาพจิตที่ 1", "ศูนย์สุขภาพจิตที่ 2", "ศูนย์สุขภาพจิตที่ 3", "ศูนย์สุขภาพจิตที่ 4", "ศูนย์สุขภาพจิตที่ 5", "ศูนย์สุขภาพจิตที่ 6", "ศูนย์สุขภาพจิตที่ 7", "ศูนย์สุขภาพจิตที่ 8", "ศูนย์สุขภาพจิตที่ 9", "ศูนย์สุขภาพจิตที่ 10", "ศูนย์สุขภาพจิตที่ 11", "ศูนย์สุขภาพจิตที่ 12", "สถาบันกัลยาณ์ราชนครินทร์", "สถาบันจิตเวชศาสตร์สมเด็จเจ้าพระยา", "สถาบันราชานุกูล", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มคุ้มครองจริยธรรม", "สำนักงานโครงการ TO BE NUMBER ONE", "สำนักงานจริยธรรมการวิจัยในคนด้านสุขภาพจิตและจิตเวช", "สำนักส่งเสริมและพัฒนาสุขภาพจิต", "โรงพยาบาลสวนปรุง", "โรงพยาบาลสวนสราญรมย์", "โรงพยาบาลพระศรีมหาโพธิ์", "โรงพยาบาลยุวประสาทไวทโยปถัมภ์", "โรงพยาบาลจิตเวชนครราชสีมาราชนครินทร์", "โรงพยาบาลจิตเวชสงขลาราชนคริทนร์", "โรงพยาบาลจิตเวชขอนแก่นราชนครินทร์", "โรงพยาบาลจิตเวชนครสวรรค์ราชนครินทร์", "โรงพยาบาลจิตเวชสระแก้วราชนครินทร์", "โรงพยาบาลจิตเวชเลยราชนครินทร์", "โรงพยาบาลจิตเวชนครพนมราชนครินทร์", "โรงพยาบาลจิตเวชพิษณุโลก", "สถาบันสุขภาพจิตเด็กและวัยรุ่นราชนครินทร์", "สถาบันพัฒนาการเด็กราชนครินทร์", "สถาบันสุขภาพจิตเด็กและวัยรุ่นภาคตะวันออกเฉียงเหนือ", "สถาบันสุขภาพจิตเด็กและวัยรุ่นภาคใต้", "ศูนย์สุขภาพจิตที่ 13", "สำนักงานวิเทศสัมพันธ์"]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": "กรมอนามัย",
    "level3": ["สำนักงานเลขานุการกรม", "กองการเจ้าหน้าที่", "กองคลัง", "สำนักทันตสาธารณสุข", "กองแผนงาน", "สำนักงานโครงการขับเคลื่อนกรมอนามัย 4.0 เพื่อความรอบรู้ด้านสุขภาพของประชาชน", "สำนักโภชนาการ", "กองประเมินผลกระทบต่อสุขภาพ", "สำนักสุขาภิบาลอาหารและน้ำ", "สำนักอนามัยการเจริญพันธุ์", "ศูนย์อนามัยที่ 1 เชียงใหม่", "ศูนย์อนามัยที่ 2 พิษณุโลก", "ศูนย์อนามัยที่ 3 นครสวรรค์", "ศูนย์อนามัยที่ 4  สระบุรี", "ศูนย์อนามัยที่ 5 ราชบุรี", "ศูนย์อนามัยที่ 6 ชลบุรี", "ศูนย์อนามัยที่ 7 ขอนแก่น", "ศูนย์อนามัยที่ 8 อุดรธานี", "ศูนย์อนามัยที่ 9 นครราชสีมา", "ศูนย์อนามัยที่ 10 อุบลราชธานี", "ศูนย์อนามัยที่ 11 นครศรีธรรมราช", "ศูนย์อนามัยที่ 12 ยะลา", "สำนักส่งเสริมสุขภาพ", "สำนักอนามัยสิ่งแวดล้อม", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "สถาบันพัฒนาสุขภาวะเขตเมือง", "สำนักคณะกรรมการผู้ทรงคุณวุฒิ", "กองกิจกรรมทางกายเพื่อสุขภาพ", "ศูนย์ความร่วมมือระหว่างประเทศ", "ศูนย์สื่อสารสาธารณะ", "ศูนย์ทันตสาธารณสุขระหว่างประเทศ", "สำนักอนามัยผู้สูงอายุ", "สถาบันพัฒนาอนามัยเด็กแห่งชาติ", "ศูนย์อนามัยกลุ่มชาติพันธุ์ ชายขอบ และแรงงานข้ามชาติ", "ศูนย์ห้องปฏิบัติการกรมอนามัย", "ศูนย์บริหารกฎหมายสาธารณสุข"]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": "สำนักงานคณะกรรมการอาหารและยา",
    "level3": ["สำนักงานเลขานุการกรม", "กองควบคุมเครื่องมือแพทย์", "กองควบคุมวัตถุเสพติด", "กองแผนงานและวิชาการ", "กองพัฒนาศักยภาพผู้บริโภค", "กองส่งเสริมงานคุ้มครองผู้บริโภคด้านผลิตภัณฑ์สุขภาพในส่วนภูมิภาคและท้องถิ่น", "สำนักควบคุมเครื่องสำอางและวัตถุอันตราย", "สำนักด่านอาหารและยา", "สำนักยา", "สำนักอาหาร", "กลุ่มกฎหมายอาหารและยา", "กลุ่มตรวจสอบภายใน", "ศูนย์ข้อมูลและสารสนเทศ", "กลุ่มพัฒนาระบบบริหาร", "สถาบันการศึกษาต่อเนื่องเภสัชศาสตร์", "กองผลิตภัณฑ์สมุนไพร", "กลุ่มเงินทุนหมุนเวียนยาเสพติด", "กองส่งเสริมการประกอบการผลิตภัณฑ์สุขภาพ", "สำนักงานโครงการวิจัยและพัฒนาระบบยาของประเทศไทย", "ศูนย์จัดการเรื่องร้องเรียนและปราบปรามการกระทำผิดกฎหมายเกี่ยวกับผลิตภัณฑ์สุขภาพ"]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": "สำนักงานหลักประกันสุขภาพแห่งชาติ (nhso)",
    "level3": [""]
}, {
    "level1": "กระทรวงวัฒนธรรรม",
    "level2": "ศูนย์คุณธรรรม (องค์การมหาชน)",
    "level3": ["ศูนย์คุณธรรรม (องค์การมหาชน)"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "สำนักงานรัฐมนตรี (สร.)",
    "level3": ["สำนักงานรัฐมนตรี"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "สำนักงานปลัดกระทรวง (สป.วท.)",
    "level3": ["สำนักบริหารกลาง", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักนโยบายและยุทธศาสตร์", "สำนักส่งเสริมและถ่ายทอดเทคโนโลยี", "หน่วยตรวจสอบภายใน", "กลุ่มตรวจสอบภายในระดับกระทรวง", "กลุ่มพัฒนาระบบบริหาร", "สำนักงานที่ปรึกษาด้านวิทยาศาสตร์และเทคโนโลยี ประจำสถานเอกอัคราชทูต ณ กรุงบรัสเซลล์", "สำนักงานที่ปรึกษาด้านวิทยาศาสตร์และเทคโนโลยี ประจำสถานเอกอัคราชทูต ณ กรุงวอชิงตัล", "สำนักตรวจราชการ", "ผู้ประสานงานคณะรัฐมนตรีและหน่วยงานของรัฐสภา", "สำนักความร่วมมือระหว่างประเทศและวิเทศน์สัมพันธ์", "สำนักงานเลขานุการคณะกรรมการส่งเสริมกิจการอุทธยานวิทยาศาสตร์", "ศูนย์ประสานงานกระทรวงวิทยาศาสตร์และเทคโนโลยีประจำภูมิภาค ภาคเหนือตอนบน", "ศูนย์ประสานงานกระทรวงวิทยาศาสตร์และเทคโนโลยีประจำภูมิภาค ภาคตะวันออกเฉียงเหนือตอนบน", "ศูนย์ประสานงานกระทรวงวิทยาศาสตร์และเทคโนโลยีประจำภูมิภาค ภาคใต้", "ศูนย์ประสานงานกระทรวงวิทยาศาสตร์และเทคโนโลยีประจำภูมิภาค ภาคตะวันออก", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "ศูนย์ประสานงาน วท. ประจำภูมิภาค", "สำนักงานกองทุนพัฒนาผู้ประกอบการเทคโนโลยีและนวัตกรรม"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "กรมวิทยาศาสตร์บริการ (วศ.)",
    "level3": ["สำนัักเทคโนโลยีชุมชน", "สำนักบริหารและรับรองห้องปฏิบัติการ", "สำนักพัฒนาศักยภาพนักวิทยาศาสตร์ห้องปฏิบัติการ", "สำนักหอสมุดและศูนย์สารสนเทศวิทยาศาสตร์และเทคโนโลยี", "กองเคมีภัณฑ์และผลิตภัณฑ์อุปโภค", "กองวัสดุวิศวกรรม", "กองผลิตภัณฑ์อาหารและวัสดุสัมผัสอาหาร", "กลุ่มพัฒนาระบบบริการ", "กองความสามารถห้องปฏิบัติการและรับรองผลิตภัณฑ์", "สำนักงานเลขานุการกรม"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "สำนักงานปรมาณูเพื่อสันติ (ปส.)",
    "level3": ["ส่วนกลาง", "สำนักงานเลขานุการกรม", "กองตรวจสอบทางนิวเคลียร์และรังสี", "กองอนุญาตทางนิวเคลียร์และรังสี", "กองยุทธศาสตร์และแผนงาน", "กองพัฒนาระบบและมาตรฐานกำกับดูแลความปลอดภัย", "กลุ่มกฎหมาย", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "สถาบันมาตรวิทยาแห่งชาติ (มว.)",
    "level3": ["กลุ่มงานเสียงและการสั่นสะเทือน", "กลุ่มงานนวัตกรรมและพัฒนาเครื่องมือวัด", "คณะกรรมการมาตรวิทยาแห่งชาติ", "คณะกรรมการตรวจสอบ", "สํานักงานรองผู้อำนวยการ/ผู้ช่วยอำนวยการ", "ฝ่ายบริหารงานกลาง", "ฝ่ายนโยบายและยุทธศาสตร์", "ฝ่ายมาตรวิทยาเชิงกล", "ฝ่ายมาตรวิทยามิติ", "ฝ่ายมาตรวิทยาไฟฟ้า", "ฝ่ายมาตรวิทยาอุณหภูมิและแสง", "ฝ่ายมาตรวิทยาเคมีและเทคโนโลยีชีวภาพ", "ผู้ตรวจสอบภายใน", "กลุ่มงานสื่อสารองค์การ", "กลุ่มงานสารบรรณและการประชุม"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "สถาบันวิจัยวิทยาศาสตร์และเทคโนโลยีแห่งประเทศไทย (วว.)",
    "level3": ["สำนักผู้ว่าการ", "กองเลขานุการ", "กองวิเทศสัมพันธ์", "สำนักตรวจสอบภายใน", "สำนักสื่อสารองค์กร", "กองสื่อสารภายใน", "กองประชาสัมพันธ์", "ศูนย์เชี่ยวชาญนวัตกรรมเกษตรสร้างสรรค์", "ศูนย์เชี่ยวชาญนวัตกรรมอาหารสุขภาพ", "ศูนย์เชี่ยวชาญนวัตกรรมผลิตภัณฑ์สมุนไพร", "ศูนย์ความหลากหลายทางชีวภาพ", "ศูนย์เชี่ยวชาญนวัตกรรมพลังงานสะอาดและสิ่งแวดล้อม", "ศูนย์เชี่ยวชาญนวัตกรรมวัสดุ", "ศูนย์เชี่ยวชาญนวัตกรรมหุ่นยนต์และเครื่องจักรกลอัตโนมัติ", "ศูนย์ทดสอบและมาตรวิทยา", "หป.มาตรฐานทางไฟฟ้าและอิเล็กทรอนิกส์", "หป.มาตรฐานทางแสงและอุณหภูมิ", "หป.มาตรฐานวิศวกรรมทางกล", "หป.ทดสอบทางฟิสิกส์", "หป.เคมีวิเคราะห์", "หป.ชีวเคมีและจุลชีววิทยา", "ศูนย์การบรรจุหีบห่อไทย", "หป.ทดสอบบรรจุภัณฑ์", "หป.พัฒนาบรรจุภัณฑ์", "ศูนย์พัฒนาและวิเคราะห์สมบัติของวัสดุ", "หป.ตรวจสอบคุณสมบัติวัสดุและวิเคราะห์ความเสียหาย", "หป.ตรวจสอบสมรรถนะและความปลอดภัย", "หป.ทดสอบการสลายตัวทางชีวภาพของวัสดุ", "สำนักรับรองระบบคุณภาพ", "กองจัดการและบริหารงาน", "กองประเมินและรับรองระบบคุณภาพ", "กองประเมินและรับรองผลิตภัณฑ์", "ศูนย์ทดสอบมาตรฐานระบบขนส่งทางราง", "หป.ทดสอบและพัฒนาเทคโนโลยีขนส่งทางรางและยานยนต์ขนส่ง", "สำนักบริการกลาง", "กองกลาง", "กองซ่อมบำรุง", "สำนักบริหารการคลัง", "กองการเงินและบัญชี", "กองพัสดุและคลังพัสดุ", "กองบริหารบุคคล", "กองพัฒนาบุคคล", "กองกฏหมาย", "สำนักดิจิทัลและสารสนเทศ", "กองพัฒนาระบบดิจิทัล", "กองพัฒนาและจัดการความรู้องค์กร", "สำนักยุทธศาสตร์วิสาหกิจ", "กองนโยบายและแผน", "กองติดตามและประเมินผล", "กองพัฒนาระบบงาน", "สำนักจัดการเทคโนโลยีและนวัตกรรม", "กองบริการธุรกิจนวัตกรรม", "กองพัฒนาธุรกิจนวัตกรรม"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน) (สทอภ.)",
    "level3": ["ฝ่ายกฎหมายและสัญญา", "ฝ่ายเลขานุการคณะกรรมการบริหาร", "ฝ่ายพัฒนาโครงสร้างพื้นฐานภูมิสารสนเทศของประเทศ", "ผู้บริหารระดับสูง", "สำนักปฏิบัติการดาวเทียม", "สำนักพัฒนาอุทยานรังสรรค์นวัตกรรมอวกาศ", "สำนักผลิตภัณฑ์ภูมิสารสนเทศ", "สำนักประยุกต์และบริการภูมิสารสนเทศ", "สำนักพัฒนาธุรกิจและเครือข่ายพันธมิตร", "สถาบันวิทยาการอวกาศและภูมิสารสนเทศ", "สำนักพัฒนาและถ่ายทอดองค์ความรู้", "สำนักบริหารกลาง", "สำนักยุทธศาสตร์", "สำนักตรวจสอบภายใน", "CIS : Collaborative Integration Space", "PM เกษตร", "PM สังคม", "PM GGP", "PM Space", "THEOS-2"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ (พว.)",
    "level3": ["สำนักงานกลาง", "ศูนย์พันธุวิศวกรรมและเทคโนโลยีชีวภาพแห่งชาติ", "ศูนย์เทคโนโลยีโลหะและวัสดุแห่งชาติ", "ศูนย์เทคโนโลยีอิเล็กทรอนิกส์และคอมพิวเตอร์แห่งชาติ", "ศูนย์นาโนเทคโนโลยีแห่งชาติ", "ศูนย์บริหารจัดการเทคโนโลยี", "สถาบันการจัดการเทคโนโลยีและนวัตกรรมเกษตร"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "องค์การพิพิธภัณฑ์วิทยาศาสตร์แห่งชาติ (อพ.)",
    "level3": ["หน่วยงานตรวจสอบภายใน", "สำนักบริหาร", "สำนักพัฒนาความตระหนักด้านวิทยาศาสตร์", "สำนักพัฒพัฒนาธุรกิจและการตลาด", "พิพิธภัณฑ์วิทยาศาสตร์", "พิพิธภัณฑ์ธรรมชาติวิทยา", "พิพิธภัณฑ์เทคโนโลยีสารสนเทศ", "สำนักยุทศาสตร์และแผน", "สำนักโครงการพิเศษ"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "สถาบันเทคโนโลยีนิวเคลียร์แห่งชาติ (องค์การมหาชน) (สทน.)",
    "level3": ["กลุ่มบริหารจัดการ", "ฝ่ายกฎหมาย", "ฝ่ายการเงินการคลัง", "ฝ่ายความร่วมมือและวิเทศสัมพันธ์", "ฝ่ายทรัพยากรมนุษย์", "ฝ่ายพัสดุ", "ฝ่ายอาคาร สถานที่ และยานพาหนะ", "กลุ่มวิจัยและพัฒนานิวเคลียร์", "ฝ่ายพัฒนานวัตกรรม", "ฝ่ายวิจัยนิวเคลียร์", "กลุ่มพัฒนาธุรกิจนิวเคลียร์", "ฝ่ายการตลาดและการขาย", "ฝ่ายพัฒนาโครงการ", "ฝ่ายควบคุมคุณภาพ", "ฝ่ายจัดการเครื่องฉายรังสี", "ฝ่ายฉายรังสี", "ฝ่ายตรวจวิเคราะห์", "ฝ่ายพัฒนาและบริการ", "ศูนย์ฉายรังสี", "ฝ่ายตรวจวัดและประเมินปริมาณรังสี", "ฝ่ายตรวจวัดวิเคราะห์โดยเทคนิคเชิงนิวเคลียร์", "ฝ่ายบริการเทคนิคนิวเคลียร์อุตสาหกรรม", "ศูนย์บริการเทคโนโลยีนิวเคลียร์", "ฝ่ายควบคุมคุณภาพไอโซโทปรังสี", "ฝ่ายจัดการเครื่องไซโคลตรอน", "ฝ่ายบริการ", "ฝ่ายประกันคุณภาพไอโซโทปรังสี", "ฝ่ายผลิตไอโซโทปรังสี", "ศูนย์ไอโซโทปรังสี", "ฝ่ายจัดการกากกัมมันตรังสี", "ฝ่ายพัฒนาเทคโนโลยีการจัดการกากกัมมันตรังสี", "ศูนย์จัดการกากกัมมันตรังสี", "ฝ่ายนิวเคลียร์ฟิวชั่นและพลาสมา", "ศูนย์ความเป็นเลิศเทคโนโลยีนิวเคลียร์ชั้นสูง", "ฝ่ายเดินเครื่องปฏิกรณ์", "ฝ่ายสนับสนุนเทคโนโลยีเครื่องปฏิกรณ์", "ศูนย์เครื่องปฏิกรณ์", "ฝ่ายนโยบายและแผน", "ฝ่ายเทคโนโลยีสารสนเทศ", "ฝ่ายพัฒนาองค์กร", "ฝ่ายมวลชนสัมพันธ์", "ฝ่ายสื่อสารองค์การ", "ฝ่ายบริการวิชาการ", "ฝ่ายประกันคุณภาพ", "ฝ่ายความปลอดภัยด้านนิวเคลียร์", "ฝ่ายตรวจสอบภายใน", "ฝ่ายดูแลรักษาและซ่อมบำรุงเครื่องมือทางนิวเคลียร์", "ฝ่ายพัฒนา ออกแบบและผลิต", "ศูนย์วิศวกรรมเครื่องมือด้านเทคโนโลยีนิวเคลียร์", "ฝ่ายเครื่องปฏิกรณ์นิวเคลียร์วิจัยใหม่", "ฝ่ายบริหารโครงการ"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "สำนักงานคณะกรรมการนโยบายวิทยาศาสตร์ เทคโนโลยีและนวัตกรรมแห่งชาติ (สวทน.)",
    "level3": ["กลุ่มพัฒนาองค์กร", "กลุ่มยุทธศาสตร์นโยบายนวัตกรรม", "กลุ่มยุทธศาสตร์เศรษฐกิจฐานใหม่", "กลุ่มยุทธศาสตร์อุตสาหกรรมและความร่วมมือระหว่างประเทศ", "ด้านการคาดการณ์เทคโนโลยีอนาคตและยุทธศาสตร์วิทยาศาสตร์ เทคโนโลยี และนวัตกรรม", "ด้านการบริหารระบบงบประมาณและแผนงานวิจัยและนวัตกรรม", "ด้านการพัฒนาระบบวิจัยและนวัตกรรม", "ด้านเขตเศรษฐกิจนวัตกรรมและเมืองนวัตกรรมอาหาร", "ด้านธุรกิจนวัตกรรมรายใหม่", "ด้านนวัตกรรมการพัฒนากำลังคน", "ด้านบริหารองค์กร", "ด้านพัฒนาองค์กรและระบบงาน", "ด้านยุทธศาสตร์และการงบประมาณ", "ด้านวิทยาศาสตร์ เทคโนโลยี และนวัตกรรมเพื่อการพัฒนาเศรษฐกิจหมุนเวียนและความยั่งยืน", "ด้านวิทยาศาสตร์ เทคโนโลยี และนวัตกรรมเพื่ออุตสาหกรรม 4.0 และการเชื่อมโยงนานาชาติ", "สำนักงานคณะกรรมการนโยบายวิทยาศาสตร์ เทคโนโลยีและนวัตกรรมแห่งชาติ", "หน่วยตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "สถาบันสารสนเทศทรัพยากรน้ำและการเกษตร (องค์การมหาชน) (สสนก)",
    "level3": ["ฝ่ายบริหาร", "ฝ่ายบริหารความร่วมมือและสื่อสารองค์กร", "ฝ่ายปฏิบัตติการภาวะฉุกเฉิน", "ฝ่ายวิจัยและพัฒนา", "ฝ่ายสารสนเทศการเกษตร", "ฝ่ายสารสนเทศทรัพยากรน้ำ"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "สถาบันวิจัยดาราศาสตร์แห่งชาติ (องค์การมหาชน) (สดร.)",
    "level3": ["สำนักผู้อำนวยการ", "ศูนย์บริการวิชาการและสื่อสารทางดาราศาสตร์", "ศูนย์ปฏิบัติการหอดูดาวแห่งชาติและวิศวกรรม", "กลุ่มวิจัย", "หอดูดาวภูมิภาค", "ศูนย์ปฏิบัติการดาราศาสตร์วิทยุ", "ศูนย์เทคโนโลยีสารสนเทศ"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "สำนักงานนวัตกรรมแห่งชาติ (องค์การมหาชน) (สนช.)",
    "level3": ["ฝ่ายโครงสร้างพื้นฐานนวัตกรรม", "ฝ่ายนวัตกรรมเพื่อเศรษฐกิจ", "ฝ่ายนวัตกรรมเพื่อสังคม", "ฝ่ายบริหารองค์กร", "ฝ่ายพัฒนาผู้ประกอบการนวัตกรรม", "ฝ่ายยุทธศาสตร์นวัตกรรม"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "ศูนย์ความเป็นเลิศด้านชีววิทยาศาสตร์ (องค์การมหาชน) (ศลช.)",
    "level3": ["โปรแกรมบริหารเครื่องมือแพทย์และหุ่นยนต์ทางการแพทย์", "โปรแกรมบริหารเทคโนโลยีเซลล์และยีนบำบัด", "โปรแกรมบริหารผลิตภัณฑ์เครื่องสำอางและอาหารเสริม", "โปรแกรมบริหารผลิตภัณฑ์ยา", "โปรแกรมพัฒนาเทคโนโลยีและนวัตกรรมเครื่องมือแพทย์และวัสดุฝังใน", "โปรแกรมเวชนครและสารสนเทศชีวการแพทย์", "ฝ่ายการเงินและบัญชี", "ฝ่ายบริหารกิจการองค์กร", "ฝ่ายยุทธศาสตร์และงบประมาณ", "ฝ่ายยุทธศาสตร์อุตสาหกรรมและการลงทุน", "สำนักผู้อำนวยการ", "หน่วยตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "level2": "สถาบันวิจัยแสงซินโครตรอน (องค์การมหาชน) (สซ.)",
    "level3": [""]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "สำนักงานรัฐมนตรี",
    "level3": ["สำนักงานรัฐมนตรี", "สำนักงานบริหารโครงการภายใต้บันทึกความเข้าใจว่าด้วยความร่วมมือระหว่างรัฐบาลแห่งราชอาณาจักรไทยกับรัฐบาลแห่งสาธารณรัฐประชาชนจีน ด้านการพัฒนาโครงสร้างพื้นฐานทางรถไฟของประเทศไทย (สบร.)"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "สำนักงานปลัดกระทรวงคมนาคม",
    "level3": ["สำนักงานปลัดกระทรวง", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "กลุ่มขับเคลื่อนการปฏิรูปประเทศ ยุทธศาสตร์ชาติและการสร้างความสามัคคีปรองดอง (กลุ่ม ป.ย.ป.) กระทรวงคมนาคม", "กองกลาง", "กองกฎหมาย", "กองการต่างประเทศ", "กองตรวจราชการ", "กองบริหารการคลัง", "กองบริหารทรัพยากรบุคคล", "กองเผยแพร่และประชาสัมพันธ์", "กองยุทธศาสตร์และแผนงาน", "กองอุทธรณ์เงินค่าทดแทน", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักงานคณะกรรมการค้นหาและช่วยเหลืออากาศยานและ   เรือที่ประสบภัย", "สำนักงานคณะกรรมการสอบสวนอุบัติเหตุและอุบัติการณ์ของอากาศยาน"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "กรมเจ้าท่า",
    "level3": ["กรมเจ้าท่า", "สำนักงานเลขานุการกรม", "กองกำกับการพาณิชยนาวี", "กองคลัง", "กองมาตรฐานคนประจำเรือ", "กองวิศวกรรม", "กองส่งเสริมการพาณิชยนาวี", "กองสำรวจและแผนที่", "ศูนย์ฝึกพาณิชย์นาวี", "สำนักกฎหมาย", "สำนักความปลอดภัยและสิ่งแวดล้อมทางน้ำ", "สำนักงานเจ้าท่าภูมิภาคที่ 1", "สำนักงานเจ้าท่าภูมิภาคที่ 2", "สำนักงานเจ้าท่าภูมิภาคที่ 3", "สำนักงานเจ้าท่าภูมิภาคที่ 4", "สำนักงานเจ้าท่าภูมิภาคที่ 5", "สำนักงานเจ้าท่าภูมิภาคที่ 6", "สำนักงานเจ้าท่าภูมิภาคที่ 7", "สำนักนำร่อง", "สำนักแผนงาน", "สำนักพัฒนาและบำรุงรักษาทางน้ำ", "สำนักมาตรฐานทะเบียนเรือ", "สำนักมาตรฐานเรือ", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "กรมการขนส่งทางบก",
    "level3": ["งานตรวจราชการกรม", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "สำนักงานเลขานุการกรม", "กองการเจ้าหน้าที่", "กองตรวจการขนส่งทางบก", "กองแผนงาน", "สำนักกฎหมาย", "สำนักการขนส่งผู้โดยสาร", "สำนักการขนส่งสินค้า", "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 1", "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 2", "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 3", "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 4", "สำนักงานขนส่งกรุงเทพมหานครพื้นที่ 5", "สำนักบริหารการคลังและรายได้", "สำนักมาตรฐานงานทะเบียนและภาษีรถ", "สำนักวิศวกรรมยานยนต์", "สำนักสวัสดิภาพการขนส่งทางบก", "ศูนย์เทคโนโลยีสารสนเทศ", "ศูนย์บริหารจัดการเดินรถระบบ GPS", "กองบริหารรถโดยสารประจำทางพื้นที่กรุงเทพมหานคร"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "กรมท่าอากาศยาน",
    "level3": ["สำนักงานเลขานุการกรม", "กองก่อสร้าง", "กองกฎหมาย", "กองคลัง", "กองพัฒนาและส่งเสริมธุรกิจท่าอากาศยาน", "ท่าอากาศยาน 29 แห่ง", "ท่าอากาศยานน่านนคร", "ท่าอากาศยานกระบี่", "ท่าอากาศยานบุรีรัมย์", "ท่าอากาศยานปัตตานี", "ท่าอากาศยานปาย", "ท่าอากาศยานพิษณุโลก", "ท่าอากาศยานเพชรบูรณ์", "ท่าอากาศยานแพร่", "ท่าอากาศยานแม่สอด", "ท่าอากาศยานแม่สะเรียง", "ท่าอากาศยานแม่ฮ่องสอน", "ท่าอากาศยานร้อยเอ็ด", "ท่าอากาศยานขอนแก่น", "ท่าอากาศยานระนอง", "ท่าอากาศยานลำปาง", "ท่าอากาศยานเลย", "ท่าอากาศยานสกลนคร", "ท่าอากาศยานสุราษฎร์ธานี", "ท่าอากาศยานหัวหิน", "ท่าอากาศยานอุดรธานี", "ท่าอากาศยานอุบลราชธานี", "ท่าอากาศยานเบตง", "ท่าอากาศยานชุมพร", "ท่าอากาศยานตรัง", "ท่าอากาศยานตาก", "ท่าอากาศยานนครพนม", "ท่าอากาศยานนครราชสีมา", "ท่าอากาศยานนครศรีธรรมราช", "ท่าอากาศยานนราธิวาส", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กองการเจ้าหน้าที่", "กองมาตรฐานท่าอากาศยาน", "ศูนย์เทคโนโลยีสารสนเทศ", "กองแผนงาน", "กองเครื่องช่วยการเดินอากาศและเครื่องกล", "กองบำรุงรักษา"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "กรมทางหลวง",
    "level3": ["สำนักงานเลขานุการกรม", "กองการเงินและบัญชี", "กองการเจ้าหน้าที่", "กองการพัสดุ", "กองทางหลวงพิเศษระหว่างเมือง", "แขวงทางหลวงพิเศษระหว่างเมือง", "กองฝึกอบรม", "แขวงทางหลวงเชียงใหม่ที่ 1", "แขวงทางหลวงเชียงใหม่ที่ 2", "แขวงทางหลวงเชียงใหม่ที่ 3", "แขวงทางหลวงลำพูน", "แขวงทางหลวงลำปางที่ 1", "แขวงทางหลวงลำปางที่ 2", "แขวงทางหลวงแม่ฮ่องสอน", "แขวงทางหลวงแพร่", "แขวงทางหลวงน่านที่ 1", "แขวงทางหลวงน่านที่ 2", "แขวงทางหลวงพะเยา", "แขวงทางหลวงเชียงรายที่ 1", "แขวงทางหลวงเชียงรายที่ 2", "แขวงทางหลวงสกลนครที่ 1", "แขวงทางหลวงสกลนครที่ 2 (สว่างแดนดิน)", "แขวงทางหลวงนครพนม", "แขวงทางหลวงหนองคาย", "แขวงทางหลวงบึงกาฬ", "แขวงทางหลวงมุกดาหาร", "แขวงทางหลวงตากที่ 1", "แขวงทางหลวงตากที่ 2 (แม่สอด)", "แขวงทางหลวงกำแพงเพชร", "แขวงทางหลวงพิษณุโลกที่ 1", "แขวงทางหลวงพิษณุโลกที่ 2 (วังทอง)", "แขวงทางหลวงสุโขทัย", "แขวงทางหลวงพิจิตร", "แขวงทางหลวงอุตรดิตถ์ที่ 1", "แขวงทางหลวงอุตรดิตถ์ที่ 2", "แขวงทางหลวงเพชรบูรณ์ที่ 1", "แขวงทางหลวงเพชรบูรณ์ที่ 2 (บึงสามพัน)", "แขวงทางหลวงเลยที่ 1", "แขวงทางหลวงเลยที่ 2 (ด่านซ้าย)", "แขวงทางหลวงหนองบัวลำภู", "แขวงทางหลวงขอนแก่นที่ 1", "แขวงทางหลวงขอนแก่นที่ 2 (ชุมแพ)", "แขวงทางหลวงขอนแก่นที่ 3 (บ้านไผ่)", "แขวงทางหลวงอุดรธานีที่ 1", "แขวงทางหลวงอุดรธานีที่ 2 (หนองหาน)", "แขวงทางหลวงชัยภูมิ", "แขวงทางหลวงมหาสารคาม", "แขวงทางหลวงยโสธร", "แขวงทางหลวงกาฬสินธุ์", "แขวงทางหลวงร้อยเอ็ด", "แขวงทางหลวงอุบลราชธานีที่ 1", "แขวงทางหลวงอุบลราชธานีที่ 2", "แขวงทางหลวงศรีสะเกษที่ 1", "แขวงทางหลวงศรีสะเกษที่ 2", "แขวงทางหลวงอำนาจเจริญ", "แขวงทางหลวงสุรินทร์", "แขวงทางหลวงนครราชสีมาที่ 1", "แขวงทางหลวงนครราชสีมาที่ 2", "แขวงทางหลวงนครราชสีมาที่ 3", "แขวงทางหลวงบุรีรัมย์", "แขวงทางหลวงปราจีนบุรี", "แขวงทางหลวงสระแก้ว (วัฒนานคร)", "แขวงทางหลวงลพบุรีที่ 1", "แขวงทางหลวงลพบุรีที่ 2 (ลำนารายณ์)", "แขวงทางหลวงนครสวรรค์ที่ 1", "แขวงทางหลวงนครสวรรค์ที่ 2 (ตากฟ้า)", "แขวงทางหลวงสระบุรี", "แขวงทางหลวงสิงห์บุรี", "แขวงทางหลวงสุพรรณบุรีที่ 1", "แขวงทางหลวงสุพรรณบุรีที่ 2 (อู่ทอง)", "แขวงทางหลวงกาญจนบุรี", "แขวงทางหลวงชัยนาท", "แขวงทางหลวงอุทัยธานี", "แขวงทางหลวงอ่างทอง", "แขวงทางหลวงกรุงเทพ", "แขวงทางหลวงสมุทรสาคร", "แขวงทางหลวงอยุธยา", "แขวงทางหลวงปทุมธานี", "แขวงทางหลวงสมุทรปราการ", "แขวงทางหลวงนนทบุรี", "แขวงทางหลวงธนบุรี", "แขวงทางหลวงนครนายก", "แขวงทางหลวงชลบุรีที่ 1", "แขวงทางหลวงชลบุรีที่ 2", "แขวงทางหลวงฉะเชิงเทรา", "แขวงทางหลวงจันทบุรี", "แขวงทางหลวงตราด", "แขวงทางหลวงระยอง", "แขวงทางหลวงประจวบคีรีขันธ์ (หัวหิน)", "แขวงทางหลวงนครปฐม", "แขวงทางหลวงชุมพร", "แขวงทางหลวงราชบุรี", "แขวงทางหลวงสมุทรสงคราม", "แขวงทางหลวงเพชรบุรี", "แขวงทางหลวงนครศรีธรรมราชที่ 1", "แขวงทางหลวงนครศรีธรรมราชที่ 2 (ทุ่งสง)", "แขวงทางหลวงสุราษฎร์ธานีที่ 1 (พุนพิน)", "แขวงทางหลวงสุราษฎร์ธานีที่ 2 (กาญจนดิษฐ์)", "แขวงทางหลวงสุราษฎร์ธานีที่ 3 (เวียงสระ)", "แขวงทางหลวงตรัง", "แขวงทางหลวงกระบี่", "แขวงทางหลวงภูเก็ต", "แขวงทางหลวงระนอง", "แขวงทางหลวงพังงา", "แขวงทางหลวงสงขลาที่ 1", "แขวงทางหลวงสงขลาที่ 2 (นาหม่อม)", "แขวงทางหลวงพัทลุง", "แขวงทางหลวงยะลา", "แขวงทางหลวงปัตตานี", "แขวงทางหลวงนราธิวาส", "แขวงทางหลวงสตูล", "ศูนย์เทคโนโลยีสารสนเทศ", "สำนักกฎหมาย", "สำนักก่อสร้างทางที่ 1", "สำนักก่อสร้างทางที่ 2", "ศูนย์สร้างทางลำปาง", "ศูนย์สร้างทางหล่มสัก", "ศูนย์สร้างทางขอนแก่น", "ศูนย์สร้างทางกาญจนบุรี", "ศูนย์สร้างทางสงขลา", "สำนักก่อสร้างสะพาน", "ศูนย์สร้างและบูรณะสะพานที่ 1 (พิจิตร)", "ศูนย์สร้างและบูรณะสะพานที่  2 (ขอนแก่น)", "ศูนย์สร้างและบูรณะสะพานที่ 3 (ปทุมธานี)", "ศูนย์สร้างและบูรณะสะพานที่ 4 (นครศรีธรรมราช)", "สำนักเครื่องกลและสื่อสาร", "สำนักงานทางหลวงที่ 1", "สำนักงานทางหลวงที่ 2", "สำนักงานทางหลวงที่ 3", "สำนักงานทางหลวงที่ 4", "สำนักงานทางหลวงที่ 5", "สำนักงานทางหลวงที่ 6", "สำนักงานทางหลวงที่ 7", "สำนักงานทางหลวงที่ 8", "สำนักงานทางหลวงที่ 9", "สำนักงานทางหลวงที่ 10", "สำนักงานทางหลวงที่ 11", "สำนักงานทางหลวงที่ 12", "สำนักงานทางหลวงที่ 13", "สำนักงานทางหลวงที่ 14", "สำนักงานทางหลวงที่ 15", "สำนักงานทางหลวงที่ 16", "สำนักงานทางหลวงที่ 17", "สำนักงานทางหลวงที่ 18", "สำนักจัดกรรมสิทธิ์ที่ดิน", "สำนักบริหารโครงการทางหลวงระหว่างประเทศ", "สำนักบริหารบำรุงทาง", "สำนักแผนงาน", "สำนักมาตรฐานและประเมินผล", "สำนักวิเคราะห์และตรวจสอบ", "สำนักวิจัยและพัฒนางานทาง", "สำนักสำรวจและออกแบบ", "สำนักอำนวยความปลอดภัย", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "สำนักงานแพทย์", "สำนักงานภูมิสถาปัตย์งานทาง", "สำนักงานควบคุมน้ำหนักยานพาหนะ", "สำนักงานสิ่งแวดล้อมและการมีส่วนร่วมของประชาชน"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "กรมทางหลวงชนบท",
    "level3": ["สำนักบริหารกลาง", "กองแผนงาน", "แขวงทางหลวงชนบทชัยภูมิ", "แขวงทางหลวงชนบทกระบี่", "แขวงทางหลวงชนบทชุมพร", "แขวงทางหลวงชนบทเชียงราย", "แขวงทางหลวงชนบทเชียงใหม่", "แขวงทางหลวงชนบทตรัง", "แขวงทางหลวงชนบทตราด", "แขวงทางหลวงชนบทตาก", "แขวงทางหลวงชนบทนครนายก", "แขวงทางหลวงชนบทนครปฐม", "แขวงทางหลวงชนบทนครพนม", "แขวงทางหลวงชนบทนครราชสีมา", "แขวงทางหลวงชนบทกาญจนบุรี", "แขวงทางหลวงชนบทนครศรีธรรมราช", "แขวงทางหลวงชนบทนครสวรรค์", "แขวงทางหลวงชนบทนนทบุรี", "แขวงทางหลวงชนบทนราธิวาส", "แขวงทางหลวงชนบทน่าน", "แขวงทางหลวงชนบทบึงกาฬ", "แขวงทางหลวงชนบทบุรีรัมย์", "แขวงทางหลวงชนบทปทุมธานี", "แขวงทางหลวงชนบทประจวบคีรีขันธ์", "แขวงทางหลวงชนบทปราจีนบุรี", "แขวงทางหลวงชนบทกาฬสินธุ์", "แขวงทางหลวงชนบทปัตตานี", "แขวงทางหลวงชนบทพระนครศรีอยุธยา", "แขวงทางหลวงชนบทพะเยา", "แขวงทางหลวงชนบทพังงา", "แขวงทางหลวงชนบทพัทลุง", "แขวงทางหลวงชนบทพิจิตร", "แขวงทางหลวงชนบทพิษณุโลก", "แขวงทางหลวงชนบทเพชรบุรี", "แขวงทางหลวงชนบทเพชรบูรณ์", "แขวงทางหลวงชนบทแพร่", "แขวงทางหลวงชนบทกำแพงเพชร", "แขวงทางหลวงชนบทภูเก็ต", "แขวงทางหลวงชนบทมหาสารคาม", "แขวงทางหลวงชนบทมุกดาหาร", "แขวงทางหลวงชนบทแม่ฮ่องสอน", "แขวงทางหลวงชนบทยะลา", "แขวงทางหลวงชนบทยโสธร", "แขวงทางหลวงชนบทร้อยเอ็ด", "แขวงทางหลวงชนบทระนอง", "แขวงทางหลวงชนบทระยอง", "แขวงทางหลวงชนบทราชบุรี", "แขวงทางหลวงชนบทขอนแก่น", "แขวงทางหลวงชนบทลพบุรี", "แขวงทางหลวงชนบทลำปาง", "แขวงทางหลวงชนบทลำพูน", "แขวงทางหลวงชนบทเลย", "แขวงทางหลวงชนบทศรีสะเกษ", "แขวงทางหลวงชนบทสกลนคร", "แขวงทางหลวงชนบทสงขลา", "แขวงทางหลวงชนบทสตูล", "แขวงทางหลวงชนบทสมุทรปราการ", "แขวงทางหลวงชนบทสมุทรสงคราม", "แขวงทางหลวงชนบทจันทบุรี", "แขวงทางหลวงชนบทสมุทรสาคร", "แขวงทางหลวงชนบทสระแก้ว", "แขวงทางหลวงชนบทสระบุรี", "แขวงทางหลวงชนบทสิงห์บุรี", "แขวงทางหลวงชนบทสุโขทัย", "แขวงทางหลวงชนบทสุพรรณบุรี", "แขวงทางหลวงชนบทสุราษฎร์ธานี", "แขวงทางหลวงชนบทสุรินทร์", "แขวงทางหลวงชนบทหนองคาย", "แขวงทางหลวงชนบทหนองบัวลำภู", "แขวงทางหลวงชนบทฉะเชิงเทรา", "แขวงทางหลวงชนบทอ่างทอง", "แขวงทางหลวงชนบทอำนาจเจริญ", "แขวงทางหลวงชนบทอุดรธานี", "แขวงทางหลวงชนบทอุตรดิตถ์", "แขวงทางหลวงชนบทอุทัยธานี", "แขวงทางหลวงชนบทอุบลราชธานี", "แขวงทางหลวงชนบทชลบุรี", "แขวงทางหลวงชนบทชัยนาถ", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักกฎหมาย", "สำนักก่อสร้างทาง", "สำนักก่อสร้างสะพาน", "สำนักเครื่องกลและสื่อสาร", "สำนักงานทางหลวงชนบทที่ 1 (ปทุมธานี)", "สำนักงานทางหลวงชนบทที่ 2 (สระบุรี)", "สำนักงานทางหลวงชนบทที่ 3 (ชลบุรี)", "สำนักงานทางหลวงชนบทที่ 4 (เพชรบุรี)", "สำนักงานทางหลวงชนบทที่ 5 (นครราชสีมา)", "สำนักงานทางหลวงชนบทที่ 6 (ขอนแก่น)", "สำนักงานทางหลวงชนบทที่ 7 (อุบลราชธานี)", "สำนักงานทางหลวงชนบทที่ 8 (นครสวรรค์)", "สำนักงานทางหลวงชนบทที่ 9 (อุตรดิตถ์)", "สำนักงานทางหลวงชนบทที่ 10 (เชียงใหม่)", "สำนักงานทางหลวงชนบทที่ 11 (สุราษฎร์ธานี)", "สำนักงานทางหลวงชนบทที่ 12 (สงขลา)", "สำนักงานทางหลวงชนบทที่ 13 (ฉะเชิงเทรา)", "สำนักงานทางหลวงชนบทที่ 14 (กระบี่)", "สำนักงานทางหลวงชนบทที่ 15 (อุดรธานี)", "สำนักบำรุงทาง", "สำนักฝึกอบรม", "สำนักวิเคราะห์ วิจัยและพัฒนา", "สำนักส่งเสริมการพัฒนาทางหลวงท้องถิ่น", "สำนักสำรวจและออกแบบ", "สำนักอำนวยความปลอดภัย", "สำนักงานตรวจสอบภายใน หมายเหตุ : หน่วยงานภายใน", "สำนักงานพัฒนาระบบบริหาร หมายเหตุ : หน่วยงานภายใน", "สำนักงานทางหลวงชนบทที่ 16 (กาฬสินธุ์) หมายเหตุ : หน่วยงานภายใน", "สำนักงานทางหลวงชนบทที่ 17 (เชียงราย) หมายเหตุ : หน่วยงานภายใน", "สำนักงานทางหลวงชนบทที่ 18 (สุพรรณบุรี) หมายเหตุ : หน่วยงานภายใน", "สำนักงานตรวจสอบภายในด้านการงาน หมายเหตุ : หน่วยงานภายใน", "สำนักงานตรวจสอบความปลอดภัยงานทาง หมายเหตุ : หน่วยงานภายใน", "กองส่งเสริมจริยธรรมและป้องกันการทุจริต หมายเหตุ : หน่วยงานภายใน"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "สำนักงานนโยบายและแผนการขนส่งและจราจร",
    "level3": ["สำนักงานนโยบายและแผนการขนส่งและจราจร", "สำนักบริหารกลาง", "กองจัดการจราจรทางบก", "กองพัฒนาระบบการขนส่งและจราจร", "ศูนย์เทคโนโลยีสารสนเทศการขนส่งและจราจร", "สํานักงานโครงการบริหารจัดการระบบตั๋วร่วม", "สํานักงานโครงการพัฒนาระบบราง", "สำนักแผนความปลอดภัย", "สํานักแผนงาน", "สํานักส่งเสริมระบบการขนส่งและจราจรในภูมิภาค", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร"]
}, {
    "level1": "กระทรวงการท่องเที่ยวและกีฬา",
    "level2": "กองบัญชาการตำรวจท่องเที่ยว",
    "level3": ["กองบัญชาการตำรวจท่องเที่ยว", "กองบังคับการอำนวยการ กองบัญชาการตำรวจท่องเที่ยว", "กองบัญชาการตำรวจท่องเที่ยว1", "กองบังคับการตำรวจท่องเที่ยว2", "กองบังคับการตำรวจท่องเที่ยว3"]
}, {
    "level1": "กระทรวงการท่องเที่ยวและกีฬา",
    "level2": "สำนักงานปลัดกระทรวงการท่องเที่ยวและกีฬา",
    "level3": ["กองกลาง (กล.)", "กองมาตรตฐานและกำกับความปลอดภัยนักท่องเที่ยว (กมก.)", "กองยุทธศาสตร์และแผนงาน (กยผ.)", "กองเศรษฐกิจการท่องเที่ยวและกีฬา (กทก.)", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร (ศทส.)", "กองตรวจสอบภายใน (กตน.)", "กองพัฒนาระบบบริหาร (กพร.)", "ศูนย์ปฏิบัติการต่อต้านการทุจริต (ศปท.)", "กองการต่างประเทศ (กกต.)", "กองตรวจราชการ (กตร.)"]
}, {
    "level1": "กระทรวงการท่องเที่ยวและกีฬา",
    "level2": "กรมพลศึกษา",
    "level3": ["สำนักงานเลขานุการกรม", "สถาบันพัฒนาบุคลากรการพลศึกษาและการกีฬา", "สำนักการกีฬา", "สำนักวิทยาศาสตร์การกีฬา", "สำนักนันทนาการ", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "กลุ่มงานคุ้มครองจริยธรรม"]
}, {
    "level1": "กระทรวงการท่องเที่ยวและกีฬา",
    "level2": "กรมการท่องเที่ยว",
    "level3": ["สำนักงานเลขานุการกรม", "กองกิจการภาพยนตร์และวีดิทัศน์ต่างประเทศ", "กองทะเบียนธุรกิจนำเที่ยวและมัคคุเทศก์", "กองพัฒนาบริการท่องเที่ยว", "กองพัฒนามาตรฐานบุคลากรด้านการท่องเที่ยว", "กองพัฒนาแหล่งท่องเที่ยว", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มงานคุ้มครองจริยธรรม"]
}, {
    "level1": "กระทรวงการท่องเที่ยวและกีฬา",
    "level2": "สถาบันการพลศึกษา",
    "level3": ["กองกลาง", "กองกิจการนักศึกษาและกิจการพิเศษ", "กองนโยบายและแผน", "กองส่งเสริมวิชาการ", "กองวิจัยและประกันคุณภาพการจัดการศึกษา", "สำนักงานอธิการบดี", "คณะวิทยาศาสตร์การกีฬาและสุขภาพ", "คณะศิลปศาสตร์", "คณะศึกษาศาสตร์", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "การรถไฟฟ้าขนส่งมวลชนแห่งประเทศไทย",
    "level3": ["สำนักผู้ว่าการ", "สำนักตรวจสอบ", "ฝ่ายนโยบายและยุทธศาสตร์", "ฝ่ายพัฒนาโครงการรถไฟฟ้า", "ฝ่ายบัญชีและการเงิน", "ฝ่ายวิศวกรรมและสถาปัตยกรรม", "ฝ่ายระบบรถไฟฟ้า", "ฝ่ายพัฒนาและบริหารพื้นที่", "ฝ่ายกรรมสิทธิ์ที่ดิน", "ฝ่ายปฏิบัติการ", "ฝ่ายรักษาความปลอดภัยและกู้ภัย", "ฝ่ายพัฒนาธุรกิจ", "ฝ่ายทรัพยากรบุคคล", "ฝ่ายกฎหมาย", "ฝ่ายเทคโนโลยีสารสนเทศ", "สำนักงานความปลอดภัย อาชีวอนามัย และสภาพแวดล้อมในการทำงาน", "ฝ่ายบริหารงานก่อสร้าง 1", "ฝ่ายบริหารงานก่อสร้าง 2", "ฝ่ายจัดซื้อและบริการ", "สำนักหน่วยธุรกิจตั๋วร่วม", "สำนักหน่วยธุรกิจรถไฟฟ้า"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยมหาสารคาม",
    "level3": ["มหาวิทยาลัยมหาสารคาม", "คณะการบัญชีและการจัดการ", "สำนักงานอธิการบดี", "กองประชาสัมพันธ์และกิจการต่างประเทศ", "กองกลาง", "คณะพยาบาลศาสตร์", "กองกิจการนิสิต", "คณะเภสัชศาสตร์", "กองบริการการศึกษา", "คณะวิทยาการสารสนเทศ", "กองแผนงาน", "คณะวิศวกรรมศาสตร์", "กองการเจ้าหน้าที่", "คณะศิลปกรรมศาสตร์", "กองคลังและพัสดุ", "คณะสถาปัตยกรรมศาสตร์ ผังเมืองและนฤมิตศิลป์", "กองทะเบียนและประมวลผล", "คณะการท่องเที่ยวและการโรงแรม", "กองอาคารสถานที่", "คณะสาธารณสุขศาสตร์", "กองส่งเสริมการวิจัยและบริการวิชาการ", "วิทยาลัยการเมืองการปกครอง", "คณะแพทยศาสตร์", "คณะเทคโนโลยี", "บัณฑิตวิทยาลัย", "คณะสิ่งแวดล้อมและทรัพยากรศาสตร์", "คณะสัตวแพทยศาสตร์", "วิทยาลัยดุริยางคศิลป์", "สำนักศึกษาทั่วไป", "สำนักตรวจสอบภายใน", "ศูนย์พัฒนาและประกันคุณภาพการศึกษา", "ศูนย์วิจัยและศึกษาบรรพชีวินวิทยา", "โรงเรียนสาธิตมหาวิทยาลัยมหาสารคาม (ฝ่ายมัธยม)", "โรงเรียนสาธิตมหาวิทยาลัยมหาสารคาม (ฝ่ายประถม)", "คณะมนุษย์ศาสตร์และสังคมศาสตร์", "สภาคณาจารย์มหาวิทยาลัยมหาสารคาม", "ศูนย์หนังสือมหาวิทยาลัยมหาสารคาม", "สำนักบริการวิชาการ", "สหกรณ์ออมทรัพย์มหาวิทยาลัยมหาสารคาม", "ฝ่ายพัฒนาบุคลากรและกิจการสภามหาวิทยาลัย", "ฝ่ายวิชาการและวิจัย", "ฝ่ายพัฒนานิสิต", "ฝ่ายกิจการพิเศษ", "ฝ่ายอำนวยการ", "ฝ่ายวางแผนและวิเทศสัมพันธ์", "คณะวิทยาศาสตร์", "คณะวัฒนธรรมศาสตร์", "คณะนิติศาสตร์", "คณะศึกษาศาสตร์", "สถาบันวิจัยวลัยรุกขเวช", "สถาบันวิจัยศิลปะและวัฒนธรรมอีสาน", "สำนักคอมพิวเตอร์", "สำนักวิทยบริการ"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยมหิดล",
    "level3": ["โครงการจัดตั้งวิทยาเขตนครสวรรค์", "โครงการจัดตั้งวิทยาเขตอำนาจเจริญ", "สำนักงานอธิการดี (กองแผนงาน)", "บัณฑิตวิทยาลัย", "คณะทันตแพทยศาสตร์", "คณะเทคนิคการแพทย์", "คณะพยาบาลศาสตร์", "คณะแพทยศาสตร์โรงพยาบาลรามาธิบดี", "คณะแพทยศาสตร์ศิริราชพยาบาล", "คณะเภสัชศาสตร์", "คณะวิทยาศาสตร์", "มหาวิทยาลัยมหิดล", "คณะวิศวกรรมศาสตร์", "คณะเวชศาสตร์เขตร้อน", "คณะสังคมศาสตร์และมนุษยศาสตร์", "คณะสัตวแพทยศาสตร์", "คณะสาธารณสุขศาสตร์", "คณะสิ่งแวดล้อมและทรัพยากรศาสตร์", "วิทยาลัยราชสุดา", "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา", "สถาบันพัฒนาสุขภาพอาเซียน", "สถาบันวิจัยประชากรและสังคม", "สถาบันวิจัยภาษาและวัฒนธรรมเอเชีย", "สถาบันโภชนาการ", "สถาบันชีววิทยาศาสตร์โมเลกุล", "สถาบันแห่งชาติเพื่อการพัฒนาเด็กและครอบครัว", "ศูนย์ตรวจสอบสารต้องห้ามในนักกีฬา", "ศูนย์สัตว์ทดลองแห่งชาติ", "หอสมุดและคลังความรู้มหาวิทยาลัยมหิดล", "วิทยาลัยนานาชาติ", "วิทยาลัยดุริยางคศิลป์", "วิทยาลัยการจัดการ", "วิทยาลัยศาสนศึกษา", "สถาบันนวัตกรรมการเรียนรู้", "คณะศิลปศาสตร์", "คณะเทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักงานสภามหาวิทยาลัย", "วิทยาเขตกาญจนบุรี", "คณะกายภาพบำบัด", "สถาบันบริหารจัดการเทคโนโลยีและนวัตกรรม"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "โรงเรียนมหิดลวิทยานุสรณ์",
    "level3": [""]
}, {
    "level1": "หน่วยงานอิสระ",
    "level2": "สำนักงานคณะกรรมการป้องกันและปราบปรามการทุจริตแห่งชาติ",
    "level3": ["ส่วนกลาง", "กลุ่มตรวจสอบภายใน", "กลุ่มงานประสานการบริหารเชิงยุทธ์", "ศูนย์ประมวลข้อมูลสำนักงาน ป.ป.ช.", "ศูนย์ประเมินคุณธรรมและความโปร่งใสของหน่วยงานภาครัฐ", "สำนักงานเลขาธิการ", "สำนักมาตรการป้องกันการทุจริต", "สำนักป้องกันการทุจริตภาคการเมือง", "สำนักป้องกันการทุจริตภาครัฐ", "สำนักป้องกันการทุจริตภาครัฐวิสาหกิจและธุรกิจเอกชน", "สำนักป้องกันการทุจริตภาคประชาสังคมและการพัฒนาเครือข่าย", "สำนักทะเบียนและพัฒนาระบบตรวจสอบ", "สำนักตรวจสอบทรัพย์สินภาคการเมือง", "สำนักส่งเสริมการตรวจสอบทรัพย์สินภาคการเมืองส่วนท้องถิ่น", "สำนักตรวจสอบทรัพย์สินภาครัฐและรัฐวิสาหกิจ", "สำนักไต่สวนการทุจริตภาคการเมือง 1", "สำนักไต่สวนการทุจริตภาคการเมือง 2", "สำนักไต่สวนการทุจริตภาคการเมือง 3", "สำนักไต่สวนการทุจริตภาคการเมือง 4", "สำนักไต่สวนการทุจริตภาครัฐ 1", "สำนักไต่สวนการทุจริตภาครัฐ 2", "สำนักไต่สวนการทุจริตภาครัฐ 3", "สำนักไต่สวนการทุจริตภาครัฐวิสาหกิจ", "สำนักสืบสวนและกิจการพิเศษ", "สำนักนโยบายและยุทธศาสตร์", "สำนักบริหารงานกลาง", "สำนักบริหารงานคลัง", "สำนักบริหารทรัพยากรบุคคล", "สำนักประชาสัมพันธ์", "สำนักอำนวยการคณะกรรมการ", "สำนักการต่างประเทศ", "สำนักกฎหมาย", "สำนักคดี", "สถาบันการป้องกันและปราบปรามการทุจริตแห่งชาติ สัญญา ธรรมศักดิ์", "ศูนย์เทคโนโลยีสารสนเทศ", "ศูนย์วิจัยเพื่อต่อต้านการทุจริต ป๋วย อึ๊งภากรณ์", "สำนักงาน ป.ป.ช. ประจำจังหวัดพระนครศรีอยุธยา", "สำนักงาน ป.ป.ช. ประจำจังหวัดชลบุรี", "สำนักงาน ป.ป.ช. ประจำจังหวัดนครราชสีมา", "สำนักงาน ป.ป.ช. ประจำจังหวัดขอนแก่น", "สำนักงาน ป.ป.ช. ประจำจังหวัดเชียงใหม่", "สำนักงาน ป.ป.ช. ประจำจังหวัดพิษณุโลก", "สำนักงาน ป.ป.ช. ประจำจังหวัดนครปฐม", "สำนักงาน ป.ป.ช. ประจำจังหวัดสุราษฎร์ธานี", "สำนักงาน ป.ป.ช. ประจำจังหวัดสงขลา", "สำนักงาน ป.ป.ช. ประจำจังหวัดกระบี่", "สำนักงาน ป.ป.ช. ประจำจังหวัดจันทบุรี", "สำนักงาน ป.ป.ช. ประจำจังหวัดชัยนาท", "สำนักงาน ป.ป.ช. ประจำจังหวัดชุมพร", "สำนักงาน ป.ป.ช. ประจำจังหวัดเชียงราย", "สำนักงาน ป.ป.ช. ประจำจังหวัดตรัง", "สำนักงาน ป.ป.ช. ประจำจังหวัดนครพนม", "สำนักงาน ป.ป.ช. ประจำจังหวัดนครศรีธรรมราช", "สำนักงาน ป.ป.ช. ประจำจังหวัดนครสวรรค์", "สำนักงาน ป.ป.ช. ประจำจังหวัดเพชรบุรี", "สำนักงาน ป.ป.ช. ประจำจังหวัดแพร่", "สำนักงาน ป.ป.ช. ประจำจังหวัดยะลา", "สำนักงาน ป.ป.ช. ประจำจังหวัดร้อยเอ็ด", "สำนักงาน ป.ป.ช. ประจำจังหวัดลพบุรี", "สำนักงาน ป.ป.ช. ประจำจังหวัดลำปาง", "สำนักงาน ป.ป.ช. ประจำจังหวัดศรีสะเกษ", "สำนักงาน ป.ป.ช. ประจำจังหวัดสระแก้ว", "สำนักงาน ป.ป.ช. ประจำจังหวัดสุโขทัย", "สำนักงาน ป.ป.ช. ประจำจังหวัดสุพรรณบุรี", "สำนักงาน ป.ป.ช. ประจำจังหวัดสุรินทร์", "สำนักงาน ป.ป.ช. ประจำจังหวัดหนองคาย", "สำนักงาน ป.ป.ช. ประจำจังหวัดอุดรธานี", "สำนักงาน ป.ป.ช. ประจำจังหวัดอุบลราชธานี", "สำนักงาน ป.ป.ช. ประจำจังหวัดกาญจนบุรี", "สำนักงาน ป.ป.ช. ประจำจังหวัดกาฬสินธุ์", "สำนักงาน ป.ป.ช. ประจำจังหวัดกำแพงเพชร", "สำนักงาน ป.ป.ช. ประจำจังหวัดฉะเชิงเทรา", "สำนักงาน ป.ป.ช. ประจำจังหวัดชัยภูมิ", "สำนักงาน ป.ป.ช. ประจำจังหวัดตราด", "สำนักงาน ป.ป.ช. ประจำจังหวัดตาก", "สำนักงาน ป.ป.ช. ประจำจังหวัดนครนายก", "สำนักงาน ป.ป.ช. ประจำจังหวัดนนทบุรี", "สำนักงาน ป.ป.ช. ประจำจังหวัดนราธิวาส", "สำนักงาน ป.ป.ช. ประจำจังหวัดน่าน", "สำนักงาน ป.ป.ช. ประจำจังหวัดบึงกาฬ", "สำนักงาน ป.ป.ช. ประจำจังหวัดบุรีรัมย์", "สำนักงาน ป.ป.ช. ประจำจังหวัดปทุมธานี", "สำนักงาน ป.ป.ช. ประจำจังหวัดประจวบคีรีขันธ์", "สำนักงาน ป.ป.ช. ประจำจังหวัดปราจีนบุรี", "สำนักงาน ป.ป.ช. ประจำจังหวัดปัตตานี", "สำนักงาน ป.ป.ช. ประจำจังหวัดพะเยา", "สำนักงาน ป.ป.ช. ประจำจังหวัดพังงา", "สำนักงาน ป.ป.ช. ประจำจังหวัดพัทลุง", "สำนักงาน ป.ป.ช. ประจำจังหวัดพิจิตร", "สำนักงาน ป.ป.ช. ประจำจังหวัดเพชรบูรณ์", "สำนักงาน ป.ป.ช. ประจำจังหวัดภูเก็ต", "สำนักงาน ป.ป.ช. ประจำจังหวัดมหาสารคาม", "สำนักงาน ป.ป.ช. ประจำจังหวัดมุกดาหาร", "สำนักงาน ป.ป.ช. ประจำจังหวัดแม่ฮ่องสอน", "สำนักงาน ป.ป.ช. ประจำจังหวัดยโสธร", "สำนักงาน ป.ป.ช. ประจำจังหวัดระนอง", "สำนักงาน ป.ป.ช. ประจำจังหวัดระยอง", "สำนักงาน ป.ป.ช. ประจำจังหวัดราชบุรี", "สำนักงาน ป.ป.ช. ประจำจังหวัดลำพูน", "สำนักงาน ป.ป.ช. ประจำจังหวัดเลย", "สำนักงาน ป.ป.ช. ประจำจังหวัดสกลนคร", "สำนักงาน ป.ป.ช. ประจำจังหวัดสตูล", "สำนักงาน ป.ป.ช. ประจำจังหวัดสมุทรปราการ", "สำนักงาน ป.ป.ช. ประจำจังหวัดสมุทรสงคราม", "สำนักงาน ป.ป.ช. ประจำจังหวัดสมุทรสาคร", "สำนักงาน ป.ป.ช. ประจำจังหวัดสระบุรี", "สำนักงาน ป.ป.ช. ประจำจังหวัดสิงห์บุรี", "สำนักงาน ป.ป.ช. ประจำจังหวัดหนองบัวลำภู", "สำนักงาน ป.ป.ช. ประจำจังหวัดอ่างทอง", "สำนักงาน ป.ป.ช. ประจำจังหวัดอำนาจเจริญ", "สำนักงาน ป.ป.ช. ประจำจังหวัดอุตรดิตถ์", "สำนักงาน ป.ป.ช. ประจำจังหวัดอุทัยธานี", "ศูนย์กำกับดูแลการจัดซื้อจัดจ้างภาครัฐ", "สำนักงาน ป.ป.ช. ภาค 1", "สำนักงาน ป.ป.ช. ภาค 2", "สำนักงาน ป.ป.ช. ภาค 3", "สำนักงาน ป.ป.ช. ภาค 4", "สำนักงาน ป.ป.ช. ภาค 5", "สำนักงาน ป.ป.ช. ภาค 6", "สำนักงาน ป.ป.ช. ภาค 7", "สำนักงาน ป.ป.ช. ภาค 8", "สำนักงาน ป.ป.ช. ภาค 9"]
}, {
    "level1": "หน่วยงานอิสระ",
    "level2": "สำนักงานคณะกรรมการกิจการกระจายเสียง กิจการโทรทัศน์และกิจการโทรคมนาคมแห่งชาติ (สำนักงาน กสทช.)",
    "level3": ["สำนักยุทธศาสตร์และการงบประมาณ"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "สำนักงานความร่วมมือพัฒนาเศรษฐกิจกับประเทศเพื่อนบ้าน",
    "level3": [""]
}, {
    "level1": "หน่วยงานอิสระ",
    "level2": "สำนักงานสภาที่ปรึกษาเศรษฐกิจและสังคมแห่งชาติ",
    "level3": ["สำนักบริหารกลาง", "สำนักกิจการสภาที่ปรึกษาเศรษฐกิจและสังคมแห่งชาติ", "สำนักวิชาการ", "สำนักส่งเสริมและประสานการมีส่วนร่วมองค์กรเครือข่าย", "หน่วยตรวจสอบภายใน", "สำนักประชาสัมพันธ์และสารสนเทศ", "สำนักติดตามประเมินผลและประสานงานภาครัฐ", "กลุ่มงานพัฒนาระบบบริหาร"]
}, {
    "level1": "หน่วยงานอิสระ",
    "level2": "สำนักงานคณะกรรมการสิทธิมนุษยชนแห่งชาติ",
    "level3": ["สำนักบริหารกลาง (สบก.)", "สำนักส่งเสริมและประสานงานเครือข่าย (สสค.)", "สำนักคุ้มครองสิทธิมนุษยชน (สคส.)", "สำนักวิจัยและวิชาการ (สวก.)", "หน่วยตรวจสอบภายใน (นตส.)", "กลุ่มงานอำนวยการกิจการคณะกรรมการสิทธิมนุษยชนแห่งชาติ (กอค.)", "สำนักกฎหมายและคดี (สกค.)", "สำนักสิทธิมนุษยชนระหว่างประเทศ (สรป.)", "กลุ่มงานติดตามและสารบบสำนวน (กตส.)"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักข่าวกรองแห่งชาติ",
    "level3": ["สำนักอำนวยการ", "สำนัก 1", "สำนัก 2", "สำนัก 3", "สำนัก 4", "สำนัก 5", "สำนัก 6", "สำนัก 7", "สำนัก 8", "สำนัก 9", "สำนัก 10", "สำนัก 11", "กอง 1", "กอง 2", "สถาบันการข่าวกรอง", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "กองยุทธศาสตร์ข่าวกรอง", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "สำนักงานศูนย์ประสานข่าวกรองแห่งชาติ", "สำนกงานเลขานุการคณะที่ปรึกษาการข่าว", "กลุ่มนิติการ", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "ศูนย์ข่าวเปิด"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สถาบันบัณฑิตพัฒนบริหารศาสตร์",
    "level3": ["คณะรัฐประศาสนศาสตร์", "คณะบริหารธุรกิจ", "คณะพัฒนาการเศรษฐกิจ", "คณะสถิติประยุกต์", "คณะพัฒนาสังคมและสิ่งแวดล้อม", "คณะภาษาและการสื่อสาร", "คณะพัฒนาทรัพยากรมนุษย์", "คณะนิติศาสตร์", "คณะการจัดการการท่องเที่ยว", "คณะนิเทศศาสตร์และนวัตกรรมการจัดการ", "คณะบริหารการพัฒนาสิ่งแวดล้อม", "วิทยาลัยนานาชาติ", "สำนักวิจัย", "สำนักสิริพัฒนา", "สำนักบรรณสารการพัฒนา", "สำนักเทคโนโลยีสารสนเทศ", "สำนักงานอธิการบดี", "ศูนย์สาธารณประโยชน์และประชาสังคม", "ศูนย์ศึกษาปรัชญาของเศรษฐกิจพอเพียงกับการพัฒนาที่ยั่งยืน", "ศูนย์สำรวจความคิดเห็น “นิด้าโพล”", "ศูนย์อาเซียนและเอเชียศึกษา", "ศูนย์คลังปัญญาและสารสนเทศ", "ศูนย์บริการวิชาการ", "กองแผนงาน"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สถาบันทดสอบทางการศึกษาแห่งชาติ",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฎนครปฐม",
    "level3": ["สำนักงานอธิการบดี", "กองกลาง", "กองนโยบายและแผน", "กองพัฒนานักศึกษา", "คณะครุศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาศาสตร์เทคโนโลยี", "คณะวิทยาการจัดการ", "คณะพยาบาลศาสตร์", "สำนักศิลปะและวัฒนธรรม", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักงานบัณฑิตศึกษา", "สถาบันวิจัยและพัฒนา", "สถาบันภาษา", "สำนักคอมพิวเตอร์"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานคณะกรรมการวิจัยแห่งชาติ",
    "level3": ["สำนักงานเลขานุการกรม", "กองการต่างประเทศ", "กองนโยบายและแผนการวิจัย", "กองบริหารแผนและงบประมาณการวิจัย", "กองประเมินผลและจัดการความรู้วิจัย", "กองมาตรฐานการวิจัย", "ศูนย์สารสนเทศการวิจัย", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "สถาบันพัฒนาการดำเนินการต่อสัตว์เพื่องานทางวิทยาศาสตร์"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏนครราชสีมา",
    "level3": ["คณะครุศาสตร์", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะเทคโนโลยีอุตสาหกรรม", "คณะสาธารณสุขศาสตร์", "บัณฑิตวิทยาลัย", "สำนักงานอธิการบดี", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักศิลปะและวัฒนธรรม", "สำนักคอมพิวเตอร์", "สถาบันวิจัยและพัฒนา", "สถาบันวิจัยไม้กลายเป็นหินฯ", "สถาบันภาษา"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานสภาความมั่นคงแห่งชาติ",
    "level3": ["สำนักเลขาธิการ", "สำนักนโยบายและแผนความมั่นคง", "สำนักประเมินภัยคุกคาม", "สำนักยุทธศาสตร์ความมั่นคงภายในประเทศ", "สำนักยุทธศาสตร์ความมั่นคงระหว่างประเทศ", "สำนักยุทธศาสตร์ความมั่นคงกิจการชายแดนและประเทศรอบบ้าน", "สำนักยุทธศาสตร์ความมั่นคงเกี่ยวกับภัยคุกคามข้ามชาติ", "สำนักยุทธศาสตร์ความมั่นคงจังหวัดชายแดนภาคใต้และชนต่างวัฒนธรรม", "สำนักยุทธศาสตร์การเตรียมพร้อมและการป้องกันประเทศ", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มพัฒนาองค์ความรู้ความมั่นคง", "กลุ่มกิจการกฎหมายด้านความมั่นคง"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏนครสวรรค์",
    "level3": ["คณะครุศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะเทคโนโลยีการเกษตรและเทคโนโลยีอุตสาหกรรม", "สำนักงานอธิการบดี", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักศิลปะและวัฒนธรรม", "สถาบันวิจัยและพัฒนา"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏนครศรีธรรมราช",
    "level3": ["คณะครุศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะเทคโนโลยีอุตสาหกรรม", "บัณฑิตวิทยาลัย", "สำนักงานอธิการบดี", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สถาบันวิจัยและพัฒนา", "โรงเรียนสาธิต", "กองกลาง", "กองนโยบายและแผน", "กองพัฒนานักศึกษา", "หน่วยวิเทศสัมพันธ์", "ส่วนมาตรฐานและคุณภาพการศึกษา", "หน่วยตรวจสอบภายใน", "สำนักงานสภามหาวิทยาลัย", "สถานีวิทยุ", "ศูนย์วัฒนธรรม"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยนเรศวร",
    "level3": ["กองกลาง", "กองกิจการนิสิต", "กองบริการการศึกษา", "กองแผนงาน", "กองบริการเทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักงานอธิการบดี", "สำนักงานตรวจสอบภายใน", "กองพัฒนาคุณภาพการศึกษา", "กองคลัง", "สถานภูมิภาคเทคโนโลยีอวกาศและภูมิสารสนเทศภาคเหนือตอนล่าง", "สถานบ่มเพาะวิสาหกิจ มหาวิทยาลัยนเรศวร", "กองการบริหารงานบุคคล", "กองอาคารสถานที่", "สำนักงานสภาอาจารย์", "กองบริการวิชาการและการจัดการทรัพย์สิน", "กองกฎหมาย", "กองพัฒนากิจการต่างประเทศ", "การบริหารการวิจัย", "สถานพัฒนาวิชาการด้านภาษา", "กองส่งเสริมศิลปวัฒนธรรม", "กองการศึกษาทั่วไป", "กองพัฒนาศักยภาพชุมชนและทุนมนุษย์", "สถานสัตว์ทดลองเพื่อการวิจัย", "อุทยานวิทยาศาสตร์ภาคเหนือตอนล่าง", "สำนักงานสภามหาวิทยาลัยนเรศวร", "บัณฑิตวิทยาลัย", "คณะมนุษยศาสตร์", "คณะวิทยาศาสตร์", "โรงเรียนมัธยมสาธิตมหาวิทยาลัยนเรศวร", "คณะศึกษาศาสตร์", "สำนักหอสมุด", "คณะเกษตรศาสตร์ ทรัพยากรธรรมชาติและสิ่งแวดล้อม", "คณะเภสัชศาสตร์", "คณะวิศวกรรมศาสตร์", "มหาวิทยาลัยนเรศวร", "คณะแพทยศาสตร์", "คณะทันตแพทยศาสตร์", "คณะพยาบาลศาสตร์", "คณะสหเวชศาสตร์", "คณะวิทยาศาสตร์การแพทย์", "คณะสถาปัตยกรรมศาสตร์", "วิทยาลัยนานาชาติ", "คณะนิติศาสตร์", "คณะบริหารธุรกิจ เศรษฐศาสตร์และการสื่อสาร", "คณะสังคมศาสตร์", "คณะสาธารณสุขศาสตร์", "วิทยาลัยพลังงานทดแทน", "วิทยาลัยโลจิสติกส์และโซ่อุปทาน", "วิทยาลัยเพื่อการค้นคว้าระดับรากฐาน", "วิทยาลัยประชาคมอาเซียนศึกษา", "วิทยาลัยการจัดการระบบสุขภาพ"]
}, {
    "level1": "กระทรวงสาธารณสุข",
    "level2": "สถาบันวัคซีนแห่งชาติ",
    "level3": [""]
}, {
    "level1": "หน่วยงานอิสระ",
    "level2": "สำนักงานการตรวจเงินแผ่นดิน",
    "level3": ["สำนักคณะกรรมการตรวจเงินแผ่นดิน", "สำนักผู้ว่าการตรวจเงินแผ่นดิน", "สำนักบริหารงานกลาง", "สำนักวินัยทางการเงินและการคลัง", "สำนักกฎหมาย", "สำนักนโยบายและยุทธศาสตร์การตรวจเงินแผ่นดิน", "สำนักดิจิทัล", "สำนักวิจัยและพัฒนาการตรวจเงินแผ่นดิน", "สำนักการเงินและการคลัง", "สำนักบริหารทรัพยากรบุคคล", "สถาบันพัฒนาข้าราชการ", "สำนักคดี", "สำนักต่างประเทศ", "สำนักตรวจสอบการดำเนินงานที่ 1", "สำนักตรวจสอบการดำเนินงานที่ 2", "สำนักตรวจสอบการดำเนินงานที่ 3", "สำนักตรวจสอบการดำเนินงานที่ 4", "สำนักตรวจสอบการบริหารพัสดุและสืบสวนที่ 1", "สำนักตรวจสอบการบริหารพัสดุและสืบสวนที่ 2", "สำนักตรวจสอบการบริหารพัสดุและสืบสวนที่ 3", "สำนักตรวจสอบการบริหารพัสดุและสืบสวนที่ 4", "สำนักตรวจสอบการบริหารพัสดุและสืบสวนที่ 5", "สำนักตรวจสอบการเงินที่ 1", "สำนักตรวจสอบการเงินที่ 2", "สำนักตรวจสอบการเงินที่ 3", "สำนักตรวจสอบการเงินที่ 4", "สำนักตรวจสอบการเงินที่ 5", "สำนักตรวจสอบการเงินที่ 6", "สำนักตรวจสอบการเงินที่ 7", "สำนักตรวจสอบการเงินที่ 8", "สำนักตรวจสอบการเงินที่ 9", "สำนักตรวจสอบการเงินที่ 10", "สำนักตรวจสอบการเงินที่ 11", "สำนักตรวจสอบการเงินที่ 12", "สำนักตรวจสอบการเงินที่ 13", "สำนักตรวจสอบการเงินที่ 14", "สำนักตรวจสอบการเงินที่ 15", "สำนักตรวจสอบการเงินที่ 16", "สำนักตรวจสอบการเงินที่ 17", "สำนักตรวจสอบการเงินที่ 18", "สำนักตรวจสอบการเงินที่ 19", "สำนักตรวจสอบการเงินที่ 20", "สำนักตรวจสอบการจัดเก็บรายได้", "สำนักกิจการพิเศษ", "สำนักตรวจสอบสิ่งแวดล้อม", "สำนักตรวจสอบดิจิทัล", "สำนักตรวจสอบพิเศษภาค 1 (จังหวัดพระนครศรีอยุธยา)", "สำนักตรวจเงินแผ่นดินจังหวัดพระนครศรีอยุธยา", "สำนักตรวจเงินแผ่นดินจังหวัดนครนายก", "สำนักตรวจเงินแผ่นดินจังหวัดสระบุรี", "สำนักตรวจเงินแผ่นดินจังหวัดปราจีนบุรี", "สำนักตรวจเงินแผ่นดินจังหวัดลพบุรี", "สำนักตรวจเงินแผ่นดินจังหวัดอ่างทอง", "สำนักตรวจสอบพิเศษภาค 2 (จังหวัดชลบุรี)", "สำนักตรวจเงินแผ่นดินจังหวัดชลบุรี", "สำนักตรวจเงินแผ่นดินจังหวัดฉะเชิงเทรา", "สำนักตรวจเงินแผ่นดินจังหวัดจันทบุรี", "สำนักตรวจเงินแผ่นดินจังหวัดระยอง", "สำนักตรวจเงินแผ่นดินจังหวัดตราด", "สำนักตรวจเงินแผ่นดินจังหวัดสระแก้ว", "สำนักตรวจสอบพิเศษภาค 3 (จังหวัดนครปฐม)", "สำนักตรวจเงินแผ่นดินจังหวัดนครปฐม", "สำนักตรวจเงินแผ่นดินจังหวัดนนทบุรี", "สำนักตรวจเงินแผ่นดินจังหวัดสุพรรณบุรี", "สำนักตรวจเงินแผ่นดินจังหวัดสมุทรปราการ", "สำนักตรวจเงินแผ่นดินจังหวัดปทุมธานี", "สำนักตรวจเงินแผ่นดินจังหวัดสมุทรสาคร", "สำนักตรวจสอบพิเศษภาค 4 (จังหวัดนครราชสีมา)", "สำนักตรวจเงินแผ่นดินจังหวัดนครราชสีมา", "สำนักตรวจเงินแผ่นดินจังหวัดชัยภูมิ", "สำนักตรวจเงินแผ่นดินจังหวัดบุรีรัมย์", "สำนักตรวจเงินแผ่นดินจังหวัดสุรินทร์", "สำนักตรวจสอบพิเศษภาค 5 (จังหวัดอุบลราชธานี)", "สำนักตรวจเงินแผ่นดินจังหวัดอุบลราชธานี", "สำนักตรวจเงินแผ่นดินจังหวัดอำนาจเจริญ", "สำนักตรวจเงินแผ่นดินจังหวัดศรีสะเกษ", "สำนักตรวจเงินแผ่นดินจังหวัดยโสธร", "สำนักตรวจเงินแผ่นดินจังหวัดมุกดาหาร", "สำนักตรวจเงินแผ่นดินจังหวัดนครพนม", "สำนักตรวจสอบพิเศษภาค 6 (จังหวัดอุดรธานี)", "สำนักตรวจเงินแผ่นดินจังหวัดอุดรธานี", "สำนักตรวจเงินแผ่นดินจังหวัดหนองบัวลำภู", "สำนักตรวจเงินแผ่นดินจังหวัดสกลนคร", "สำนักตรวจเงินแผ่นดินจังหวัดหนองคาย", "สำนักตรวจเงินแผ่นดินจังหวัดบึงกาฬ", "สำนักตรวจเงินแผ่นดินจังหวัดเลย", "สำนักตรวจสอบพิเศษภาค 7 (จังหวัดขอนแก่น)", "สำนักตรวจเงินแผ่นดินจังหวัดขอนแก่น", "สำนักตรวจเงินแผ่นดินจังหวัดกาฬสินธุ์", "สำนักตรวจเงินแผ่นดินจังหวัดร้อยเอ็ด", "สำนักตรวจเงินแผ่นดินจังหวัดมหาสารคาม", "สำนักตรวจสอบพิเศษภาค 8 (จังหวัดเชียงใหม่)", "สำนักตรวจเงินแผ่นดินจังหวัดเชียงใหม่", "สำนักตรวจเงินแผ่นดินจังหวัดลำพูน", "สำนักตรวจเงินแผ่นดินจังหวัดเชียงราย", "สำนักตรวจเงินแผ่นดินจังหวัดแม่ฮ่องสอน", "สำนักตรวจสอบพิเศษภาค 9 (จังหวัดลำปาง)", "สำนักตรวจเงินแผ่นดินจังหวัดลำปาง", "สำนักตรวจเงินแผ่นดินจังหวัดน่าน", "สำนักตรวจเงินแผ่นดินจังหวัดแพร่", "สำนักตรวจเงินแผ่นดินจังหวัดพะเยา", "สำนักตรวจเงินแผ่นดินจังหวัดอุตรดิตถ์", "สำนักตรวจสอบพิเศษภาค 10 (จังหวัดพิษณุโลก)", "สำนักตรวจเงินแผ่นดินจังหวัดพิษณุโลก", "สำนักตรวจเงินแผ่นดินจังหวัดสุโขทัย", "สำนักตรวจเงินแผ่นดินจังหวัดตาก", "สำนักตรวจเงินแผ่นดินจังหวัดเพชรบูรณ์", "สำนักตรวจสอบพิเศษภาค 11 (นครสวรรค์)", "สำนักตรวจเงินแผ่นดินจังหวัดนครสวรรค์", "สำนักตรวจเงินแผ่นดินจังหวัดกำแพงเพชร", "สำนักตรวจเงินแผ่นดินจังหวัดชัยนาท", "สำนักตรวจเงินแผ่นดินจังหวัดอุทัยธานี", "สำนักตรวจเงินแผ่นดินจังหวัดพิจิตร", "สำนักตรวจเงินแผ่นดินจังหวัดสิงห์บุรี", "สำนักตรวจสอบพิเศษภาค 12 (จังหวัดเพชรบุรี)", "สำนักตรวจเงินแผ่นดินจังหวัดเพชรบุรี", "สำนักตรวจเงินแผ่นดินจังหวัดประจวบคีรีขันธ์", "สำนักตรวจเงินแผ่นดินจังหวัดราชบุรี", "สำนักตรวจเงินแผ่นดินจังหวัดกาญจนบุรี", "สำนักตรวจเงินแผ่นดินจังหวัดสมุทรสงคราม", "สำนักตรวจสอบพิเศษภาค 13 (จังหวัดสุราษฎร์ธานี)", "สำนักตรวจเงินแผ่นดินจังหวัดสุราษฎร์ธานี", "สำนักตรวจเงินแผ่นดินจังหวัดพังงา", "สำนักตรวจเงินแผ่นดินจังหวัดภูเก็ต", "สำนักตรวจเงินแผ่นดินจังหวัดระนอง", "สำนักตรวจเงินแผ่นดินจังหวัดชุมพร", "สำนักตรวจสอบพิเศษภาค 14 (จังหวัดนครศรีธรรมราช)", "สำนักตรวจเงินแผ่นดินจังหวัดนครศรีธรรมราช", "สำนักตรวจเงินแผ่นดินจังหวัดกระบี่", "สำนักตรวจเงินแผ่นดินจังหวัดตรัง", "สำนักตรวจเงินแผ่นดินจังหวัดพัทลุง", "สำนักตรวจสอบพิเศษภาค 15 (จังหวัดสงขลา)", "สำนักตรวจเงินแผ่นดินจังหวัดสงขลา", "สำนักตรวจเงินแผ่นดินจังหวัดปัตตานี", "สำนักตรวจเงินแผ่นดินจังหวัดสตูล", "สำนักตรวจเงินแผ่นดินจังหวัดยะลา", "สำนักตรวจเงินแผ่นดินจังหวัดนราธิวาส", "สำนักตรวจสอบภายใน"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงาน ก.พ.",
    "level3": ["สำนักกฎหมาย", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "ศูนย์นักบริหารระดับสูง", "ศูนย์สรรหาและเลือกสรร", "สำนักตรวจสอบและประเมินผลกำลังคน", "สำนักงานเลขาธิการ", "สำนักพัฒนาระบบจำแนกตำแหน่งและค่าตอบแทน", "สำนักพิทักษ์ระบบคุณธรรม", "สำนักมาตรฐานวินัย", "สำนักวิจัยและพัฒนาระบบงานบุคคล", "สถาบันพัฒนาข้าราชการพลเรือน", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มช่วยอำนวยการ", "กลุ่มตรวจสอบภายใน", "ศูนย์จัดการศึกษาในต่างประเทศและบริหารความรู้", "ศูนย์ส่งเสริมจริยธรรม", "ศูนย์ปฏิบัติการต่อต้านทุจริต (ศปท.)", "ศูนย์สร้างความเข้มแข็งในการบริหารทรัพยากรบุคคลของจังหวัดและท้องถิ่น(ศท.)", "กลุ่มทะเบียนประวัติข้าราชการ (ทป.)", "กลุ่มพัฒนาระบบค่าตอบแทน (คต.)", "กลุ่ม ป.ย.ป.", "สำนักงานผู้ดูแลนักเรียนในประเทศจีน", "สำนักงานผู้ดูแลนักเรียนในประเทศฝรั่งเศส", "สำนักงานผู้ดูแลนักเรียนในประเทศเยอรมนี", "สำนักงานผู้ดูแลนักเรียนในประเทศออสเตรเลีย", "สำนักงานผู้ดูแลนักเรียนในประเทศญี่ปุ่น", "สำนักงานผู้ดูแลนักเรียนในประเทศอังกฤษ", "สำนักงานผู้ดูแลนักเรียนในสหรัฐอเมริกา"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "สำนักงานคณะกรรมการกำกับและส่งเสริมการประกอบธุรกิจประกันภัย (คปภ.)",
    "level3": ["ฝ่ายตรวจสอบกิจการภายใน", "ฝ่ายทรัพยากรบุคคล", "สถาบันวิทยาการประกันภัยระดับสูง", "กลุ่มงานวิจัยและพัฒนา", "สำนักนายทะเบียนคุ้มครองผู้ประสบภัยจากรถ", "สำนักเลขาธิการ", "สายกลยุทธ์องค์กร", "ฝ่ายกลยุทธ์และบริหารความเสี่ยง", "กลุ่มงานสื่อสารองค์กร", "กลุ่มงานนโนยายและกิจการระหว่างประเทศ", "สายส่งเสริมและประกันภัยภูมิภาค", "ฝ่ายยุทธศาสตร์การส่งเสริม", "กลุ่มงานส่งเสริมการประกันภัย", "กลุ่มงานบริหารงานประกันภัยภูมิภาค", "ด้านกฎหมาย คดีและคุ้มครองสิทธิประโยชน์", "สายกฎหมายและคดี", "ฝ่ายวางแผนและพัฒนากฎหมาย", "กลุ่มงานกฎหมาย", "กลุ่มงานคดี", "สายคุ้มครองสิทธิประโยชน์", "ฝ่ายคุ้มครองสิทธิประโยชน์", "กลุ่มงานระงับข้อพิพาท", "สายบริหาร", "ฝ่ายงบประมาณ การเงิน และบัญชี", "กลุ่มงานเทคโนโลยีสารสนเทศและการสื่อสาร", "กลุ่มงานบริหารทั่วไป", "ด้านตรวจสอบ", "สายตรวจสอบ", "ฝ่ายตรวจสอบ 1", "กลุ่มงานตรวจสอบ 2", "กลุ่มงานตรวจสอบ 3", "สายวิเคราะห์ธุรกิจประกันภัย", "ฝ่ายพัฒนาและกลยุทธ์การวิเคราะห์", "กลุ่มงานวิเคราะห์ 1", "กลุ่มงานวิเคราะห์ 2", "สายตรวจสอบคนกลางประกันภัย", "ฝ่ายพัฒนานโยบายการกำกับช่องทางการจำหน่าย", "กลุ่มงานตรวจสอบและกำกับคนกลางประกันภัย", "ด้านกำกับ", "สายพัฒนามาตรฐานการกำกับ", "ฝ่ายนโยบายเสถียรภาพระบบประกันภัย", "กลุ่มงานมาตรฐานเงินกองทุนและความมั่นคงทางการเงิน", "กลุ่มงานมาตรฐานธรรมาภิบาลและการดำเนินธุรกิจ", "สายกำกับผลิตภัณฑ์ประกันภัย", "ฝ่ายนโยบายและพัฒนาผลิตภัณฑ์ประกันภัย", "ฝ่ายวิศวกรรมประกันภัย", "กลุ่มงานกำกับผลิตภัณฑ์ประกันชีวิต", "กลุ่มงานกำกับผลิตภัณฑ์ประกันวินาศภัย", "สายกำกับธุรกิจและการลงทุน", "ฝ่ายกำกับธุรกิจประกันภัย", "กลุ่มงานกำกับการลงทุนบริษัทประกันภัย", "สำนักงาน คปภ. ภาค 1 (เชียงใหม่)", "สำนักงาน คปภ. ภาค 2 (นครสวรรค์)", "สำนักงาน คปภ. ภาค 3 (ขอนแก่น)", "สำนักงาน คปภ. ภาค 4 (นครราชสีมา)", "สำนักงาน คปภ. ภาค 5 (อุบลราชธานี)", "สำนักงาน คปภ. ภาค 6 (ชลบุรี)", "สำนักงาน คปภ. ภาค 7 (นครปฐม)", "สำนักงาน คปภ. ภาค 8 (สุราษฎร์ธานี)", "สำนักงาน คปภ. ภาค 9 (สงขลา)"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานบริหารและพัฒนาองค์ความรู้",
    "level3": [""]
}, {
    "level1": "หน่วยงานอิสระ",
    "level2": "สำนักงานผู้ตรวจการแผ่นดิน",
    "level3": ["สำนักนโยบายและแผน"]
}, {
    "level1": "หน่วยงานขึ้นตรงนายกรัฐมนตรี",
    "level2": "สำนักงานพระพุทธศาสนาแห่งชาติ",
    "level3": ["สำนักงานเลขานุการกรม", "กองพุทธศาสนศึกษา", "กองพุทธศาสนสถาน", "สำนักงานพุทธมณฑล", "สำนักงานศาสนสมบัติ", "สำนักเลขาธิการมหาเถรสมาคม", "กองส่งเสริมงานเผยแผ่พระพุทธศาสนา"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานรับรองมาตรฐานและประเมินคุณภาพการศึกษา",
    "level3": [""]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานคณะกรรมการพัฒนาระบบราชการ",
    "level3": ["กองติดตามและประเมินผลการพัฒนาระบบราชการ", "กองพัฒนาระบบราชการ 2", "กองพัฒนาระเบียบราชการส่วนภูมิภาคและความสัมพันธ์กับองค์กรปกครองส่วนท้องถิ่น", "กองพัฒนาระบบราชการ 1", "กองบริหารการเปลี่ยนแปลงและนวัตกรรม", "กองกฎหมายและระเบียบราชการ", "สำนักงานเลขาธิการ", "กองกิจการองค์การมหาชนและหน่วยงานของรัฐรูปแบบอื่น", "ศูนย์ปฏิบัติการต่อต้านทุจริต", "กองส่งเสริมกองตรวจสอบและประเมินผลภาคราชการ", "กองเผยแพร่และสนับสนุนกการมีส่วนร่วมในการพัฒนาระบบราชการ", "กลุ่มตรวจสอบภายใน", "กลุ่มวิชาการ", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มช่วยอำนวยการ"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานปลัดสำนักนายกรัฐมนตรี",
    "level3": ["กองกลาง", "กองการเจ้าหน้าที่", "กองคลัง", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "ศูนย์บริการประชาชน", "สำนักกฎหมายและระเบียบกลาง", "สำนักงานคณะกรรมการกระจายอำนาจให้แก่องค์กรปกครองส่วนท้องถิ่น", "สำนักงานคณะกรรมการข้อมูลข่าวสารของราชการ", "สำนักงานเสริมสร้างเอกลักษณ์ของชาติ", "สำนักตรวจราชการ", "สำนักแผนงานและกิจการพิเศษ", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "สำนักงานคณะกรรมการกำกับและติดตามการปฏิบัติราชการในส่วนภูมิภาค", "สำนักงานขับเคลื่อนการพัฒนาตามปรัชญาเศรษฐกิจพอเพียง", "สำนักงานโฉนดชุมชน"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "กรมประชาสัมพันธ์",
    "level3": ["สำนักงานเลขานุการกรม", "กองคลัง", "กองการเจ้าหน้าที่", "กองกฎหมายและระเบียบ", "ศูนย์เทคโนโลยีสารสนเทศการประชาสัมพันธ์", "สถานีวิทยุกระจายเสียงแห่งประเทศไทย", "สถานีวิทยุโทรทัศน์แห่งประเทศไทย", "สำนักการประชาสัมพันธ์ต่างประเทศ", "สำนักข่าว", "สำนักประชาสัมพันธ์เขต 1", "สำนักประชาสัมพันธ์เขต 2", "สำนักประชาสัมพันธ์เขต 3", "สำนักประชาสัมพันธ์เขต 4", "สำนักประชาสัมพันธ์เขต 5", "สำนักประชาสัมพันธ์เขต 6", "สำนักประชาสัมพันธ์เขต 7", "สำนักประชาสัมพันธ์เขต 8", "สำนักพัฒนาการประชาสัมพันธ์", "สำนักพัฒนานโยบายและแผนการประชาสัมพันธ์", "สำนักส่งเสริมและพัฒนางานเทคนิค", "หน่วยตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "สถานีวิทยุกระจายเสียงแห่งประเทศไทยเพื่อการศึกษา", "ศูนย์ปฏิบัติการข้อมูลข่าวสารเพื่อการประชาสัมพันธ์", "สถาบันการประชาสัมพันธ์"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานคณะกรรมการคุ้มครองผู้บริโภค",
    "level3": ["สำนักงานเลขานุการกรม", "กองคุ้มครองผู้บริโภคด้านโฆษณา", "กองคุ้มครองผู้บริโภคด้านฉลาก", "กองคุ้มครองผู้บริโภคด้านสัญญา", "กองเผยแพร่และประชาสัมพันธ์", "กองกฎหมายและคดี", "สำนักแผนและการพัฒนาการคุ้มครอผู้บริโภค", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน", "สำนักประสานและส่งเสริมการคุ้มครองผู้บริโภคจังหวัด", "กองคุ้มครองผู้บริโภคด้านธุรกิจขายตรงและตลาดแบบตรง"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานส่งเสริมวิสาหกิจขนาดกลางและขนาดย่อม",
    "level3": ["ฝ่ายนโยบายและแผนส่งเสริม SMEs", "ฝ่ายข้อมูลสารสนเทศ", "ฝ่ายวิเคราะห์สถานการณ์และเตือนภัยทางเศรษฐกิจ", "ฝ่ายติดตามและประเมินผล (คลัสเตอร์)", "ฝ่ายติดตามและประเมินผล", "ฝ่ายประสานเครือข่ายผู้ให้บริการ SMEs", "ฝ่ายกฎหมาย", "ฝ่ายติดตามและประเมินผล (โครงการ)", "ฝ่ายส่งเสริมธุรกิจ (ออนไลน์)"]
}, {
    "level1": "หน่วยงานอื่นๆ",
    "level2": "สำนักงานคณะกรรมการการแข่งขันทางการค้า",
    "level3": ["ฝ่ายตรวจสอบภายใน", "ฝ่ายเลขานุการสำนักงาน", "ฝ่ายการประชุมคณะกรรมการ", "ฝ่ายการคลัง", "ฝ่ายบริหารทรัพย์สินและพัสดุ", "ฝ่ายทรัพยากรบุคคลและองค์กร", "ฝ่ายยุทธศาสตร์องค์กร", "ฝ่ายพัฒนาระบบงานด้านการแข่งขันทางการค้า", "ฝ่ายสื่อสารองค์กร", "ฝ่ายกิจการต่างประเทศ", "ฝ่ายนโยบายและความสัมพันธ์ภาครัฐ", "ฝ่ายเผยแพร่ความรู้และส่งเสริมการมีส่วนร่วม", "ฝ่ายกำกับดูแลการรวมธุรกิจ", "ฝ่ายโครงสร้างและระบบธุรกิจสินค้าบริโภค", "ฝ่ายโครงสร้างและระบบธุรกิจสินค้าอุปโภค", "ฝ่ายโครงสร้างและระบบธุรกิจบริการ", "ฝ่ายแสวงหาข้อเท็จจริงทั่วไป", "ฝ่ายแสวงหาข้อเท็จจริงทางเทคโนโลยีสารสนเทศ", "ฝ่ายพัฒนาและประเมินงานสืบสวนสอบสวน", "ฝ่ายมาตรการและนิติกรรมสัญญา", "ฝ่ายบริหารงานคดี"]
}, {
    "level1": "หน่วยงานขึ้นตรงนายกรัฐมนตรี",
    "level2": "สำนักงานคณะกรรมการป้องกันและปราบปรามการทุจริตในภาครัฐ (ป.ป.ท.)",
    "level3": ["สำนักงาน ป.ป.ท.", "เลขาธิการคณะกรรมการป้องกันและปราบปรามการทุจริตในภาครัฐ", "รองเลขาธิการคณะกรรมการป้องกันและปราบปรามการทุจริตในภาครัฐ (1)", "รองเลขาธิการคณะกรรมการป้องกันและปราบปรามการทุจริตในภาครัฐ (2)", "ผู้ช่วยเลขาธิการคณะกรรมการป้องกันและปราบปรามการทุจริต", "สำนักงานเลขาธิการ ฝ่ายบริหารทั่วไป", "สำนักงานเลขาธิการ กลุ่มช่วยอำนวยการ", "สำนักงานเลขาธิการ กลุ่มงานคลัง", "สำนักงานเลขาธิการ กลุ่มงานบริหารงานบุคคล", "สำนักงานเลขาธิการ กลุ่มงานประชาสัมพันธ์", "กองกฎหมาย", "กองการต่างประเทศ", "กองบริหารคดี", "กองบริหารคดี กลุ่มงานบริหารคดีและบริหารทั่วไป", "กองบริหารคดี กลุ่มงานรับเรื่องร้องเรียน", "กองบริหารคดี กลุ่มงานคณะกรรมการ", "กองบริหารคดี กลุ่มงานบริหารติดตามคดี", "กองปราบปรามการทุจริตในภาครัฐ 1", "กองปราบปรามการทุจริตในภาครัฐ 2", "กองปราบปรามการทุจริตในภาครัฐ 3", "กองปราบปรามการทุจริตในภาครัฐ 4", "กองปราบปรามการทุจริตในภาครัฐ 5", "กองป้องกันการทุจริตในภาครัฐ", "กองยุทธศาสตร์และแผนงาน", "กองอำนวยการต่อต้านการทุจริต", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักงานป้องกันและปราบปรามการทุจริตในภาครัฐ เขต 1", "สำนักงานป้องกันและปราบปรามการทุจริตในภาครัฐ เขต 2", "สำนักงานป้องกันและปราบปรามการทุจริตในภาครัฐ เขต 3", "สำนักงานป้องกันและปราบปรามการทุจริตในภาครัฐ เขต 4", "สำนักงานป้องกันและปราบปรามการทุจริตในภาครัฐ เขต 5", "สำนักงานป้องกันและปราบปรามการทุจริตในภาครัฐ เขต 6", "สำนักงานป้องกันและปราบปรามการทุจริตในภาครัฐ เขต 7", "สำนักงานป้องกันและปราบปรามการทุจริตในภาครัฐ เขต 8", "สำนักงานป้องกันและปราบปรามการทุจริตในภาครัฐ เขต 9", "กลุ่มตรวจสอบภายใน", "กลุ่มพัฒนาระบบบริหาร", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "ศูนย์อำนวยการต่อต้านการทุจริตแห่งชาติ"]
}, {
    "level1": "หน่วยงานของรัฐสภา",
    "level2": "สำนักงานเลขาธิการสภาผู้แทนราษฎร",
    "level3": ["สำนักงานประธานสภาผู้แทนราษฎร", "สำนักงานเลขานุการ ก.ร.", "สำนักบริหารงานกลาง", "สำนักพัฒนาบุคลากร", "สำนักการคลังและงบประมาณ", "สำนักการพิมพ์", "สำนักรักษาความปลอดภัย", "สำนักประชาสัมพันธ์", "สถานีวิทยุกระจายเสียงและวิทยุโทรทัศน์หน่วยงานของรัฐสภา", "สำนักองค์การหน่วยงานของรัฐสภาระหว่างประเทศ", "สำนักความสัมพันธ์ระหว่างประเทศ", "สำนักวิชาการ", "สำนักสารสนเทศ", "สำนักการประชุม", "สำนักกฎหมาย", "สำนักรายงานการประชุมและชวเลข", "สำนักกรรมาธิการ 1", "สำนักกรรมาธิการ 2", "สำนักกรรมาธิการ 3", "กลุ่มงานผู้นำฝ่ายค้านในสภาผู้แทนราษฎร", "สำนักนโยบายและแผน", "กลุ่มตรวจสอบภายใน", "สำนักภาษาต่างประเทศ", "สำนักงานหน่วยงานของรัฐสภาประจำจังหวัด (ยกเลิก)", "กลุ่มงานประธานหน่วยงานของรัฐสภา", "สำนักงบประมาณหน่วยงานของรัฐสภา", "กลุ่มตรวจราชการ (ยกเลิก)", "กลุ่มงานเลขาธิการสภาผู้แทนราษฎร", "สำนักบริการทางการแพทย์ประจำหน่วยงานของรัฐสภา"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏเพชรบุรี",
    "level3": ["สำนักงานอธิการบดี (กองกลาง)", "คณะครุศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะเทคโนโลยีการเกษตร", "คณะวิทยาการจัดการ", "คณะวิศวกรรมศาสตร์และโทคโนโลยี", "คณะเทคโนโลยีสารสนเทศ", "คณะพยาบาลศาสตร์", "โรงเรียนสาธิตมหาวิทยาลัยราชภัฏเพชรบุรี", "สำนักอธิการบดี (กองพัฒนานักศึกษา)", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักอธิการบดี (กองนโยบายและแผน)", "สถาบันวิจัยและส่งเสริมศิลปวัฒนธรรม", "สำนักวิทยาบริการและเทคโนโลยีสารสนเทศ", "ศูนย์เทคโนโลยีสารสนเทศ"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏเพชรบูรณ์",
    "level3": ["มหาวิทยาลัยราชภัฏเพชรบูรณ์", "สถาบันวิจัยและพัฒนา", "คณะครุศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะวิทยาการจัดการ", "คณะเทคโนโลยีการเกษตรและเทคโนโลยีอุตสาหกรรม", "สำนักงานอธิการบดี", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักศิลปะและวัฒนธรรม"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สถาบันดนตรีกัลยาณิวัฒนา",
    "level3": ["สำนักงานสถาบัน", "สำนักวิชาดุริยางคศาสตร์"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานพัฒนาพิงคนคร",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "สถาบันเทคโนโลยีปทุมวัน",
    "level3": ["คณบดีคณะวิศวกรรมศาสตร์", "คณบดีคณะวิทยาศาสตร์", "ผู้อำนวยการสำนักวิจัยและบริการวิชาการ", "ผู้อำนวยการศูนย์ภาษาและคอมพิวเตอร์", "ผู้อำนวยการสำนักงานอธิการบดี", "ผู้อำนวยการกองนโยบายและแผน"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏภูเก็ต",
    "level3": ["คณะเทคโนโลยีการเกษตร", "คณะครุศาสตร์", "คณะวิทยาการจัดการ", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาศาสตร์และเทคโนโลยี", "วิทยาลัยการท่องเที่ยว", "สำนักงานอธิการบดี", "สำนักศิลปะและวัฒนธรรม", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สถาบันวิจัยและพัฒนา", "ศูนย์ภาษา", "กองกลาง", "กองพัฒนานักศึกษา", "กองนโยบายและแผน"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "โรงงานไพ่ กรมสรรพสามิต",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏพระนคร",
    "level3": ["สำนักงานอธิการบดี", "คณะเทคโนโลยีอุตสาหกรรม", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์และเทคโนโลยี", "วิทยาลัยการฝึกหัดครู", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักศิลปะและวัฒนธรรม", "กองนโยบายและแผน", "สำนักส่งเสริมและงานทะเบียน", "บัณฑิตวิทยาลัย"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยนราธิวาสราชนครินทร์",
    "level3": ["สำนักงานอธิการบดี", "กองกลาง", "กองนโยบายและแผน", "กองพัฒนานักศึกษา", "กองส่งเสริมวิชาการและงานทะเบียน", "กองบริหารทรัพยากรบุคคล", "กองคลัง", "คณะเกษตรศาสตร์", "คณะพยาบาลศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะวิศวกรรมศาสตร์", "คณะศิลปศาสตร์", "สถาบันอิสลามและอาหรับศึกษา", "วิทยาลัยการอาชีพตากใบ", "วิทยาลัยเกษตรและเทคโนดลยีนราธิวาส", "วิทยาลัยเทคนิคนราธิวาส", "คณะแพทยศาสตร์", "หลักสูตรประกาศนียบัตรบัณฑิต สาขาวิชาชีพครู"]
}, {
    "level1": "หน่วยงานขึ้นตรงนายกรัฐมนตรี",
    "level2": "สำนักงานตำรวจแห่งชาติ",
    "level3": ["สำนักงานเลขานุการตำรวจแห่งชาติ", "กองการต่างประเทศ", "กองสารนิเทศ", "สำนักงานคณะกรรมการนโยบายตำรวจแห่งชาติ", "กองบินตำรวจ", "กองวินัย", "สำนักงานยุทธศาสตร์ตำรวจ", "กองยุทธศาสตร์ สำนักงานยุทธศาสตร์ตำรวจ", "กลุ่มงานวิเคราะห์และกำหนดยุทธศาสตร์  กองยุทธศาสตร์", "กลุ่มงานแผนทางการบริหาร  กองยุทธศาสตร์", "กลุ่มงานขับเคลื่อนยุทธศาสตร์  กองยุทธศาสตร์", "กลุ่มงานประเมินผลยุทธศาสตร์  กองยุทธศาสตร์", "กลุ่มงานบริหารความเสี่ยง  กองยุทธศาสตร์", "กองแผนงานอาชญากรรม   สำนักงานยุทธศาสตร์ตำรวจ", "กลุ่มงานป้องกันปราบปรามอาชญากรรม  กองแผนงานอาชญากรรม", "กลุ่มงานป้องกันอาชญากรรมพิเศษ  กองแผนงานอาชญากรรม", "กลุ่มงานการมีส่วนร่วมของประชาชน  กองแผนงานอาชญากรรม", "กลุ่มงานวิเคราะห์และประเมินผล  กองแผนงานอาชญากรรม", "กองแผนงานกิจการพิเศษ  สำนักงานยุทธศาสตร์ตำรวจ", "กลุ่มงานกิจการพิเศษ  กองแผนงานกิจการพิเศษ", "กลุ่มงานความมั่นคง  กองแผนงานกิจการพิเศษ", "กลุ่มงานจราจร  กองแผนงานกิจการพิเศษ", "กลุ่มงานบริการประชาชน  กองแผนงานกิจการพิเศษ", "กลุ่มงานวิเคราะห์และประเมินผล  กองแผนงานกิจการพิเศษ", "กองวิจัย   สำนักงานยุทธศาสตร์ตำรวจ", "กลุ่มงานส่งเสริมและประสานงานวิจัย  กองวิจัย", "กลุ่มงานวิจัยและประเมินผล 1  กองวิจัย", "กลุ่มงานวิจัยและประเมินผล 2  กองวิจัย", "สำนักงานส่งกำลังบำรุง", "สำนักงานกำลังพล", "สำนักงานงบประมาณและการเงิน", "สำนักงานกฎหมายและคดี", "สำนักงานคณะกรรมการข้าราชการตำรวจ", "สำนักงานจเรตำรวจ", "สำนักงานตรวจสอบภายใน", "กองบัญชาการตำรวจนครบาล", "ตำรวจภูธรภาค 1", "ตำรวจภูธรภาค 2", "ตำรวจภูธรภาค 3", "ตำรวจภูธรภาค 4", "ตำรวจภูธรภาค 5", "ตำรวจภูธรภาค 6", "ตำรวจภูธรภาค 7", "ตำรวจภูธรภาค 8", "ตำรวจภูธรภาค 9", "กองบัญชาการตำรวจสอบสวนกลาง", "กองบัญชาการตำรวจปราบปรามยาเสพติด", "กองบัญชาการตำรวจสันติบาล", "สำนักงานตรวจคนเข้าเมือง", "กองบัญชาการตำรวจตระเวนชายแดน", "สำนักงานพิสูจน์หลักฐานตำรวจ", "สำนักงานเทคโนโลยีสารสนเทศและการสื่อสาร", "กองบัญชาการศึกษา", "โรงเรียนนายร้อยตำรวจ", "โรงพยาบาลตำรวจ", "สถาบันฝึกอบรมระหว่างประเทศว่าด้วยการดำเนินการให้เป็นไปตามกฎหมาย กรุงเทพฯ (ILEA Bangkok)", "กองบัญชาการตำรวจท่องเที่ยว"]
}, {
    "level1": "สำนักงานตำรวจแห่งชาติ",
    "level2": "โรงพิมพ์ตำรวจ สำนักงานตำรวจแห่งชาติ",
    "level3": [""]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "การท่าเรือแห่งประเทศไทย",
    "level3": ["สำนักเลขานุการคณะกรรมการการท่าเรือแห่งประเทศไทย", "สำนักบริหารความเสี่ยงและควบคุมภายใน", "ฝ่ายตรวจสอบ", "ฝ่ายอำนวยการ", "สำนักบรรษัทภิบาล (กองกำกับดูแลองค์กร)", "ฝ่ายบริหารทรัพยากรบุคคล", "สำนักแพทย์และอนามัย", "ฝ่ายการเงินและบัญชี", "สำนักบัญชี", "สำนักบริหารการเงิน", "สำนักท่าเรือภูมิภาค", "ฝ่ายพัฒนาธุรกิจและการตลาด", "ฝ่ายกลยุทธ์องค์กร", "ฝ่ายเทคโนโลยีสารสนเทศ", "ฝ่ายการช่าง", "ฝ่ายการร่องน้ำ", "ท่าเรือกรุงเทพ", "ฝ่ายปฏิบัติการเรือและสินค้า", "ฝ่ายบริการท่าและเครื่องมือทุ่นแรง", "ฝ่ายบริหารงานสนับสนุน", "ท่าเรือแหลมฉบัง", "สำนักปฏิบัติการ", "สำนักบริหารงานสนับสนุน"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏพิบูลสงคราม",
    "level3": ["มหาวิทยาลัยราชภัฏพิบูลสงคราม", "สำนักศิลปะและวัฒนธรรม", "สำนักงานอธิการบดี", "บัณฑิตวิทยาลัย", "วิทยาลัยการจัดการและพัฒนาท้องถิ่น", "วิทยาลัยการพยาบาล", "คณะครุศาสตร์", "คณะเทคโนโลยีการเกษตรและอาหาร", "คณะเทคโนโลยีอุตสาหกรรม", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์และเทคโนโลยี", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยสงขลานครินทร์",
    "level3": ["ศูนย์คอมพิวเตอร์", "สำนักงานอธิการบดี", "ศูนย์เครื่องมือวิทยาศาสตร์", "คณะการจัดการสิ่งแวดล้อม", "คณะทรัพยากรธรรมชาติ", "คณะทันตแพทยศาสตร์", "คณะนิติศาสตร์", "คณะพยาบาลศาสตร์", "คณะแพทยศาสตร์", "คณะเภสัชศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์", "คณะวิศวกรรมศาสตร์", "สำนักวิจัยและพัฒนา", "คณะศิลปศาสตร์", "คณะอุตสาหกรรมเกษตร", "บัณฑิตวิทยาลัย", "คณะเศรษฐศาสตร์", "สำนักทรัพยากรการเรียนรู้คุณหญิงหลง อรรถกระวีสุนทร", "สถาบันฮาลาล", "อุทยานวิทยาศาสตร์", "สถาบันทรัพยากรทะเลและชายฝั่ง", "ศูนย์บริการวิชาการ", "วิทยาลัยนานาชาติ", "คณะสัตวแพทยศาสตร์", "ศูนย์ส่งเสริมศิลปะและวัฒนธรรม", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการสื่อสาร", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะศิลปกรรมศาสตร์", "คณะศึกษาศาสตร์", "วิทยาลัยอิสลามศึกษา", "สำนักวิทยบริการ", "สำนักงานอธิการบดีวิทยาเขตปัตตานี", "สำนักส่งเสริมและการศึกษาต่อเนื่อง", "สถาบันวัฒนธรรมศึกษากัลยาณิวัฒนา", "คณะรัฐศาสตร์", "คณะพยาบาลศาสตร์ วิทยาเขตปัตตานี", "คณะการแพทย์แผนไทย", "สถาบันสันติศึกษา", "คณะเทคนิคการแพทย์", "วิทยาลัยชุมชนภูเก็ต", "คณะการบริการและการท่องเที่ยว", "คณะเทคโนโยีและสิ่งแวดล้อม", "คณะวิเทศศึกษา", "สำนักงานอธิการบดีวิทยาเขตภูเก็ต", "วิทยาลัยชุมชนสุราษฎร์ธานี", "คณะวิทยาศาสตร์และเทคโนโลยีอุตสาหกรรม", "คณะศิลปศาสตร์และวิทยาการจัดการ", "สำนักงานอธิการบดีวิทยาเขตสุราษฎร์ธานี", "คณะพาณิชยศาสตร์และการจัดการ", "สำนักงานอธิการบดีวิทยาเขตตรัง", "พิพิธภัณฑสถานธรรมชาติวิทยา 50 พรรษา สยามบรมราชกุมารี", "วิทยาลัยนานาชาติยางพาราไทย-จีน", "ศูนย์ส่งเสริมและพัฒนาการเรียนรู้", "วิทยาลัยการคอมพิวเตอร์", "คณะสถาปัตยกรรมศาสตร์"]
}, {
    "level1": "กระทรวงพลังงาน",
    "level2": "บริษัท ปตท. จำกัด (มหาชน)",
    "level3": [""]
}, {
    "level1": "กระทรวงพาณิชย์",
    "level2": "องค์การคลังสินค้า",
    "level3": ["สำนักพัฒนาธุรกิจ", "สำนักบริหารสินทรัพย์", "สำนักตรวจสอบภายใน", "สำนักธุรกิจบริการ", "สำนักบริหารกลาง", "สำนักบริหารยุทธศาสตร์", "สำนักบริหารการเงิน", "สำนักการบัญชี", "สำนักกฎหมายและคดี", "สำนักเทคโนโลยีสารสนเทศ", "สำนักข้อมูลกลาง", "สำนักโลจิสติกส์"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "การรถไฟแห่งประเทศไทย",
    "level3": ["ฝ่ายโครงการพิเศษและก่อสร้าง", "ฝ่ายการช่างกล", "ฝ่ายปฏิบัติการเดินรถ", "ฝ่ายบริการโดยสาร", "สำนักงานนโยบายแผนวิจัยและพัฒนา", "ฝ่ายบริหารทรัพย์สิน", "ฝ่ายการช่างโยธา", "ฝ่ายบริการสินค้า", "ฝ่ายอาณัติสัญญาณและโทรคมนาคม"]
}, {
    "level1": "หน่วยงานขึ้นตรงนายกรัฐมนตรี",
    "level2": "สำนักงานคณะกรรมการพิเศษเพื่อประสานงานโครงการอันเนื่องมาจากพระราชดำริ (สำนักงาน กปร.)",
    "level3": ["สำนักงานเลขาธิการ", "กองประสานงานโครงการพื้นที่ 1", "กองประสานงานโครงการพื้นที่ 2", "กองประสานงานโครงการพื้นที่ 3", "กองประสานงานโครงการพื้นที่ 4", "กองแผนงานและวิเทศสัมพันธ์", "กองพัฒนาทรัพยากรบุคคลเพื่อขับเคลื่อนแนวพระราชดำริ", "กองศึกษาและขยายผลการพัฒนาตามแนวพระราชดำริ", "กองกิจกรรมพิเศษ", "กองประชาสัมพันธ์", "กองติดตามประเมินผล", "ศูนย์สารสนเทศ", "ศูนย์ปฏิบัติการต่อต้านการทุจริต", "กลุ่มพัฒนาระบบบริหาร", "กลุ่มตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏร้อยเอ็ด",
    "level3": ["สำนักงานอธิการบดี กองกลาง", "สำนักงานอธิการบดี กองนโยบายและแผน", "คณะศิลปศาสตร์และวิทยาศาสตร์", "สำนักวิชาการและประมวลผล", "สำนักกิจการนักศึกษา", "คณะครุศาสตร์", "คณะบริหารธุรกิจและการบัญชี", "คณะเทคโนโลยีสารสนเทศ", "คณะนิติรัฐศาสตร์", "สถาบันการจัดการความรู้", "สถาบันวิจัยและพัฒนา", "บัณฑิตวิทยาลัย", "คณะพยาบาลศาสตร์"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน",
    "level3": ["มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน นครราชสีมา", "สถาบันชุณหะวัณเพื่อการพัฒนาธุรกิจเอสเอ็มอีอย่างยั่งยืน", "สถาบันบริการวิชาการแห่งมหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน", "สำนักงานอธิการบดี", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมวิชาการและงานทะเบียน", "คณะบริหารธุรกิจ", "คณะวิทยาศาสตร์และศิลปศาสตร์", "คณะวิศวกรรมศาสตร์และสถาปัตยกรรมศาสตร์", "คณะศิลปกรรมและออกแบบอุตสาหกรรม", "สำนักงานวิทยาเขตสุรินทร์", "คณะเกษตรศาสตร์และเทคโนโลยี", "คณะเทคโนโลยีการจัดการ", "สำนักงานวิทยาเขตขอนแก่น", "คณะครุศาสตร์อุตสาหกรรม", "คณะวิศวกรรมศาสตร์", "คณะบริหารธุรกิจและเทคโนโลยีสารสนเทศ", "สำนักงานวิทยาเขตสกลนคร", "คณะอุตสาหกรรมและเทคโนโลยี", "คณะทรัพยากรธรรมชาติ", "มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตขอนแก่น", "มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตสกลนคร", "มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตสุรินทร์"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา",
    "level3": ["มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา", "สำนักงานอธิการบดี", "คณะวิศวกรรมศาสตร์", "คณะบริหารธุรกิจและศิลปศาสตร์", "คณะศิลปกรรมและสถาปัตยกรรมศาสตร์", "คณะวิทยาศาสตร์และเทคโนโลยีการเกษตร", "วิทยาลัยเทคโนโลยีและสหวิทยากร", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สถาบันถ่ายทอดเทคโนโลยีชุมชน", "สถาบันวิจัยและพัฒนา", "สถาบันวิจัยเทคโนโลยีเกษตร", "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา ลำปาง", "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา น่าน", "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา พิษณุโลก", "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา เชียงราย", "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา ตาก"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยเทคโนโลยีราชมงคลพระนคร",
    "level3": ["สำนักงานอธิการบดี (สอ.)", "คณะครุศาสตร์อุตสาหกรรม (คอ.)", "คณะเทคโนโลยีคหกรรมศาสตร์ (ทค.)", "คณะเทคโนโลยีสื่อสารมวลชน (ทส.)", "คณะบริหารธุรกิจ (บธ.)", "คณะวิทยาศาสตร์และเทคโนโลยี (วท.)", "คณะวิศวกรรมศาสตร์ (วศ.)", "คณะศิลปศาสตร์ (ศศ.)", "คณะอุตสาหกรรมสิ่งทอและออกแบบแฟชั่น (อสอ.)", "คณะสถาปัตยกรรมศาสตร์และการออกแบบ (สถอ.)", "สถาบันวิจัยและพัฒนา (สวพ.)", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ (สวส.)", "สำนักส่งเสริมวิชาการและงานทะเบียน (สวท.)", "กองกลาง (กก.)", "กองคลัง (กค.)", "กองนโยบายและแผน (กนผ.)", "กองบริหารงานบุคคล (กบ.)", "กองพัฒนานักศึกษา (กพศ.)", "กองวิเทศสัมพันธ์ (กวส.)", "กองสื่อสารองค์กร (กสอ.)", "กองศิลปวัฒนธรรม (กศ.)", "สำนักงานตรวจสอบภายใน (ตสน.)", "สำนักประกันคุณภาพ (สปภ.)", "ศูนย์การจัดการความรู้ (KM)", "ศูนย์บ่มเพาะธุรกิจ (UBi)", "สถานีวิทยุ", "สถาบันภาษา", "สภาคณาจารย์", "สถาบันสหวิทยาการดิจิตัลและหุ่นยนต์ (สด.)"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์",
    "level3": ["สำนักงานอธิการบดี", "คณะวิศวกรรมศาสตร์", "คณะสถาปัตยกรรมและการออกแบบ", "คณะอุตสาหกรรมและเทคโนโลยี", "คณะบริหารธุรกิจ", "คณะศิลปศาสตร์", "คณะอุตสาหกรรมการโรงแรมและการท่องเที่ยว", "วิทยาลัยเพาะช่าง", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมวิชาการและงานทะเบียน"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย",
    "level3": ["สำนักงานอธิการบดี", "สำนักงานวิทยาเขตตรัง", "สำนักงานวิทยาเขตนครศรีธรรมราช", "คณะเกษตรศาสตร์", "คณะบริหารธุรกิจ", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะวิทยาศาสตร์และเทคโนโลยีการประมง", "คณะวิศวกรรมศาสตร์", "คณะศิลปศาสตร์", "คณะอุตสาหกรรมเกษตร", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมวิชาการและงานทะเบียน", "วิทยาลัยการโรงแรมและการท่องเที่ยว", "วิทยาลัยเทคโนโลยีอุตสาหกรรมและการจัดการ", "วิทยาลัยรัตภูมิ", "คณะสถาปัตยกรรมศาสตร์", "คณะสัตวแพทยศาสตร์", "คณะเทคโนโลยีการจัดการ", "คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี", "คณะวิศวกรรมศาสตร์และเทคโนโลยี"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยเทคโนโลยีราชมงคลธัญบุรี",
    "level3": ["สำนักงานอธิการบดี", "คณะครุศาสตร์อุตสาหกรรม", "โรงเรียนสาธิตนวัตกรรม", "คณะเทคโนโลยีการเกษตร", "คณะเทคโนโลยีคหกรรมศาสตร์", "คณะเทคโนโลยีสื่อสารมวลชน", "คณะบริหารธุรกิจ", "คณะวิทยาศาตร์และเทคโนโลยี", "คณะวิศวกรรมศาสตร์", "คณะศิลปกรรมศาสตร์", "คณะศิลปศาสตร์", "คณะสถาปัตยกรรมศาสตร์", "วิทยาลัยการแพทย์แผนไทย", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมวิชาการและงานทะเบียน", "กองกลาง", "กองคลัง", "กองนโยบายและแผน", "กองบริหารงานบุคคล", "กองพัฒนานักศึกษา", "กองประชาสัมพันธ์", "หน่วยตรวจสอบภายใน", "สภาคณาจารย์และข้าราชการ", "สำนักจัดการทรัพย์สิน", "สำนักสหกิจศึกษา", "สำนักบัณฑิตศึกษา", "สำนักประกันคุณภาพการศึกษา", "สำนักงานสภามหาวิทยาลัย", "กองอาคารสถานที่", "กองยุทธศาสตร์ต่างประเทศ", "กองกฏหมาย", "คณะพยาบาลศาสตร์"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก",
    "level3": ["สำนักงานอธิการบดี", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สถาบันวิจัยและพัฒนา", "สำนักงานวิทยาเขตจันทบุรี", "คณะเกษตรศาสตร์และทรัพยากรธรรมชาติ", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะเทคโนโลยีอุตสาหกรรมการเกษตร", "คณะเทคโนโลยีสังคม", "คณะบริหารธุรกิจและเทคโนโลยีสารสนเทศ", "คณะวิศวกรรมศาสตร์และสถาปัตยกรรมศาสตร์"]
}, {
    "level1": "หน่วยงานขึ้นตรงนายกรัฐมนตรี",
    "level2": "สำนักงานราชบัณฑิตยสภา",
    "level3": ["สำนักงานเลขานุการกรม", "กองธรรมศาสตร์และการเมือง", "กองวิทยาศาสตร์", "กองศิลปกรรม"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏราชนครินทร์",
    "level3": ["กองกลาง", "กองนโยบายและแผน", "กองพัฒนานักศึกษา", "สำนักงานอธิการบดี", "คณะครุศาสตร์", "คณะเทคโนโลยีอุตสาหกรรม", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์และเทคโนโลยี", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมวิชาการและงานทะเบียน", "ศูนย์ศิลปะ วัฒนธรรมและท้องถิ่น", "หน่วยตรวจสอบภายใน", "บัณฑิตวิทยาลัย", "สถาบันพัฒนาคุณภาพครู", "สถาบันเศรษฐกิจพอเพียง"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยรามคำแหง",
    "level3": ["สำนักงานอธิการบดี", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดนครศรีธรรมราช", "กองกลาง", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดปราจีนบุรี", "กองคลัง", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดอุทัยธานี", "กองการเจ้าหน้าที่", "สำนักวิทยบริการ", "กองแผนงาน", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดนครพนม", "กองกิจการนักศึกษา", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดแพร่", "กองบริการการศึกษา", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดอำนาจเจริญ", "กองอาคารสถานที่", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดนครราชสีมา", "กองงานวิทยาเขตบางนา", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดสุโขทัย", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดขอนแก่น", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดศรีสะเกษ", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดตรัง", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดลพบุรี", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดหนองบัวลำภู", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดบุรีรัมย์", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดชัยภูมิ", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดเพชรบูรณ์", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดอุดรธานี", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดกาญจนบุรี", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดเชียงราย", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดสุรินทร์", "สาขาวิทยบริการเฉลิมพระเกียรติต่างประเทศ", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดสงขลา", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดพังงา", "สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดเชียงใหม่", "คณะนิติศาสตร์", "คณะบริหารธุรกิจ", "คณะมนุษยศาสตร์", "คณะรัฐศาสตร์", "คณะวิทยาศาสตร์", "คณะศึกษาศาสตร์", "คณะเศรษฐศาสตร์", "สำนักบริการวิชาการและทดสอบประเมินผล", "มหาวิทยาลัยรามคำแหง", "สำนักหอสมุดกลาง", "สำนักเทคโนโลยีการศึกษา", "สำนักพิมพ์", "สถาบันคอมพิวเตอร์", "บัณฑิตวิทยาลัย", "สถาบันวิจัยและพัฒนา", "คณะวิศวกรรมศาสตร์", "สำนักกีฬา", "โรงเรียนสาธิตมหาวิทยาลัยรามคำแหง (ฝ่ายประถม)", "สถาบันการศึกษานานาชาติ", "สถาบันพัฒนาทรัพยากรมนุษย์", "สถาบันวิทยาศาสตร์สุขภาพ", "สถาบันศิลปวัฒนธรรม", "ศูนย์สื่อการสอนทางอิเล็กทรอนิกส์ (E-Learning)", "สถาบันภาษา", "สถาบันกฎหมายไทย", "สำนักประกันคุณภาพการศึกษา", "สำนักทดสอบทางอิเล็กทรอนิกส์", "คณะศิลปกรรมศาสตร์", "สำนักสหกิจศึกษาและพัฒนาอาชีพ", "คณะสื่อสารมวลชน", "ศูนย์บ่มเพาะวิสาหกิจและจัดการทรัพย์สินทางปัญญา", "สำนักงานตรวจสอบภายใน", "สำนักบริการข้อมูลและสารสนเทศ", "คณะพัฒนาทรัพยากรมนุษย์", "สถาบันวิจัยสัตว์ในภูมิภาคเขตร้อน", "คณะทัศนมาตรศาสตร์", "คณะสาธารณสุขศาสตร์", "สำนักงานบริหารความเสี่ยงและควบคุมภายใน", "คณะธุรกิจการบริการ"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "การยางแห่งประเทศไทย",
    "level3": ["", "สำนักผู้ว่าการ", "สำนักตรวจสอบภายใน", "ฝ่ายกฎหมาย", "ฝ่ายการคลัง", "ฝ่ายทรัพยากรมนุษย์", "ฝ่ายเทคโนโลยีสารสนเทศ", "ฝ่ายบริหารทรัพย์สิน", "ฝ่ายพัฒนาเกษตรกรและสถาบันเกษตรกร", "ฝ่ายยุทธศาสตร์องค์กร", "ฝ่ายวิจัยและพัฒนาเศรษฐกิจยาง", "ฝ่ายวิจัยและพัฒนาอุสาหกรรมยาง", "ฝ่ายส่งเสริมและพัฒนาการผลิต", "สถาบันวิจัยยาง", "การยางแห่งประเทศไทยเขตภาคเหนือ", "การยางแห่งประเทศไทยเขตภาคตะวันออกเฉียงเหนือตอนบน", "การยางแห่งประเทศไทยเขตภาคตะวันออกเฉียงเหนือตอนล่าง", "การยางแห่งประเทศไทยเขตภาคกลางและภาคตะวันออก", "การยางแห่งประเทศไทยเขตภาคใต้ตอนบน", "การยางแห่งประเทศไทยเขตภาคใต้ตอนกลาง", "การยางแห่งประเทศไทยเขตภาคใต้ตอนล่าง", "หน่วยธุรกิจ"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ",
    "level3": ["สำนักงานอธิการบดี", "คณะครุศาสตร์อุตสาหกรรม", "คณะเทคโนโลยีการเกษตรและอุตสาหกรรมเกษตร", "คณะบริหารธุรกิจและเทคโนโลยีสารสนเทศ", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะวิศวกรรมศาสตร์และสถาปัตยกรรมศาสตร์", "คณะศิลปศาสตร์", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมวิชาการและงานทะเบียน"]
}, {
    "level1": "กระทรวงวัฒนธรรรม",
    "level2": "ศูนย์มานุษยวิทยาสิรินธร (องค์การมหาชน)",
    "level3": ["ศูนย์มานุษยวิทยาสิรินธร (องค์การมหาชน)"]
}, {
    "level1": "กระทรวงพาณิชย์",
    "level2": "ศูนย์ส่งเสริมศิลปาชีพระหว่างประเทศ (องค์การมหาชน)",
    "level3": ["สายงานยุทธศาสตร์", "สายงานส่งเสริมคุณค่าหัตถศิลป์", "สายงานพัฒนาผลิตภัณฑ์และศักยภาพ", "สายงานพัฒนาการตลาด"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "บริษัท สหโรงแรมไทยและท่องเที่ยว จำกัด",
    "level3": [""]
}, {
    "level1": "กระทรวงการท่องเที่ยวและกีฬา",
    "level2": "การกีฬาแห่งประเทศไทย",
    "level3": [""]
}, {
    "level1": "หน่วยงานขึ้นตรงนายกรัฐมนตรี",
    "level2": "ศูนย์อำนวยการบริหารจังหวัดชายแดนภาคใต้ (ศอ.บต.)",
    "level3": ["สำนักบริหารกลาง", "สำนักนโยบายและแผน", "ศุนย์ดำรงธรรมจังหวัดชายแดนภาคใต้", "สำนักบรหารยุติธรรม", "สำนักพัฒนาบุคลากร", "สำนักประสานนโยบายสังคมจิตวิทยา", "สำนักประสานนโยบายการศึกษา ศาสนา วัฒนธรรม", "สำนักประสานนโยบายการพัฒนาเสรษฐกิจและสังคม", "สำนักสานสนเทศและประชาสัมพันธ์", "กองกิจการต่างประเทศ", "สำนักงานเลขาธิการ", "กลุ่มงานตรวจสอบภายใน", "กองคลัง", "สำนักการให้ความช่วยเหลือเยียวยา", "สวทม. (กิจการวิทยุ ภาคภาษมลายู)", "สำนักประสานเครือค่ายภาคประชาสังคม", "ศูนย์เทคโนดลยีสารสนเทศและการสื่อสาร", "กองกิจการฮัจญ์", "กองอาคารสถานที่และยานพาหนะ", "สำนักสนับสนุนการผลิตและธุรกิจฮาลาล", "สำนักการท่องเที่ยวและกีฬา"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยสวนดุสิต",
    "level3": ["สำนักงานมหาวิทยาลัย", "สำนักงานวิทยาเขตสุพรรณบุรี", "คณะครุศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะพยาบาลศาสตร์", "โรงเรียนการเรือน", "โรงเรียนการท่องเที่ยวและการบริการ", "โรงเรียนสาธิตละอออุทิศ", "บัณฑิตวิทยาลัย", "สำนักบริหารกลยุทธ์", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สถาบันภาษา ศิลปะและวัฒนธรรม", "สถาบันวิจัยและพัฒนา", "สำนักกิจการพิเศษ", "สวนดุสิตโพล", "สวนดุสิตโฮมเบเกอรี่", "ศูนย์การศึกษานอกที่ตั้ง ลำปาง", "ศูนย์การศึกษานอกที่ตั้ง นครนายก", "ศูนย์การศึกษานอกที่ตั้ง หัวหิน", "ศูนย์การศึกษานอกที่ตั้ง ตรัง", "ศูนย์การศึกษานอกที่ตั้ง", "ศูนย์บริการสื่อและสิ่งพิมพ์กราฟฟิคไซท์", "ศูนย์พัฒนาทุนมนุษย์", "ศูนย์บริการทดสอบทางวิชาการสวนดุสิต"]
}, {
    "level1": "หน่วยงานของรัฐสภา",
    "level2": "สำนักงานเลขาธิการวุฒิสภา",
    "level3": ["สำนักงานประธานวุฒิสภา", "สำนักประชาสัมพันธ์", "สำนักบริหารงานกลาง", "สำนักการคลังและงบประมาณ", "สำนักการต่างประเทศ", "สำนักวิชาการ", "สำนักการประชุม", "สำนักกำกับและตรวจสอบ", "สำนักกรรมาธิการ 1", "สำนักกรรมาธิการ 2", "กลุ่มงานตรวจสอบภายใน", "สำนักกฎหมาย", "สำนักภาษาต่างประเทศ", "กลุ่มช่วยอำนวยการนักบริหาร", "สำนักพัฒนาทรัพยากรบุคคล", "สำนักเทคโนโลยีสารสนเทศและการสื่อสาร", "สำนักรายงานการประชุมและชวเลข", "สำนักการพิมพ์", "สำนักกรรมาธิการ 3", "สำนักนโยบายและแผน"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏสงขลา",
    "level3": ["คณะครุศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะศิลปกรรมศาสตร์", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะเทคโนโลยีการเกษตร", "คณะเทคโนโลยีอุตสาหกรรม", "บัณฑิตวิทยาลัย", "วิทยาลัยนวัตกรรมและการจัดการ", "สำนักงานอธิการบดี", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักศิลปะและวัฒนธรรม", "สถาบันวิจัยและพัฒนา", "กองนโยบายและแผน", "กองพัฒนานักศึกษา", "สถาบันพัฒนาการศึกษาพิเศษ", "โรงเรียนสาธิตมหาวิทยาลัยราชภัฏสงขลา", "หน่วยตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "บรรษัทตลาดรองสินเชื่อที่อยู่อาศัย",
    "level3": [""]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อมแห่งประเทศไทย",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏสกลนคร",
    "level3": ["สำนักงานอธิการบดี", "กองนโยบายและแผน", "คณะครุศาสตร์", "คณะเทคโนโลยีการเกษตร", "คณะเทคโนโลยีอุตสาหกรรม", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์และเทคโนโลยี", "สถาบันวิจัยและพัฒนา", "สำนักภาษา ศิลปะและวัฒนธรรม", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมวิชาการและงานทะเบียน", "บัณฑิตวิทยาลัย"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏสุรินทร์",
    "level3": ["สำนักงานอธิการบดี", "คณะครุศาสตร์", "คณะเทคโนโลยีอุตสาหกรรม", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์และเทคโนโลยี", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการฯ", "สำนักศิลปะและวัฒนธรรม", "สำนักส่งเสริมวิชาการฯ", "บัณฑิตวิทยาลัย", "คณะเกษตรและอุตสาหกรรมเกษตร", "โรงเรียนสาธิต", "กองกลาง", "กองพัฒนานักศึกษา", "กองบริหารงานบุคคล", "กองคลัง", "กองนโยบายและแผน"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "บริษัท รถไฟฟ้า ร.ฟ.ท. จำกัด",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏสุราษฎร์ธานี",
    "level3": ["คณะครุศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "วิทยาลัยนานาชาติการท่องเที่ยว", "คณะนิติศาสตร์", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะพยาบาลศาสตร์", "บัณฑิตวิทยาลัย", "สำนักงานอธิการบดี", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักศิลปะและวัฒนธรรม", "สถาบันวิจัยและพัฒนา", "กองนโยบายและแผน", "งานบริการวิชาการ"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏศรีสะเกษ",
    "level3": ["คณะศิลปศาสตร์และวิทยาศาสตร์", "คณะครุศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะบริหารธุรกิจและการบัญชี", "วิทยาลัยกฎหมายและการปกครอง", "สำนักส่งเสริมและบริการวิชาการ", "สำนักงานอธิการบดี"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏสวนสุนันทา",
    "level3": ["วิทยาลัยพยาบาลและสุขภาพ", "สำนักงานอธิการบดี", "โรงเรียนสาธิตมหาวิทยาลัยราชภัฏสวนสุนันทา", "สำนักศิลปะและวัฒนธรรม", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สถาบันวิจัยและพัฒนา", "ศูนย์การศึกษาจังหวัดระนอง", "คณะครุศาสตร์", "ศูนย์การศึกษาจังหวัดนครปฐม", "วิทยาลัยสหเวชศาสตร์", "วิทยาลัยการภาพยนตร์ ศิลปะการแสดงและสื่อใหม่", "วิทยาลัยโลจิสติกส์และซัพพลายเชน", "ศูนย์การศึกษาจังหวัดอุดรธานี", "ศูนย์การศึกษาจังหวัดสมุทรสงคราม", "วิทยาลัยสถาปัตยกรรมศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "วิทยาลัยนานาชาติ", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะวิทยาการจัดการ", "คณะเทคโนโลยีอุตสาหกรรม", "คณะศิลปกรรมศาสตร์", "บัณฑิตวิทยาลัย", "วิทยาลัยนวัตกรรมและการจัดการ"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยสุโขทัยธรรมาธิราช",
    "level3": ["กองแผนงาน"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยศิลปากร",
    "level3": ["มหาวิทยาลัยศิลปากร", "สำนักงานสภามหาวิทยาลัย", "สำนักงานอธิการบดี (วังท่าพระ/ตลิ่งชัน)", "สำนักงานอธิการบดี (พระราชวังสนามจันทร์)", "สำนักงานอธิการบดี (เพชรบุรี)", "บัณฑิตวิทยาลัย", "คณะจิตรกรรม ประติมากรรมและภาพพิมพ์", "คณะสถาปัตยกรรมศาสตร์", "คณะโบราณคดี", "คณะมัณฑนศิลป์", "คณะอักษรศาสตร์", "คณะศึกษาศาสตร์", "คณะวิทยาศาสตร์", "คณะเภสัชศาสตร์", "คณะวัศวกรรมศาสตร์และเทคโนโลยีอุตสาหกรรม", "คณะดุริยางคศาสตร์", "คณะสัตวศาสตร์และเทคโนโลยีการเกษตร", "คณะวิทยาการจัดการ", "คณะเทคโนโลยีสารสนเทศและการสื่อสาร", "วิทยาลัยนานชาติ", "สถาบันวิจัยและพัฒนา", "สำนักหอสมุดกลาง", "ศูนย์คอมพิวเตอร์", "หอศิลป์"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยเทคโนโลยีสุรนารี",
    "level3": ["ส่วนแผนงาน สำนักงานอธิการบดี", "ส่วนแผนงาน", "สำนักวิชาวิทยาศาสตร์", "สำนักวิชาเทคโนโลยีสังคม", "สำนักวิชาเทคโนโลยีการเกษตร", "สำนักวิชาวิศวกรรมศาสตร์", "สำนักวิชาแพทยศาสตร์", "สำนักวิชาพยาบาลศาสตร์", "สำนักวิชาทันตแพทยศาสตร์", "สำนักวิชาสาธารณสุขศาสตร์"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "บริษัท โรงแรมท่าอากาศยานสุวรรณภูมิ จำกัด",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยศรีนครินทรวิโรฒ",
    "level3": ["สำนักงานอธิการบดี", "ส่วนแผนและยุทธศาสตร์"]
}, {
    "level1": "กระทรวงการท่องเที่ยวและกีฬา",
    "level2": "การท่องเที่ยวแห่งประเทศไทย (ททท.)",
    "level3": ["กองวิจัยการตลาด / กลุ่มฐานข้อมูลการตลาด", "กองแผนนโยบาย", "กองกลยุทธ์การตลาด", "ฝ่ายติดตามและบริหารความเสี่ยง (กตป.)", "กลุ่มสารสนเทศการตลาด", "กลุ่มสารสนเทศองค์กร", "กองตลาดเอเชียตะวันออก", "กองตลาดอาเซียน เอเชียใต้ฯ", "กองตลาดยุโรปฯ", "กองตลาดอเมริกา", "กองตลาดภาคเหนือ", "กองตลาดภาคกลาง", "กองตลาดภาคตะวันออก", "กองตลาดภาคตะวันออกเฉียงเหนือ", "กองตลาดภาคใต้", "ฝ่ายบริการการตลาด (กขส.)", "กองเผยแพร่โฆษณาต่างประเทศ", "กองเผยแพร่โฆษณาในประเทศ", "กองประชาสัมพันธ์ต่างประเทศ", "กองประชาสัมพันธ์ในประเทศ", "กองส่งเสริมแหล่งท่องเที่ยว", "กองส่งเสริมบริการท่องเที่ยว", "กองเผยแพร่ความรู้ด้านการท่องเที่ยว", "ฝ่ายกิจกรรม", "ฝ่ายลงทุนธุรกิจท่องเที่ยว", "กองกฎหมายและระเบียบ", "กองบริหารจัดซื้อจัดจ้าง", "ฝ่ายทรัพยากรบุคคล", "ฝ่ายบัญชีและงบประมาณ", "ฝ่ายการเงิน", "สำนักตรวจสอบภายใน", "สำนักผู้ว่าการ"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานส่งเสริมการจัดประชุมและนิทรรศการ",
    "level3": [""]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "บรรษัทประกันสินเชื่ออุตสาหกรรมขนาดย่อม",
    "level3": [""]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "บริษัท การบินไทย จำกัด (มหาชน)",
    "level3": [""]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "บริษัท ไทย-อะมาดิอุส เซาท์อีสต์ เอเชีย จำกัด",
    "level3": [""]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สำนักงานเลขาธิการนายกรัฐมนตรี",
    "level3": ["สำนักงานเลขาธิการ (สลธ.)", "กองการต่างประเทศ (กตป.)", "กองงานนายกรัฐมนตรี (กรน.)", "กองประสานงานการเมือง (กปม.)", "กองประสานนโยบายและยุทธศาสตร์ (กนย.)", "กองพิธีการ (กพธ.)", "กองสถานที่ ยานพาหนะ และรักษาความปลอดภัย (กสร.)", "ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร (ศทส.)", "สำนักโฆษก (สนฆ.)", "กลุ่มตรวจสอบภายใน (กตส.)", "กลุ่มพัฒนาระบบบริหาร (กพบ.)", "ศูนย์ปฏิบัติการต่อต้านการทุจริต (ศปท.)", "สำนักงานผู้แทนการค้าไทย (สผท.)"]
}, {
    "level1": "กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม",
    "level2": "บริษัท ไปรษณีย์ไทย จำกัด",
    "level3": ["ฝ่ายอำนวยการกลาง", "ฝ่ายสื่อสารองค์กร", "ฝ่ายความปลอดภัย อาชีวอนามัยและสภาพแวดล้อมในการทำงาน", "ฝ่ายกลยุทธ์องค์กร", "ฝ่ายระบบการกำกับดูแลกิจการ", "ฝ่ายพัฒนางานตรวจสอบ", "ฝ่ายบริหารงานกลาง", "ฝ่ายการบริหารลูกค้า", "ฝ่ายบริหารประสบการณ์ลูกค้าไปรษณีย์ด่วนพิเศษ/ โลจิสติกส์", "ฝ่ายขายและการตลาดไปรษณีย์ด่วนพิเศษ/โลจิสติกส์", "ฝ่ายบริหารประสบการณ์ลูกค้าบริการไปรษณีย์", "ฝ่ายขายและการตลาดบริการไปรษณีย์", "ฝ่ายบริหารประสบการณ์ลูกค้าระหว่างประเทศ", "ฝ่ายขายและการตลาดระหวางประเทศ", "ฝ่ายระบบบริการระหว่างประเทศ", "ฝ่ายจัดหาและพัสดุ", "ฝ่ายก่อสร้างและบำรุงรักษา", "ฝ่ายบริหารที่ดินและอาคาร", "ฝ่ายกฎหมาย", "ฝ่ายทรัพยากรบุคคลและวินัย", "ฝ่ายพัฒนาบุคลากร", "ฝ่ายสวัสดิการและแรงงานสัมพันธ์", "ฝ่ายสุขภาพและอนามัย", "ฝ่ายงบประมาณและต้นทุน", "ฝ่ายการเงิน", "ฝ่ายการบัญชี", "ฝ่ายบัญชีย่อยบริการ", "ฝ่ายจัดระบบบริการ", "ฝ่ายบริหารเครือข่าย", "ฝ่ายบริการสินค้าไปรษณีย์", "ฝ่ายเครื่องจักรและอุปกรณ์", "ฝ่ายจัดระบบศูนย์ไปรษณีย์", "ฝ่ายยานพาหนะขนส่ง", "ฝ่ายพัฒนาระบบเทคโนโลยีสารสนเทศ", "ฝ่ายปฏิบัติการเทคโนโลยีสารสนเทศ", "ฝ่ายอุปกรณ์เทคโนโลยีสารสนเทศ", "สำนักงานศูนย์ไปรษณีย์นครหลวง", "ฝ่ายปฏิบัติงานตรวจสอบ 1", "สำนักงานไปรษณีย์นครหลวง 1", "สำนักงานไปรษณีย์เขต 1", "สำนักงานไปรษณีย์เขต 10", "ฝ่ายปฏิบัติงานตรวจสอบ 2", "สำนักงานไปรษณีย์นครหลวง 2", "สำนักงานไปรษณีย์เขต 2", "สำนักงานไปรษณีย์นครหลวง 3", "สำนักงานไปรษณีย์เขต 3", "สำนักงานไปรษณีย์นครหลวง 4", "สำนักงานไปรษณีย์เขต 4", "สำนักงานไปรษณีย์เขต 5", "สำนักงานไปรษณีย์เขต 6", "สำนักงานไปรษณีย์เขต 7", "สำนักงานไปรษณีย์เขต 8", "สำนักงานไปรษณีย์เขต 9"]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "บริษัท ไทยสมายล์แอร์เวย์ จำกัด",
    "level3": [""]
}, {
    "level1": "กระทรวงการคลัง",
    "level2": "โรงงานยาสูบ",
    "level3": [""]
}, {
    "level1": "กระทรวงแรงงาน",
    "level2": "สถาบันส่งเสริมความปลอดภัย อาชีวอนามัย และสภาพแวดล้อมในการทำงาน (องค์การมหาชน)",
    "level3": ["", "สถาบันส่งเสริมความปลอดภัยฯ", "สำนักบริหารกลาง", "สำนักยุทธศาสตร์", "สำนักวิจัยและพัฒนา", "สำนักบริการวิชาการ", "สำนักส่งเสริมและฝึกอบรม", "ศูนย์ส่งเสริมความปลอดภัยอาชีวอนามัยภูมิภาค", "หน่วยตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม",
    "level2": "บริษัท ทีโอที จำกัด (มหาชน)",
    "level3": ["กรรมการผู้จัดการใหญ่", "สำนักกรรมการผู้จัดการใหญ่", "สำนักตรวจสอบ", "สายงานพัฒนาองค์กร", "สายงานการเงิน", "สายงานการตลาดและเทคโนโลยีสารสนเทศ", "สายงานกฎหมาย", "หน่วยธุรกิจโครงสร้างพื้นฐาน", "หน่วยธุรกิจสื่อสารไร้สาย", "หน่วยธุรกิจขายและบริการลูกค้าองค์กร", "หน่วยธุรกิจโทรศัพท์ประจำที่และบรอดแบนด์", "หน่วยธุรกิจไอดีซีและคลาวด์"]
}, {
    "level1": "สำนักนายกรัฐมนตรี",
    "level2": "สถาบันคุณวุฒิวิชาชีพ",
    "level3": [""]
}, {
    "level1": "กระทรวงคมนาคม",
    "level2": "บริษัท ขนส่ง จำกัด",
    "level3": [""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏเทพสตรี",
    "level3": ["สำนักงานอธิการบดี", "คณะครุศาสตร์", "คณะเทคโนโลยีสารสนเทศ", "คณะเทคโนโลยีอุตสาหกรรม", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์และเทคโนโลยี", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "มหาวิทยาลัยราชภัฏเทพสตรี", "สำนักศิลปะและวัฒนธรรม", "โรงเรียนสาธิต มหาวิทยาลัยราชภัฏเทพสตรี", "โรงเรียนสาธิต สาขาวัดพระพุทธบาทราชวรมหาวิหาร", "ศูนย์วิทยาศาสตร์", "ศูนย์ภาษา", "สำนักบริหารทรัพยากรมนุษย์", "สำนักงานสภามหาวิทยาลัย", "สำนักงานมาตรฐานและประกันคุณภาพการศึกษา", "หน่วยตรวจสอบภายใน", "สำนักงานประสานงานบัณฑิต", "ศูนย์นวัตกรรมและเทคโนโลยีการศึกษา", "โครงการจัดการศึกษาภาคบัณฑิต สาขาวิชานิติศาสตร์", "โครงการจัดการศึกษาสำหรับนักบริหาร", "สำนักงานจัดการทรัพย์สินและรายได้"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยทักษิณ",
    "level3": ["ฝ่ายบริหารงานสภามหาวิทยาลัย", "ฝ่ายบริหารกลางและทรัพยากรบุคคล", "ฝ่ายแผนงาน", "ฝ่ายวิชาการ", "งานวิเทศสัมพันธ์", "ฝ่ายตรวจสอบภายใน", "ฝ่ายการคลังและทรัพย์สิน", "ฝ่ายนิติการ", "ฝ่ายประกันคุณภาพการศึกษา", "สำนักคอมพิวเตอร์", "ฝ่ายบริหารวิทยาเขตสงขลา", "สำนักหอสมุด", "วิทยาลัยการจัดการเพื่อการพัฒนา", "สถาบันปฏิบัติการชุมชนเพื่อการศึกษาแบบบูรณาการ", "วิทยาลัยนานาชาติ", "ฝ่ายกิจการนิสิตวิทยาเขตสงขลา", "คณะศึกษาศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะศิลปกรรมศาสตร์", "คณะเศรษฐศาสตร์และบริหารธุรกิจ", "คณะนิติศาสตร์", "บัณฑิตวิทยาลัย", "สถาบันทักษิณคดีศึกษา", "ฝ่ายบริหารวิทยาเขตพัทลุง", "ฝ่ายกิจการนิสิตวิทยาเขตพัทลุง", "คณะวิทยาศาสตร์", "คณะวิทยาการสุขภาพและการกีฬา", "คณะเทคโนโลยีและการพัฒนาชุมชน", "สถาบันวิจัยและพัฒนา", "วิทยาลัยภูมิปัญญาชุมชน", "คณะวิศวกรรมศาสตร์", "คณะพยาบาลและสหเวชศาสตร์"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยธรรมศาสตร์",
    "level3": ["กองบริหารศูนย์ท่าพระจันทร์", "กองทรัพยากรมนุษย์", "กองแผนงาน", "กองกิจการนักศึกษา", "กองคลัง", "กองบริการวิชาการ", "กองบริหารศูนย์รังสิต", "สำนักงานตรวจสอบภายใน", "โรงพยาบาลธรรมศาสตร์เฉลิมพระเกียรติ", "กองบริหารศูนย์ลำปาง", "คณะนิติศาสตร์", "คณะพานิชยศาสตร์และการบัญชี", "คณะรัฐศาสตร์", "คณะเศรษฐศาสตร์", "คณะสังคมสงเคราะห์ศาสตร์", "คณะศิลปศาสตร์", "คณะวารสารศาสตร์และสื่อสารมวลชน", "คณะสังคมวิทยาและมนุษยวิทยา", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะแพทยศาสตร์", "คณะวิศวกรรมศาสตร์", "คณะทันตแพทยศาสตร์", "คณะสหเวชศาสตร์", "คณะพยาบาลศาสตร์", "คณะสถาปัตยกรรมศาสตร์และการผังเมือง", "คณะศิลปกรรมศาสตร์", "วิทยาลัยนวัตกรรม", "สถาบันเทคโนโลยีนานาชาติสิรินธร", "หอสมุดแห่งมหาวิทยาลัยธรรมศาสตร์", "วิทยาลัยพัฒนศาสตร์ ป๋วย อึ๊งภากรณ์", "สำนักงานทะเบียนนักศึกษา", "สำนักเสริมศึกษา", "สถาบันไทยคดีศึกษา", "สถาบันทรัพยากรมนุษย์", "สำนักงานศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร", "สถาบันเอเซียตะวันออกศึกษา", "สถาบันภาษา", "ศูนย์ศึกษาเอเปค", "วิทยาลัยสหวิทยาการ", "กองวิเทศสัมพันธ์", "กองนิติการ", "คณะสาธารณสุขศาสตร์", "วิทยาลัยนานาชาติปรี พนมยงค์", "กองบริหารการวิจัย", "กองพัฒนาคุณภาพ", "ศูนย์ออสเตรเลียศึกษา", "ศูนย์อาเซียนศึกษา", "วิทยาลัยแพทยศาสตร์นานาชาติจุฬาภรณ์", "คณะเภสัชศาสตร์", "วิทยาลัยโลกคดีศึกษา", "คณะวิทยาการเรียนรู้และศึกษาศาสตร์", "สำนักงานวิทยาศาสตร์และเทคโนโลยีชั้นสูง"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏอุบลราชธานี",
    "level3": ["กองกลาง", "กองนโยบายและแผน", "กองบริหารงานบุคคล", "กองพัฒนานักศึกษา", "กองคลัง", "กองสวัสดิการ", "สำนักงานอธิการบดี", "คณะเกษตรศาสตร์", "ศูนย์คอมพิวเตอร์", "คณะครุศาสตร์", "คณะเทคโนโลยีอุตสาหกรรม", "คณะบริหารธุรกิจและการจัดการ", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาศาสตร์", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักศิลปะและวัฒนธรรม", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สำนักบริการวิชาการชุมชน", "บัณฑิตวิทยาลัย", "คณะแพทย์แผนไทยและแพทย์ทางเลือก", "คณะพยาบาลศาสตร์", "คณะนิติศาสตร์", "คณะสาธารณสุขศาสตร์", "คณะวิทยาการคอมพิวเตอร์", "สำนักงานตรวจสอบภายใน"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยอุบลราชธานี",
    "level3": ["มหาวิทยาลัยอุบลราชธานี", "สำนักวิทยบริการ", "สำนักงานอธิการบดี", "คณะเภสัชศาสตร์", "โรงพิมพ์มหาวิทยาลัยอุบลราชธานี (หน่วยงานวิสาหกิจ)", "สำนักคอมพิวเตอร์และเครือข่าย", "คณะบริหารศาสตร์", "คณะศิลปประยุกต์และสถาปัตยกรรมศาสตร์", "วิทยาลัยแพทยศาสตร์และการสาธารณสุข", "คณะนิติศาสตร์", "คณะรัฐศาสตร์", "คณะพยาบาลศาสตร์", "สถานปฏิบัติการโรงแรมและการท่องเที่ยว (หน่วยงานวิสาหกิจ)", "สำนักทรัพย์สินและสิทธิประโยชน์", "คณะเกษตรศาสตร์", "คณะวิทยาศาสตร์", "คณะวิศวกรรมศาสตร์", "คณะศิลปศาสตร์"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏอุดรธานี",
    "level3": ["คณะครุศาสตร์", "คณะเทคโนโลยี", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาศาสตร์", "คณะวิทยาการจัดการ", "บัณฑิตวิทยาลัย", "สำนักวิชาศึกษาทั่วไป", "ศูนย์บริการการศึกษาบึงกาฬ", "โรงเรียนสาธิตมหาวิทยาลัยราชภัฏอุดรธานี", "สำนักงานอธิการบดี", "กองนโยบายและแผน", "สำนักศิลปะและวัฒนธรรม", "สำนักส่งเสริมวิชาการและงานทะเบียน", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยพะเยา",
    "level3": ["กองบริหารงานวิจัยและประกันคุณภาพการศึกษา", "กองแผนงาน", "คณะเกษตรศาสตร์และทรัพยากรธรรมชาติ", "คณะเทคโนโลยีสารสนเทศและการสื่อสาร", "คณะนิติศาสตร์", "คณะพยาบาลศาสตร์", "คณะแพทยศาสตร์", "คณะเภสัชศาสตร์", "คณะวิทยาการจัดการและสารสนเทศศาสตร์", "คณะวิทยาศาสตร์", "คณะวิทยาศาสตร์การแพทย์", "คณะวิศวกรรมศาสตร์", "คณะศิลปศาสตร์", "คณะสถาปัตยกรรมศาสตร์และศิลปกรรมศาสตร์", "คณะสหเวชศาสตร์", "วิทยาลัยพลังงานและสิ่งแวดล้อม", "คณะทันตแพทยศาสตร์", "คณะรัฐศาสตร์และสังคมศาสตร์"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏอุตรดิตถ์",
    "level3": ["สำนักงานอธิการบดี", "คณะครุศาสตร์", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะเกษตรศาสตร์", "คณะเทคโนโลยีอุตสาหกรรม", "วิทยาลัยนานาชาติ", "ศูนย์วิทยบริการจังหวัดแพร่", "วิทยาลัยน่าน", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักงานคณะกรรมการมาตรฐานคุณภาพและตรวจสอบภายใน", "ศูนย์วิทยาศาสตร์และเทคโนโลยี", "บัณฑิตวิทยาลัย"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยเทคโนโลยีราชมงคลกรุงเทพ",
    "level3": ["สำนักงานอธิการบดี", "ศูนย์ประชาสัมพันธ์", "คณะครุศาสตร์อุตสาหกรรม", "คณะเทคโนโลยีคหกรรมศาสตร์", "คณะบริหารธุรกิจ", "คณะวิทยาศาสตร์และเทคโนโลยี", "คณะวิศวกรรมศาสตร์", "คณะศิลปศาสตร์", "คณะอุตสาหกรรมสิ่งทอ", "สภาบันวิจัยและพัฒนา", "สำนักงานวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมวิชาการและงานทะเบียน", "กองกลาง", "กองคลัง", "กองนโยบายและแผน", "กองบริหารงานบุคคล", "กองพัฒนานักศึกษา", "ศูนย์ศิลปวัฒนธรรม", "สำนักงานประกันคุณภาพการศึกษา"]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์",
    "level3": ["กองกลาง", "กองนโยบายและแผน", "กองพัฒนานักศึกษา", "สำนักงานอธิการบดี", "คณะครุศาสตร์", "คณะเทคโนโลยีการเกษตร", "คณะเทคโนโลยีอุตสาหกรรม", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์และเทคโนโลยี", "สถาบันวิจัยและพัฒนา", "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ", "สำนักส่งเสริมการเรียนรู้และบริการวิชาการ", "สำนักส่งเสริมวิชาการและงานทะเบียน", "บัณฑิตวิทยาลัย", "วิทยาลัยนวัตกรรมการจัดการ", "คณะสาธารณสุขศาสตร์", "โรงเรียนสาธิต", "หน่วยตรวจสอบภายใน", "สำนักงานสภามหาวิทยาลัย", "มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์ สระแก้ว"]
}, {
    "level1": "กระทรวงเกษตรและสหกรณ์",
    "level2": "สำนักงานพิพิธภัณฑ์เกษตรเฉลิมพระเกียรติพระบาทสมเด็จพระเจ้าอยู่หัว (องค์การมหาชน)",
    "level3": ["สำนักนวัตกรรมเกษตรเศรษฐกิจพอเพียง", "สำนักสื่อสารสัมพันธ์และเครือข่าย", "สำนักพัฒนากิจการ", "สำนักอำนวยการ", "สำนักพัฒนาพิพิธภัณฑ์และองค์ความรู้", ""]
}, {
    "level1": "กระทรวงศึกษาธิการ",
    "level2": "มหาวิทยาลัยราชภัฏยะลา",
    "level3": ["กองนโยบายและแผน", "กองบริการการศึกษา", "กองพัฒนานักศึกษา", "สำนักงานบัณฑิตศึกษา", "สำนักงานประกันคุณภาพ", "สำนักงานอธิการบดี", "สำนักวิทยและเทคโนโลยีสารสนเทศ", "สถาบันวิจัยและพัฒนาชายแดนภาคใต้", "รร.สาธิต มรภ.ยะลา", "คณะครุศาสตร์", "คณะมนุษยศาสตร์และสังคมศาสตร์", "คณะวิทยาการจัดการ", "คณะวิทยาศาสตร์เทคโนโลยีและการเกษตร"]
}]